[
    {
        "id": "b278c879-d1a2-41bb-ad34-c52f822d054a",
        "locationId": "4 1/2 Railroad Ave, Oneonta, NY 13820, United States",
        "mobility": 0.0,
        "accessibility": 0.0,
        "vision": 0.0,
        "sensory": 1.0,
        "language": 0.0,
        "reviewContent": "This place was recommended to us by a couple of families so we decided to stop by to check it out. It was an old Depot to a train station (hence the name) tucked away from the main town. You can tell this is where the locals come.\n\nIf you're looking for a fancy place looks elsewhere, this place is no frills. However what they lack in decor they make up in food. Most of our dishes were quiet good, with the exception of the salad which had a very chewy chicken to it. Fried calamari was excellent probably because it was extra fried (same with the fries). I had a wrap and the kids had grilled cheese and chicken tenders.\n\nAgain the only knock was the weird tasting chicken on the salad but other than that a solid choice.",
        "qualityReview": 4.4,
        "overallScore": 0.2
    },
    {
        "id": "32f6f8c0-3a96-4bc8-a3a5-2a42b90914ef",
        "locationId": "24 Oneida St, Oneonta, NY 13820, United States",
        "mobility": 0.0,
        "accessibility": 0.0,
        "vision": 0.0,
        "sensory": 1.0,
        "language": 0.0,
        "reviewContent": "The food here is usually really delicious! My personal favorite is the chicken marsala with linguini. I've been a handful of times when the food wasn't as amazing as it could have been, but it hasn't stopped me from going back. The wait staff have always had wonderful personalities and great service which more than makes up for when food isn't top notch. The atmosphere could use some updating or brighter lights. The atmosphere definitely doesn't draw me in. Its the food and service",
        "qualityReview": 4.5,
        "overallScore": 0.2
    },
    {
        "id": "db42b22b-629c-4389-a74e-deef5cc59527",
        "locationId": "4 Clinton Plaza Dr, Oneonta, NY 13820, United States",
        "mobility": 1.0,
        "accessibility": 0.0,
        "vision": 0.0,
        "sensory": 0.0,
        "language": 0.0,
        "reviewContent": "Really delicious healthy vegan Tacos, smoothie was refreshing.\n\nThere are two tables outside the front of the store with 2 chairs each. They are under a covered overhang so shielded from rain & direct Sun. Nice to eat outside.\n\nWiFi is usable but not great. 9Mbps download, less than 1Mbps upload.\nWish staff was masked.\nWould go there again for the food. Either eating outside or takeout.\nIt’s a couple blocks away from Oneonta’s Nehwah Park so it would be nice to get takeout and then eat in the park.\n\nThere is a curb right next door (Wolf Wilde Goldsmith) where you can ramp up to the front door of Feel Good. Not sure about the width of the main door but it seems navigable with a wheelchair.",
        "qualityReview": 4.8,
        "overallScore": 0.2
    },
    {
        "id": "a1642a9a-e122-451b-94bd-dde0f91f19df",
        "locationId": "4918 NY-28, Cooperstown, NY 13326, United States",
        "mobility": 0.0,
        "accessibility": 0.0,
        "vision": 0.0,
        "sensory": 1.0,
        "language": 0.0,
        "reviewContent": "We’re in town for Dreams Park and I wanted to take my son for some food outside the park.  This place had good reviews and was close to the park so we agreed to try it.\n\nUpon arrival I noticed the parking situation was odd.  Grass parking and parking lot parking, double parked.  Seems ok until you go to leave and realize you have to drive through a smoldering pile of burning tree debris because people didn’t think the back row would need to leave at some point.  A few cones leaving a lane would be ideal.\n\nOnto the restaurant.  We arrived around 8, sat ourselves at a table, and were greeted promptly with menus.  It was busy but didn’t seem overwhelming.  The waitress took our drink order (fountain soda) and came back a few minutes later.  We placed our order for food at 8:13…I ordered a dozen wings with a side of fries and my son ordered their chicken fritters with fries.  Both are types of food that are typically cooked fairly quickly.  So we sit and wait…and we wait…and we wait.  My son is growing impatient and just wants to leave so finally at 9:06 I ask the waitress how long before our food is out.  She checks and comes back and says 5 minutes.  6 minutes later my wings arrive.  My sons food is nowhere to be seen and our fries are still missing.  But I’ve got my wings right so all is good.  4 minutes later and my sons food comes out along with our fries, yay…63 minutes for wings and boneless wings.  Not once did the waitress stop by and mention the food order would take so long or that they were overwhelmed and it would be longer than normal.  Fail!\n\nThe food thankfully was good.  5 stars for the wings (bourbon bbq) and 3 stars for the chicken fritters and fries.  Fries weren’t as hot as they should have been which leads me to believe they sat around for several minutes before getting to us.  The portion of chicken fritters seemed small, but it was based on weight and not qty so perhaps it was a typical portion.\n\nOverall, not terribly pleased with our outing.  They seemed short staffed which didn’t help.  There wasn’t a dedicated bartender so the waiters/waitresses were all bartenders so that took away from the table service.  We were a table of 2 with what I thought were quick orders but apparently not.  2 stars total",
        "qualityReview": 4.4,
        "overallScore": 0.2
    },
    {
        "id": "5d84f0c2-39c7-4ab8-8d37-696b9d60d5f8",
        "locationId": "4918 NY-28, Cooperstown, NY 13326, United States",
        "mobility": 0.0,
        "accessibility": 0.0,
        "vision": 1.0,
        "sensory": 1.0,
        "language": 0.0,
        "reviewContent": "Stopped in for a beer and had their “Cowboy” nachos. These were homemade potato s chips with pulled pork, cheese, sour cream, salsa, and fresh jalapeños. Very good. Good variety of domestic and craft beer on tap. Place was quiet the day we were there. But they do have a nice sized outdoor seating area as well under a tent outback. Signage is not very good—if I hadn’t searched for a place to go, I would never noticed it by driving by.",
        "qualityReview": 4.4,
        "overallScore": 0.4
    },
    {
        "id": "13f7c838-7ce4-4eeb-bbca-32bc677833a4",
        "locationId": "82 Main St, Oneonta, NY 13820, United States",
        "mobility": 0.0,
        "accessibility": 0.0,
        "vision": 0.0,
        "sensory": 1.0,
        "language": 0.0,
        "reviewContent": "Decent townie bar with an awesome staff. Quiet enough when we went for our catered event, but some shady figures chilling across the bar watching us the whole time. Bit weird, but still a great time. Darts, and billiards in the back; lots of great beer on tap.",
        "qualityReview": 3.8,
        "overallScore": 0.2
    },
    {
        "id": "951f0ec3-ff94-4055-9755-3d827d0249a0",
        "locationId": "222 S Main St, Oneonta, NY 13820, United States",
        "mobility": 0.0,
        "accessibility": 0.0,
        "vision": 0.0,
        "sensory": 1.0,
        "language": 0.0,
        "reviewContent": "Legit clubbing experiences in a small town are hard to come by. This place highly impressed me with their sound system, speedy service, and lights. If you like dancing it will be hard to leave.",
        "qualityReview": 3.8,
        "overallScore": 0.2
    }
]