[
    {
        "id": "f2e0488e-2643-47a4-9ad6-19afbb6613fd",
        "locationId": "180 Madison Ave, Albany, NY 12202, United States",
        "mobility": 0.0,
        "accessibility": 0.0,
        "vision": 0.0,
        "sensory": 1.0,
        "language": 0.0,
        "reviewContent": "6 of us enjoyed dinner here on Sunday evening before a nearby show. If you have an event in the area, this is a great option for a centrally located restaurant. And they are open Sundays, which was hard to find.\nEven without a reservation, we managed to get in. However, we were there early; I suspect a table might have been harder to get later on. Service was amazing! Drink refills without asking, servers checking in just the right amount, and overall great customer service.\nIt is a small pub, which means it gets loud. This was fine for us, but if you are looking for a quiet spot to have long conversations, this will not be the place you want.\nPub food and pizza seems to be their specialty. Boneless wings were very good; a medium sauce had just enough spice. Mozzarella sticks also good (great marinara!) and a decent amount of them too. The pizza was delicious! I snuck a piece of my hubby's pepperoni pizza and loved it! Homemade sauce, great crust, and a nice balance of sauce to cheese. Sandwiches we ordered were good, just not outstanding. If I go back before another show, I would honestly order some more apps and pizza (I was thinking about getting chicken tenders, but didn't. Bet they are great!).\nOverall, a solid choice if you are in the area for a show and looking for some great pub apps and pizza.",
        "qualityReview": 4.5,
        "overallScore": 0.2
    },
    {
        "id": "cc142be7-f218-4efd-92b1-c1fd305495da",
        "locationId": "204 Lark St, Albany, NY 12210, United States",
        "mobility": 1.0,
        "accessibility": 0.0,
        "vision": 0.0,
        "sensory": 0.0,
        "language": 0.0,
        "reviewContent": "Nice place to grab a bite to eat with lots of varieties such as a biscotti, coffee, lattes, breakfast and smoothies.\n\nThe cafe is located downstairs in the building, it is a small cafe that is not wheelchair accessible friendly and their bathroom is extremely narrow and tight and also smelled like someone was smoking inside. 🙅🏽‍♂️\nThey make amazing smoothie and the people behind the counters were very nice and friendly.\nIt is definitely a place to visit and a great experience.",
        "qualityReview": 4.5,
        "overallScore": 0.2
    },
    {
        "id": "9f6a1f89-ac80-4600-a5d6-5abed749833b",
        "locationId": "115 Philip St, Albany, NY 12202, United States",
        "mobility": 0.0,
        "accessibility": 0.0,
        "vision": 0.0,
        "sensory": 1.0,
        "language": 0.0,
        "reviewContent": "Quiet little dinner with a lovely atmosphere, polite staff, and delicous food. My pancakes were fluffy and delicous, bacon was fresh and chewy with some crunch. My partners eggs and home fries were fresh and tasty, we both enjoyed the meal and atmosphere. A real rare dinner, not many hole in the wall dinners left around the area that have this level of service, and quality. Highly recommend.",
        "qualityReview": 4.2,
        "overallScore": 0.2
    },
    {
        "id": "9d433a14-4862-41d5-9308-75a484dd499b",
        "locationId": "Coffee Shop, 466 Madison Ave, Albany, NY 12208, United States",
        "mobility": 0.0,
        "accessibility": 0.0,
        "vision": 0.0,
        "sensory": 1.0,
        "language": 0.0,
        "reviewContent": "The style, lights, furniture, orange finger cake, vibrant atmosphere-high level.\n\nmatcha latte - poor quality, too much milk and barely felt matcha taste.",
        "qualityReview": 4.6,
        "overallScore": 0.2
    },
    {
        "id": "cbc89691-577e-4a32-9227-cd8cd8fbe08f",
        "locationId": "25 Erie Blvd Suite 1, Albany, NY 12204, United States",
        "mobility": 0.0,
        "accessibility": 0.0,
        "vision": 0.0,
        "sensory": 1.0,
        "language": 0.0,
        "reviewContent": "I had a lovely morning here! I went about 930 on a Friday and was the only one there. The barista, Jay, was super friendly and chatty. I had a pistachio latte which was delicious. I stayed to read a book in quiet and got a comfy chair in the corner. There’s an outdoor seating area which I would love to sit at during my next visit. Highly recommend!",
        "qualityReview": 3.9,
        "overallScore": 0.2
    }
]