[
    {
        "id": "42265c65-734b-4919-809a-c09ee170c4d4",
        "locationId": "398 E Fairmount Ave, Lakewood, NY 14750, United States",
        "mobility": 0.0,
        "accessibility": 0.0,
        "vision": 0.0,
        "sensory": 1.0,
        "language": 0.0,
        "reviewContent": "Food was delicious. Atmosphere nice, dividers gave some privacy and reduced noise around us. Server, Karen was awesome. Gave us recommendations as it was our first time. Very friendly, honest and timely.",
        "qualityReview": 4.6,
        "overallScore": 0.2
    },
    {
        "id": "fdac0933-3fae-4373-b06e-3b085f3ee417",
        "locationId": "445 Delaware Ave, Buffalo, NY 14202, United States",
        "mobility": 0.0,
        "accessibility": 0.0,
        "vision": 0.0,
        "sensory": 1.0,
        "language": 0.0,
        "reviewContent": "I’ve been here many of times, the place is bumpin and the food is great. They are honest with the food and really care about the customers experience. Sitting outside is lovely on a warm day being inside can be overwhelming on a DJ night but overall is nice for young people. Birthdays here are next level and they give you a hat to wear and dessert to share. All and all 10/10 been coming back and gonna stay coming back",
        "qualityReview": 4.3,
        "overallScore": 0.2
    },
    {
        "id": "cb53f601-5861-41d2-8aa1-eff83c4770ef",
        "locationId": "109 George St, Hamilton, ON L8P 1E3, Canada",
        "mobility": 0.0,
        "accessibility": 0.0,
        "vision": 0.0,
        "sensory": 1.0,
        "language": 0.0,
        "reviewContent": "I went here for dinner with a friend on a weekday evening. I ordered the Amigos Famous Wrap Cruncho Supremo and it was delicious! I like that it came with chips and salsa. The portion size was pretty good for the price too.\n\nOur server was great as well. She was very friendly and helpful.\n\nThe overall atmosphere was cool with the lights hanging from the ceiling. We didn’t sit outside on the patio but it appeared to have an equally cool vibe to it.",
        "qualityReview": 4.4,
        "overallScore": 0.2
    },
    {
        "id": "2fccbbd5-0d14-4227-a374-3ef14ca42640",
        "locationId": "109 George St, Hamilton, ON L8P 1E3, Canada",
        "mobility": 0.0,
        "accessibility": 0.0,
        "vision": 0.0,
        "sensory": 1.0,
        "language": 0.0,
        "reviewContent": "With a very colorful exterior and a well furnished interior, once you walk in you're hit with the loud music and chatter. If you're looking for a place to have a quiet dinner this is not the place as it's just bursting with energy.\n\nWe were immediately seated with the lovely staff. If you take a look around you can see the kitchen and the cooks working right in front of you which is a nice touch.\n\nWe ordered the loaded nachos as an appetizer  and the birria tacos, enchiladas, and quesadillas as our entree.\n\nI feel 20 dollars for nachos is a bit steep but everything else was reasonably priced.\n\nThe food was great but I wouldn't call it the best Mexican food I've ever had. I will say though I loved the enchiladas and if I came back here that would probably be my go to order.\n\nWe didn't order any drinks but they do have a bar you can sit at if this is your thing.\n\nIf I'm ever in the area again I'll definitely be stopping by.",
        "qualityReview": 4.4,
        "overallScore": 0.2
    },
    {
        "id": "7cd56c87-4a97-4ca3-a19c-9e571c00a209",
        "locationId": "100 City Centre Drive, 815 Square One Dr Unit #2, Mississauga, ON L5B 2C9, Canada",
        "mobility": 0.0,
        "accessibility": 0.0,
        "vision": 0.0,
        "sensory": 1.0,
        "language": 0.0,
        "reviewContent": "Natalie was our waitress, she was great.\nThe place was well lit, and I had asked when making reservation for a quiet booth; well received!\nIt was our first time there, and we were so impressed.\nThe food; DELICIOUS, Drinks-Amazing.\nI had the Old fashioned drink, and  cheese ravioli w shrimp, and hubby had the whisky sour drink, and  steak w lobster sushi; we Highly recommend it.\nWe will be back.",
        "qualityReview": 4.2,
        "overallScore": 0.2
    },
    {
        "id": "92a1313c-708b-434f-b724-2704ed20308e",
        "locationId": "113 Bond St, Toronto, ON M5B 1Y2, Canada",
        "mobility": 1.0,
        "accessibility": 0.0,
        "vision": 0.0,
        "sensory": 0.0,
        "language": 0.0,
        "reviewContent": "Great Pakistani fusion restaurant downtown! The meat are so tender and marinated beautifully. We had a lovely conversation with the owner and you can tell the food and the business was driven full of passion. The restaurant was located in the basement and I would have preferred a more open and accessible place. The food portions were small but overall a really good spot!",
        "qualityReview": 4.6,
        "overallScore": 0.2
    },
    {
        "id": "f7b705f4-e4bc-4217-afd7-44142425082b",
        "locationId": "819 S Clinton Ave, Rochester, NY 14620, United States",
        "mobility": 0.0,
        "accessibility": 0.0,
        "vision": 0.0,
        "sensory": 1.0,
        "language": 0.0,
        "reviewContent": "This was our first time dining at this little place in the South Wedge. It was Friday night and busy.  We were able to make reservations online fairly easily, but our table wasn't ready when we arrived, so we ate outside (reservations recommended for this seating too) instead of waiting 15 minutes or so. There was only one waiter, and we sat for almost 15 minutes without even a glass of water. He was nice when he came, but we spent a good portion of the evening trying to get his attention.\n\nWe tried the brie and goat cheese with bread ( toast points). It was warm but surprisingly sweet.  I think the goat was mixed with something like an apricot jelly,  which made a good spread.  The brie separately (it was laid in strips on top) was good but just a strange mix with the jelly concoction.\n\nOne of us had Buffalo chicken Mac and cheese served cold.  By the time it was heated and returned, the rest of us had almost finished eating.    It was surprisingly tasty.  My BBQ pulled pork sandwich was also very good - nice and tender. Another companion had shrimp and grits.  After recently vacationing in the southeast,  this was unimpressive. It really did not look like pictured in the online menu,  and he noted very little cheese and three shrimp.\n\nIt was fun eating outside.  It got pretty dark so it was difficult to read the check when it was time to go.  They were hesitant to turn on the lighting,  and I could see why.  When they did,  it changed the mood.  The LED lights were harsh,  and it felt like we were sitting in a refrigerated display.  Maybe some goofy white Christmas lights would suit better.  Overall,  we enjoyed our experience enough to return.",
        "qualityReview": 4.4,
        "overallScore": 0.2
    },
    {
        "id": "309e2bef-168f-4cbb-8e1b-8d10350e055b",
        "locationId": "116 Yorkville Ave, Toronto, ON M5R 1C2, Canada",
        "mobility": 0.0,
        "accessibility": 0.0,
        "vision": 0.0,
        "sensory": 1.0,
        "language": 0.0,
        "reviewContent": "Have eaten here many times even for birthday dinners and the food is excellent. I like to go on the more quiet days since it is a busy social hub in the summer especially on the patio and inside can her packed as well. Despite whether its busy or quiet the atmosphere is wonderful. Its definitely a vibe.",
        "qualityReview": 4.2,
        "overallScore": 0.2
    }
]