[
    {
        "id": "ChIJL6VG4t8N3okRf7tDRAmJAWM",
        "name": "Kbowl",
        "address": "638 Columbia St Ext, Latham, NY 12110, United States",
        "latitude": 42.76208090000001,
        "longitude": -73.7527901,
        "rating": 4.9,
        "reviews": [
            "We had a great experience at Kbowl. It recently opened and the food was spot on. I'd recommend it to those looking for authentic street korean food or anyone just looking for a quick snack in the albany region. The workers are very kind and the vibe is good.",
            "Stopped in for lunch, the staff was very friendly. The custom bowls offer a great selection. I tried the spicy chicken bulgogi with rice, noodles and all the toppings. The signature sauce is spicy and absolutely delicious. Highly recommend this spot.",
            "I have, I think, been waiting over a year for the opening, and I'm glad to say that it has been worth the wait.  We love Korean food, and both loved the bowls which we got.  It's great to have a takeout place nearby, and wonderful that it's the food we most want to eat.",
            "It was delicious and the serving size was large. I plan to come back when I am in town.",
            "I enjoyed the bowl with spicy pork and chicken The ingredients were fresh and the food was really good, perfectly marinated and grilled. Service was attentive and friendly. I would definitely revisit! Perfect for anyone craving delicious Korean food."
        ]
    },
    {
        "id": "ChIJLexYRfwP3okRnHKAZpcy1_8",
        "name": "The Trestle Restaurant & Pub",
        "address": "2 Cohoes Rd, Watervliet, NY 12189, United States",
        "latitude": 42.7399314,
        "longitude": -73.7007548,
        "rating": 4.2,
        "reviews": [
            "This is the quintessential old school restaurant. Similar to the roots of that building, The Purple Pub. Affordable, healthy portions, personal friendly service and a classic wide open dinning room with an active bar with TV’s. The food was fresh, tasty and portions beyond one person’s appetite. We will be back!",
            "Formerly the Purple Pub, The Trestle has quickly put their own stamp on popular pub. Our pizza as topnotch with a great crust and quality ingredients. Our side salad was fresh with solid Italian dressing. There are plenty of other options...burgers, wings, salads and reasonably priced entrees. Very friendly and accommodating staff.",
            "Ordered a large half pepper/pepperoni half cheese pizza for lunch today and it came was absolutely delicious. Everything was exactly how a pizza should be with just the right amount of sauce/toppings mix. Staff was above and beyond making sure I was content with my very short wait. I will most definitely be ordering takeout on the weekends. Thank you!!",
            "Incredible hand-tossed margarita pizza! Fresh basil, generous mozzarella and just the right amount of sauce. Also love how the new owners of the space opened up and brightened up the decor. Well done! 👏🏻",
            "Ordered takeout. First few times was amazing. The 3rd time we ordered, they already changed the way sandwiches were made on the menu. Ordered again tonight and everything from the container, to the portion and presentation has rapidly declined. Very sad because the first orders were amazing. Have never been inside but gave atmosphere the benefit of the doubt."
        ]
    },
    {
        "id": "ChIJ_Xw2IDYP3okRM2jFzuptrio",
        "name": "Istanbul Hookah Place",
        "address": "1 101st St, Troy, NY 12180, United States",
        "latitude": 42.7534554,
        "longitude": -73.6820302,
        "rating": 4.9,
        "reviews": [
            "This place is amazing for a hangout. Surprised how little people know about it. We ordered mix grill for 2 and it was excellent and fed all 4 of us. Drinks are good too. Hookah is on a whole different level.",
            "Best halal food, awesome environment, very friendly stuff, definitely coming next",
            "Turkish hospitality at its best! The service is top notch. It helped that we also had a fellow turkish friend with us! Hummus was on point!",
            "My wife Melissa and I just ate here. The Lamb Kebab was the best I've ever had. All of the food was delicious! Also, the owner came and talked with us which was a delight. I highly recommend coming here. We can't wait to come back again!",
            "Chilling zone good flavor hookah authentic culture music party 🥳 event room"
        ]
    },
    {
        "id": "ChIJ-a9U1ccR3okRdUW2lrKHWAI",
        "name": "The Planter",
        "address": "109 Remsen St, Cohoes, NY 12047, United States",
        "latitude": 42.7739888,
        "longitude": -73.70102609999999,
        "rating": 4.8,
        "reviews": [
            "I was here for a baby shower, thrown by my daughter.  This place is SPECTACULAR!  Mari is the best!  She is extremely flexible, and insures that you will have the perfect experience.\nI highly recommend this venue for your next intimate event!!!",
            "Awesome plant place. You can sign up to build your own terrariums. Great lady and nice prices. I highly recommend planning a visit to do this with friends. Awesome atmosphere. They also do plant and sip too I believe with wine/cocktails.",
            "The owner and this store is special. They offer classes as well as drop ins to make terrariums. You can enjoy your green thumb and have a beer or glass of wine. The owner is also like a plant doctor, she helps you to learn how to use the right soil and will help you bring life to your home. Parking is great. Fun quaint area to to do antique and dine too. I love it here. Photos show some classes and also some fun plants I have taken home to make it feel special.",
            "I have been here a few times and all of those times I had such a wonderful experience. The atmosphere is really nice and the ambience is just giving aesthetic vibes. I love the interior design and decor. The staff and owner are super nice and friendly. I have attended past events that were held here and everything was just so beautifully well put together. Before becoming a brand ambassador I always recommended this place to everyone and now that I actually became a new brand ambassador here, I am loving every minute of it. I get to partake in doing something that I love and I look forward holding my upcoming events here.So overall 10 outta 10. Beautiful place and beautiful people!",
            "Thank you for bringing beauty and life to Cohoes. Plants are essential for the spirit and your business Is very inviting. I hope everyone takes advantage of this great opportunity to start their own garden, all about learning and growing ❤️❤️❤️"
        ]
    },
    {
        "id": "ChIJPd2lJagP3okRElfyuLzcxHg",
        "name": "Bootlegger's on Broadway",
        "address": "200 Broadway, Troy, NY 12180, United States",
        "latitude": 42.7314794,
        "longitude": -73.6910376,
        "rating": 4.2,
        "reviews": [
            "My wife and I held our wedding dinner at Bootlegger's. The staff was more than excited to help us plan our special night. We didn't want to deal with the craziness of hosting a huge wedding, so when we came to Bootlegger's they instantly made us feel heard and seen. We used their \"Perfect night\" catering package and added on some extra sides. The staff went above and beyond in getting the white linens and low rounds to really make the aesthetic work well for our event. All our guests were amazed at how tasty the food was and they haven't stopped raving about it since! The staff tended to my wife and I the whole night. We made the best decision to host our party here, highly recommend!!",
            "Good food and friendly service.  The patio is pup friendly and the burgers are good with fair prices.\n\nBeer selection is good. Great stop on a Farmers Market day to sit and relax.",
            "We had a great experience here yesterday night.\nThe atmosphere is a nicer pub, with lots of tvs above the bar if you want to watch the game. The tables where we sat were for enough away that it felt separate from the bar area, though. Also of note, bathrooms were very clean, which says a lot.\nOur waitress was friendly and attentive. She took our order promptly and the appetizers (mozzarella sticks and soup) came out quickly. The entrees arrived hot and as we asked for them.\nLast, but definitely not least, the food was awesome! The mozzarella sticks were 6 to an order (I love when it's an even number) and I really loved the marinara sauce. The Buffalo chicken chowder was so good! A little bit of heat, lots of chicken and veggies, and just thick enough.\nWe ordered the chicken tenders, which had a light and crunchy beer batter coating. If the batter is the same, I can't wait to try the fried fish next. We also tried the Cowboy burger. It came out medium well as we had asked and had just the right amount of bbq (I hate when they pour it on and soak the bun). Fries were good too.\nOverall, a pleasant experience all around and we will be back to try other items too. You should stop by yourself and give it a try.",
            "Wife and I sat outside - was a Saturday during the farmers market - I live in Troy and first time trying Bootleggers. Was NOT disappointed at all. Will go back no question - I even tried something I have never tried before (peanut butter & Bacon burger) now... I try not to eat a lot of beef or pork so I substituted the veggie burger but still had the 🥓 and what a crazy delicious burger. Even with the veggie burger it was stellar good!! The fries, drinks, and my wife's meal was outstanding as well. She got the Turkey-Avovado wrap. It's worth the try if you've never been or if you have try something different! Will absolutely go back!",
            "Everything was perfect here today! The amount of Lobster meat in the Mac & Cheese is quite impressive and it is ridiculously good! I also got some of the Creole Slaw and it was phenomenal! It's crazy because I usually won't go to a place with this low of a rating on google. I was pleasantly shocked! I can't speak on anything else. This is my first time here and I got the best service as well. I highly recommend."
        ]
    },
    {
        "id": "ChIJ_QxCiDsP3okRFRdaDQ0SD_E",
        "name": "tipsy manager",
        "address": "27 Grapevine Pl, Latham, NY 12110, United States",
        "latitude": 42.738872,
        "longitude": -73.7405074,
        "rating": 0,
        "reviews": []
    },
    {
        "id": "ChIJtVTsHzcP3okRrRiZjpmnxuw",
        "name": "353",
        "address": "353 Broadway, Troy, NY 12180, United States",
        "latitude": 42.7311592,
        "longitude": -73.6894799,
        "rating": 4.8,
        "reviews": [
            "Great drinks and bar tender.  Excellent mixology. Stuffed jalapeño poppers were amazing. Can't wait to go back!",
            "My bartender had the widest selection of gin I've ever heard of. So I decided to go back to my basic Gin Martini. He recommended the Brooklyn Gin since I'm all about my local distillers... He also recommended that I try blue cheese olives instead of plain olives and orange bitters instead of my go-to Angostura bitters. The Brooklyn Gin has a distinct smooth flavor, unlike anything I've ever had before. I was thinking this would be my nightcap, but am now feeling refreshed... 👍👍👍👍Kudos to Brooklyn Gin and to my knowledgeable bartender, Braden! 🥰👏👌",
            "Great place! Bartender super friendly and made excellent drinks. Atmosphere perfect and comfortable. Good music playing.",
            "I wish I could recommend 353 for drinks, because the atmosphere is lovely, and the cocktails were mixed well. However, both my partner and I agreed there was hardly any alcohol in the cocktails (a drinking establishment will get into trouble for this sleight-of-hand in Britain, for example, where rules are strict and enforced.). I think it is frankly kind of lousy and low to serve a cocktail this way, and the fact they did this to both drinks indicates it's their practice. To charge a big city price on top of all that is rather stunning. If you want to have a business that repels customers from returning a second time, this is the way to do it.",
            "Excited Troy has a great cocktail bar. Very inventive bartenders. Expansive cocktail menu with wonderful drinks.  Overall a nice vibe with excellent drinks."
        ]
    },
    {
        "id": "ChIJpVRkX6qk44kR4hK1yjM7AM4",
        "name": "the Establishment",
        "address": "75 Princeton St, North Chelmsford, MA 01863, United States",
        "latitude": 42.6354417,
        "longitude": -71.3798297,
        "rating": 4.2,
        "reviews": [
            "I came here with a large group of 10 but they were very accommodating. Our waiter was very nice and funny I forget her name but she was very nice. The food was also excellent I’ve been here a couple times and every time it’s fantastic. I’d come back here anytime.",
            "We had my daughter Wedding Reception there this past weekend.  Incredible!  Everything was perfect from walk in to walk out!  The bartenders (Ryan, Maria and Julia ) were also set up, server and breakdown crew, they were the best and so accommodating with all our requests.  The food was amazing ~ we got so many compliments.  The venue is just beautiful with the exposed beams and ductwork ~ sunlight was plentiful from the skylights.  The Establishment has been our go to for many years and they have never disappointed.  Very affordable also 😊.",
            "Have been here a few times and never disappointed.  Their baked haddock is so good with butter and bread crumbs; flaky and delicious. Also have enjoyed pull pork mac n cheese. Very generous portions. Peak hours for lunch/dinner can cause a wait. Sides are good and nice selection of seasonal drinks.",
            "Restaurant was busy. Used call ahead,  and had a short wait to be seated.\nWaitress was very pleasant, was in no rush for us to order drinks and brought us water right away.\nThe drinks were very good.\nOrdered a small portion of the chicken tenders. This was a good move. 6 of them were plenty for the two of us. Tasty, spicy and delicious.\nMy wife had the baked haddock, excellent.\nI had the bacon BBQ burger which was delicious. One doing, no where near enough BBQ sauce and it may have been omitted accidentally. Large portions of fresh lettuce and tomato and a healthy onion slice more than made up for it.\nOnion rings were delicious.\nOn to dessert!\nFried dough bites with chocolate syrup and caramel for dipping. Hot, puffy, just the right amount of powdered sugar.\nDefinitely a return visit is in order.",
            "Definitely recommend The Establishment! Ryan provided great service friendly and professional. Several menu options for everyone. We ordered Haddock, Steak and Cheese, Bacon Burger and a kids meal pasta they even offered a fruit roll up with the kids meal! We spent around $80. Comfortable fun atmosphere. Can’t wait to go again."
        ]
    },
    {
        "id": "ChIJ-9-ZV9UP3okRPOExH_4bTBk",
        "name": "Spindles on Remsen",
        "address": "241 Remsen St, Cohoes, NY 12047, United States",
        "latitude": 42.7702773,
        "longitude": -73.7002084,
        "rating": 4.3,
        "reviews": [
            "Went for dinner before a show at the Music Hall. The food and wine were good, but for some reason the service was very slow that night. Show was at 8, we got there at 6. We ordered a few apps and an entree to split. Took 90 minutes before the entree came out. The staff and atmosphere are nice. Pictured are the bacon wrapped stuffed dates and deep fried deviled eggs",
            "Very quaint wine bar. On occasion there's live music too! All the food is very good including the appetizers. Prices are a little expressive for me ($27 - $45 per wine bottle and around $13 per plate)\n\nI'd definitely recommend a visit! Try to go at a off time since the place gets crowded fast and wait time for food can be long.\n\nAlso, at the time if this posting, there's a Groupon to save around up to $15!!!",
            "I went here early on a Friday night to treat myself to dinner. The server was very pleasant and it was a cozy little place. Unfortunately, when I tried to order they were out of four items on their tiny menu. All items I would have ordered. Since there was really nothing left that I felt like eating I left after a glass of wine. Why on earth would this happen, especially on a weekend? So disappointing.",
            "Always excellent, creative fare. Great prices (food & wine); outstanding service. Nice ambiance. Best restaurant in Cohoes. 🍷",
            "Went here for dinner tonight and everything was perfect! They have a nice selection of wine. For dinner we had the blackened chicken pasta (incredible), baked brie ( also incredible) and the Flatbread ( perfection). I highly recommend you give this place a try!"
        ]
    }
]