[
    {
<<<<<<< HEAD
        "id": "ChIJ0fKv7g4P3okRMDPsMT3EtxY",
        "name": "Prospect Park",
        "address": "Prospect Park, 65 Prospect Park Rd, Troy, NY 12180, United States",
        "latitude": 42.7241378,
        "longitude": -73.68452359999999,
        "rating": 4.3,
        "reviews": [
            "It's sad that such a nice park is being misused by some of the residents of the city that it is in. Not to mention they cannot spend any money A major overhaul of the pool that i'm sure was beautiful in his day. I think the overlooks\nshould be cleared a little bit more but it is a nice place to sit and just relax.",
            "I grew up coming here to Prospect Park for playing football, basketball, Frisbee and to cookout. The park was shuttered for a while after a certain political party basically ruined the place of public enjoyment. The roads are and we're in bad shape. I was happy to see on a chance drive by a cpl years ago, the gates were open. I come here to photograph the city in various stages of weather, time as in day or night. The deer are a plenty at 2, 3, 4 a.m. I find it cathartic and peaceful. It was the land where Samuel and Ebenezer Wilson built there home and afforded their livestock to roam and graze. Yes that Samuel 'Uncle Sam' Wilson, whose meatpacking business shipped to United States Army during War of 1812. The troops started to say The US stamped for  United States property as \"Uncle Sam\".\nI do believe that The new Mayor will do the best to get the place in shape at some point. After years of indescribable idiocy from the political party that has   mismanaged everything they touch. So the new Mayor is one of unity and common sense. In that, I have confidence to see there will be improvement here. It will give the Residents of Troy, the park that The Wilson's intended for the public.",
            "Jr. Prom that night on the JP Morgan.  Park was in the vicinity and everyone wanted photos of the lovely couple.  The park made a great back ground for photos.  Plenty of parking, which was good since a lot of people had the same idea.  Well maintained and clean.  Great start to a memorable night.",
            "Prospect Park in Troy, New York, is a historic and well-loved green space that offers a variety of amenities and a peaceful environment. Here’s a review of the park:\n\nPros:\n\n1. Panoramic Views: One of the standout features of Prospect Park is its elevation, providing stunning panoramic views of the city of Troy and the Hudson River. It's a fantastic spot for sightseeing, especially at sunset, when the landscape is bathed in golden light.\n\n2. Variety of Recreational Facilities: The park offers a wide range of recreational amenities, including tennis courts, basketball courts, and playgrounds. There’s also plenty of open space for picnicking, playing catch, or simply relaxing on the grass.\n\n3. Historical Significance: Prospect Park has a rich history, being one of the oldest parks in Troy. It was designed in part by Frederick Law Olmsted, the famous landscape architect behind Central Park. The park’s historical elements, like the beautiful stone pavilion and walking paths, add to its charm.\n\n4. Well-Maintained Gardens: The park features well-tended gardens, including a rose garden that blooms beautifully in the warmer months. These areas are perfect for a leisurely stroll or for simply enjoying the floral beauty.\n\n5. Community Events: Prospect Park often hosts community events, such as outdoor concerts and festivals, which draw locals and visitors alike. These events add a vibrant and communal feel to the park, making it a focal point for the community.\n\nCons:\n\n1. Limited Parking: Parking can be challenging, particularly during peak hours or events. The park’s popularity means that finding a spot might require some patience, especially on weekends.\n\n2. Aging Infrastructure: While the park is generally well-kept, some areas, such as the playground equipment and certain paths, could use updates or repairs. The age of the park is evident in some of its infrastructure.\n\n3. Seasonal Maintenance Issues: During certain times of the year, particularly in the winter, some parts of the park may not be as well-maintained, with snow or ice making paths difficult to navigate. In the summer, the park’s popularity can lead to occasional littering, though it’s usually addressed promptly.\n\n4. Crowds During Events: While community events are a positive aspect of the park, they can also make it very crowded, which might detract from the peaceful experience some visitors seek.",
            "Park would be a lot nicer if the city took better care of it. A lot of the roads in the park are closed, because they're falling apart. The roads that are open are in bad shape. The bathrooms have been closed for years, because they are in bad shape. They did put a few port a potties next to the closed bathrooms. There is a new disc golf course, if you're into that, and over near the tennis courts, there's some newer workout equipment. There is a nice playground for the kids, and a small splash pad. Several grills and picnic tables throughout the park as well. The park is in a beautiful spot, and has a nice view of the city, but overall, needs a lot of work to make it nice again."
        ]
    },
    {
        "id": "ChIJVy6X4gYP3okRmoZhNRmED6U",
        "name": "Sage Park",
        "address": "51 Congress St, Troy, NY 12180, United States",
        "latitude": 42.7288281,
        "longitude": -73.69270829999999,
        "rating": 4.7,
        "reviews": [
            "I used to come here as a young boy to ride my bike, it's hardly changed and I love it!",
            "Small park but very clean, great to relax and soak in the rays. There are a couple benches and also some grassy areas for a blanket!",
            "very nice small park, close to restaurants in downtown Troy",
            "Me and the pup used to walk here almost every day but even now that we've moved up the hill every time we're in Troy we stop by.",
            "It's a pretty park in the middle of Troy. Generally clean, and the dogs are nice."
        ]
    },
    {
        "id": "ChIJOcWELuwP3okRXwBEpImCyMI",
        "name": "Frear Park",
        "address": "Frear Park Rd, Troy, NY 12180, United States",
        "latitude": 42.7511714,
        "longitude": -73.66873629999999,
        "rating": 4.7,
        "reviews": [
            "The city of Troy, NY, made a significant investment in the golf course a couple of years ago, which resulted in huge improvements. Golfers come from miles around to play. Every time my husband & I  walk to the park on nice days, it is always busy. There are picnic areas, tennis courts & an ice rink for the local hockey players. We also enjoy getting take out from the Park Pub which is renowned for its chicken wings as well as a ham & cheese on marble rye with wholegrain mustard sandwich called  The Half & Half which is a local favorite.",
            "Frear Park's lake view is a hidden gem in the heart of the city, offering a picturesque escape from the hustle and bustle of urban life. This serene spot, nestled behind the somewhat dilapidated tennis court, is a haven for nature lovers and those seeking a moment of tranquility.\n\nThe centerpiece of this scenic haven is the glistening lake, which is home to a charming community of ducks that gracefully glide across its surface. Watching these ducks is a delight, and it adds a touch of enchantment to the whole experience. As the day winds down, the lake provides a front-row seat to a breathtaking sunset, casting a warm, golden hue over the water that's simply mesmerizing.\n\nFor those who prefer not to sit idly by, there are well-placed seats along the lake's edge, inviting visitors to relax and take in the view. You can also explore the tranquil surroundings with the walking trail that meanders around the lake. This trail offers a perfect opportunity to get some exercise and immerse yourself in the natural beauty of the park.\n\nWhile the adjacent tennis court may show signs of age, it doesn't detract from the beauty of the lake view. In fact, it adds a touch of nostalgia to the experience, reminding us of the park's history.\n\nIn conclusion, Frear Park's lake view is a sanctuary of calm and beauty, where you can escape the daily grind and reconnect with nature. Watching the ducks and witnessing the sunset here is a truly magical experience. Whether you're seeking solitude or a leisurely stroll, this place has something for everyone, making it a must-visit destination for anyone in search of natural beauty in the heart of the city.",
            "I try to visit Frear Park as often as I possibly can, the park is always clean and well maintained with beautiful views and freindly people throughout. I especially like the golf course were I visit with most all of the golfers and the people who walk the trails, such a wonderful gift to the people of Troy.",
            "This was a fun little course with plenty of nice views. The greens are very very tough. They are very hilly and unpredictable. You will enjoy this place",
            "Frear Park Golf Course is in beautiful shape and condition! Greens are running fast (holes 7&8), fairways are green and fluffy and tee boxes are well cut and defined! Good job Superintendent!"
        ]
    },
    {
        "id": "ChIJ_3Wr6gcP3okR1z27fPtHCXU",
        "name": "Barker Park",
        "address": "64 3rd St, Troy, NY 12180, United States",
        "latitude": 42.7297879,
        "longitude": -73.6903633,
        "rating": 3.8,
        "reviews": [
            "Small, cramped, and not that clean. Doesn't appear kid friendly or even me friendly. OK to eat something quick from a local eatery and get bothered for change, but it isn't as bad as the bus stops",
            "A very nice small private park in the downtown Troy area next to a religious Church where the beauty of this small Park offers an inner city getaway",
            "Over all nice,  but alcohol abusers around the park makes it little intimidating when bringing kids.",
            "The plantings have been very nice this year. Looks like the swings are back.",
            "Very nice little park located at64 3rd St, Troy, NY 12180\n\nKiddos friendly"
        ]
    },
    {
        "id": "ChIJv9fWVwQP3okRpbKl_konu4E",
        "name": "Washington Park",
        "address": "195 2nd St, Troy, NY 12180, United States",
        "latitude": 42.7240858,
        "longitude": -73.6925151,
        "rating": 4.2,
        "reviews": [
            "Nice quite little park, convenient for taking a little break. The trees in the park are beautiful and the brownstone apartments that surround it are beautiful as well.\nTogether they're like a lil oasis to grab a few minutes of peace and quiet.",
            "Change review: spectacular greenery! And love the statue water fall but I don’t believe I’ve ever seen the water actually flowing through it or falling… needs more seating around or forms of seating maybe more statues or pieces of art would be ideal.",
            "This park looks nice and unfortunately its sole purpose is to raise property values in the surrounding area. It is privately owned and you can only get in if you have a key but even if you do you're not allowed to do anything except sit there. Pets and having fun are strictly prohibited.",
            "This is a relatively clean appearing park. We went to see the filming of the show The Gilded Age. It was so cool seeing all the horses and carriages and people dressed up!",
            "Best and biggest city park in Albany. Lots of events, festivals, performances, and activities throughout the year. Or just go for a leisurely stroll or a small picnic with friends. The tulips and Tulip Fest are a highlight!"
        ]
    },
    {
        "id": "ChIJD-5TzZgP3okRC7tTXa5eEvo",
        "name": "Beman Park",
        "address": "4 15th St, Troy, NY 12180, United States",
        "latitude": 42.7336976,
        "longitude": -73.6745911,
        "rating": 4,
        "reviews": [
            "Decent spot with all of the essentials. Parks swings, and a basketball court. However, the two playgrounds themselves are not all that great quality. Relatively small playground areas.\nA defining aspect of this playground is it's calisthenics gym. There are 7 different stations each meant to be done for a minute each. Great way to be active and it got the extra star for it's addition.",
            "Great Troy, NY Park! Community staple for years, kept well, great location & usually clean! Full size Basketball Court (Blacktop, 2 10' Hoops) & Childrens Play Areas. Too bad Hospital Staff Lunch Breaks are so short or I'd bet you'd see more weekday action, Beman!",
            "Not very exciting as far as parks go.  There is some grass, a hill, some dilapidated tennis courts.  Closer to the hospital there is a functional basketball court and some playground equipment but it's rarely used to my knowledge.  I think the main purpose of this \"park\" (more like a large patch of unused land Troy happen to mow every few weeks) is to provide shortcuts from Jacob Street to Peoples Ave without walking all the way down to 15th.\n\nThat said, this park is fairly well trafficked during daylight hours, I've never felt unsafe walking.\n\nBeman Park, and the surrounding neighborhood, is often the target of Troy Police initiatives dealing with RPI students, don't let this make you feel the park is anyway unsafe.",
            "Very annoyed because I typed dog park into Google and it brought me here. THERE IS NO DOG PARK! why is it so hard to find a spot to bring your dog to play in this city!?",
            "Great place to take your kids. Me and my children had so much fun here"
        ]
    },
    {
        "id": "ChIJTZQN1moP3okRRq4HEjmlSVw",
        "name": "William D. Chamberlain Riverfront Park",
        "address": "255 Front St, Troy, NY 12180, United States",
        "latitude": 42.7331606,
        "longitude": -73.6909623,
        "rating": 4.6,
        "reviews": [
            "Mildly trash filled park but no homeless staying. Pretty good third space. See image and video below for further information",
            "Always fun stopping over here during the week or saturdays for the farmers market. During the summer they open the spray park and it’s great for families with little kids to get cooled down. They have seating for adults. I like to sit and read while my kids have a blast in the water. It would be nice to have a little playground or something too.",
            "Nice views of the Hudson River, clean , seating available, sprinklers in the warmer months",
            "A great place to take a stroll during the day or even during the evening. The renovated path definitely helps make the place feel a little less sketchy. In the summers they have free yoga on Sundays and other events throughout the year. A great part of the Troy community.",
            "Great for parties, strolling by the river alone or with that special friend 👀, or hosting a rally. There's fun for everyone!"
        ]
    },
    {
        "id": "ChIJUQBPAksJ3okRAOwHa7qMMiQ",
        "name": "Ganser-Smith Memorial Park",
        "address": "53 Menand Rd, Menands, NY 12204, United States",
        "latitude": 42.6960309,
        "longitude": -73.7265128,
        "rating": 4.7,
        "reviews": [
            "It’s a beautiful park. Very well maintained. I like that there are benches right up next to the playground and the play equipment is looks like new. There’s also a lot of swings for babies and kids alike.\n\nIf this park had shade and the slides/tubes didn’t collect so much water it would be an easy 5 star.",
            "This is a wonderful looking Park. The grounds are well groomed and kept. The atmosphere presents like a gated community and seems less friendly to visitors, probably due to the very close neighboring homes. It can use some symbols of inclusivity but still a good first impression.",
            "Excellent Park in Menands, NY, with a covered Pavillion and grill for Village events and available for inexpensive rental. Tuesday has Village Concerts in the Park and Wednesday sees Food Trucks with Village sponsored music. On-site clean bathrooms as well as year-round activities make this a terrific spot for family, friends, and residents!",
            "This is a nice, quiet neighborhood park featuring a jungle gym for toddlers & one  for slightly older kids. There are plenty of picnic tables to enjoy a small lunch at. There is a nice basketball court too. This park also has a canopy with beautiful backdrop features. And along side that is a tennis court! It's definitely a must visit park! #illseeyouguysthere #followme #ritarants 😊 IG: @geeitsrita",
            "We love this Park. It's well maintained. Has bathrooms (though I believe they are only open May-September). Big enough to keep the younger kiddos entertained but not so big that it gets over crowded. Two play structures (one on the smaller side), a rock climbing wall and plenty of swings. There is a basketball court and a baseball field.  There is also a large Pavillion area with picnic tables that I believe can be rented. All of the families I've met there have been very sweet and even the older pre-teens that come to play basketball have been very respectful. A hidden gem 💎."
        ]
    },
    {
        "id": "ChIJs9RqVrMP3okRtpmIU_n6Rzk",
        "name": "Brotherhood Park",
        "address": "Watervliet, NY 12189, United States",
        "latitude": 42.7350294,
        "longitude": -73.7043205,
        "rating": 4.1,
        "reviews": [
            "Some of the people aren't social at all; it's like (for some reason unbeknownst to me,) I ALMOST ALWAYS positively initiate point of contact, sometimes a handshake, after talking, perhaps a hug, (I'll ask first) conversation, eye contact, (ppl SEE 👀 ME, some known, DEFINITELY HEARD 👂, body language, etc.\nI'm not gonna get too psychological on some ppl, unless asked- 🌻\n\nBut I almost Almost always change some one's mind about \"stereotypes\" and make a friend!🌹 YES!, all this happens and I'm aware. Whether me and my other half,  are exercising, or I'm playing with together, AND WATCHING  2 of my GrandBabies, keeping keen eyes 👀 on them; as I relish in delight of them being GODS' children, and my children's children🌹",
            "I go to read and relax and watch the boats go by great pavilion close by for having that barbecue that you want",
            "A nice park for the kids. I take my great grandson after school. Get all that bottled up energy out!",
            "The pictures are not of Brotherhood park, the pictures are of Waterliet Hudson Shores park(Picklepark). 😉 Brotherhood park is located on 25th street and 6th avenue in Watervliet.",
            "It's a nice place to go and relax take a walk I wouldn't hang out in there for too long though"
        ]
    },
    {
        "id": "ChIJYxisQooP3okRA7syKg87eJM",
        "name": "Hudson Shores Park",
        "address": "2 Selke Dr, Watervliet, NY 12189, United States",
        "latitude": 42.7307898,
        "longitude": -73.697889,
        "rating": 4.5,
        "reviews": [
            "This has become my place to relax at.  I have not tried using the BBQ pits here yet.  It's just a.nice quiet place to visit and sit or go for a walk at",
            "Good place for picnic, but no BBQ.",
            "Very relaxing and claming environment ⚘️🪷🪷",
            "When I need a quick getaway to calm my nerves… this is my go to!",
            "This is such a great place to go to for fishing walking your dog, cook out and to just relax and watch the boats going past on the river.. you can also rent out one of the picnic areas to have family reunions birthday parties or anything else it's a nice size space that will hold a large amount of people."
        ]
    },
    {
        "id": "ChIJU3hioNoO3okR6641NIfRGX8",
        "name": "Town of Colonie Schuyler Flatts Cultural Park",
        "address": "595 Broadway, Watervliet, NY 12189, United States",
        "latitude": 42.705452,
        "longitude": -73.711191,
        "rating": 4.6,
        "reviews": [
            "Basically a big open field with a few trees in the middle. Concrete path that goes around perimeter.\nConnects to Hudson bike trail in the back.\nA few benches.\nSome history reading areas along the way.",
            "Non-Smoking sign is back up again after some public park vandal took it down, and this is thanks to the Colonie Parks and Rec Supervisor and those who put the sign back up. Changed from 1 to 4 stars due to this. This is a great park to walk, exercise, get fresh air and bring your children so they can enjoy the fresh clean air. This is a great park with the exception of some who ruin it for others and believe they’re above following the rules of public parks. And when not remove signs that are there to protect the most vulnerable (children). Hopefully I and the other folk who bring their children to this park to get fresh air won’t have to have their children’s lungs contaminated with different types of smoke.",
            "Open park, nice and warm. Safe place to walk children and your your pets. Had a great time. The straight smaller path around the park is . 7 miles and twice around is ~1.5 miles.",
            "Great place to walk  or let the kids ride bike.  There are no bathrooms or actual amenities here.  It is just well manicured expanse of flat land that connects to the bike trail.",
            "Great place to get your walk in. Or just to sit and watch nature."
        ]
    },
    {
        "id": "ChIJdaZKH-cP3okRMapx_8ZuQTM",
        "name": "Knickerbacker Park",
        "address": "103rd St & 8th Ave, 320 7th Ave, Troy, NY 12182, United States",
        "latitude": 42.7614133,
        "longitude": -73.674959,
        "rating": 4.1,
        "reviews": [
            "I was invited to play softball as my work place has a team that participates in a league. I was reluctant at first, but decided I have been getting lazy and just get out with the weather being perfect.\n\nI dragged my son in with me and he wants to make a trip back to this park already. There are multiple softball grounds and has some historic significance which I have no clue.\n\nI got my exercise, my son had fun and that is  all that matters. There were other kids there playing football, on scooter, bike, mini motorcycles, softball and some play equipment which looks fairly new.",
            "Visited here for Lansingburgh soccer games. Nice and clean facilities. Nice park with up close parking.",
            "It's a small track here we like to walk on is also an ice skater ring inside the building it's going to reopen soon",
            "I saw Knickerbocker Park on my map and since I needed somewhere to relax I walked 12 blocks to visit what I HOPED was a nice park. When I arrived all there was is a baseball diamond attached to a school, and a playground designed for the UNDER 5 group. The few toys on the playground were extremely run down.\nThere was what at one time might have been a pretty fountain, but it was full of weeds and no water. There were 2 pretty run down picnic tables.\nThe grass was in dire need of a lawnmower and the entire park needed love.",
            "The fields are kept in decent shape. They are adjacent to the school and have parking most of the time. There is a single porta potty there so keep that in mind."
        ]
    },
    {
        "id": "ChIJ_ZHobFYN3okR725mtd_o6lY",
        "name": "Latham Kiwanis Park",
        "address": "3 1st Ave, Latham, NY 12110, United States",
        "latitude": 42.7458772,
        "longitude": -73.7534884,
        "rating": 3.5,
        "reviews": [
            "The tennis courts and basketball courts are very nice. The playground seems to be lacking, but it was quiet and clean. No dog area and no restrooms.",
            "Updated with photos. This park is UNSAFE and DANGEROUS. The playground equipment is broken in multiple areas and the swings & metal areas are rusted. Very disappointing that these complaints have been going on for more than 3 years and nothing has changed.",
            "Nice park.  Lots of grass to walk the dog on.  Basketball and pickleball courts and some kind of performing arts center building. The kids playground looked a little rough with a cracked slide (6/24) so I took off a star for that. I did not see any restrooms.  I think there was one picnick table.  I didn't see any signs about not allowing dogs so I think they are allowed.  One trashcan available.",
            "This is the park that time forgot. It was once quite nice, but it's now dilapidated, with paint peeling, tennis courts cracking, and grass overgrowing.  There are some nice soccer fields still, and basketball courts that are still in use, but on the whole the playground has seen much better days. It's so forlorn that even the sign is misspelled. No bathrooms or concessions.",
            "Smells like garbage. Broken equipment. Not a good place for kids."
        ]
    },
    {
        "id": "ChIJQVG6Bb8P3okRiH3j7Hg3W9M",
        "name": "7th Avenue Park",
        "address": "2910 7th Ave, Troy, NY 12180, United States",
        "latitude": 42.7458718,
        "longitude": -73.68114039999999,
        "rating": 3.9,
        "reviews": [
            "Bathroom is dirty and looks like someone was living in it. My daughter stepped on glass in the sprinklers. There are several teenage brawls daily. This park was beautifully redone just for the teenagers to destroy it. Sad",
            "This is a nice little park. I went in late November so we didn't stick around too long. But the equipment looks new and the swings squeak as all swings do.",
            "Someone’s always getting shot down at the park every time you turn around. I hope the changes in the park start bringing good things for the neighborhood but I don’t cross my fingers. It starts with the people there.",
            "One of Troy's best! The community does a great job of keeping it clean and clear.",
            "Nice park but no where to park .\nPlayground in rear where you can't see your kids from the sitting area.\nCity keeps it clean daily."
        ]
    },
    {
        "id": "ChIJ2Tdu4igO3okRaKALrnqQpYw",
        "name": "Lansing Park",
        "address": "34 James St, Cohoes, NY 12047, United States",
        "latitude": 42.76859109999999,
        "longitude": -73.7099044,
        "rating": 4.2,
        "reviews": [
            "Kids go to school here. Enjoy the park and pool during the summer. 8 generations have enjoyed this pool. I personally have for over 47 years.",
            "Pool was almost empty and water green.  Gives the impression that no one takes care of it.  We were there way before labor day and it was closed.  No restrooms either",
            "Top-notch Cohoes Youth Soccer\nAwesome season,  very productive!!!",
            "Traveling from out of town and this park is great! Great place for the kiddos to get out and stretch their legs, burn some energy!",
            "This is not far from our house but I am always nervous when my kids walk anywhere by themselves and it's not because I don't trust them, I don't trust other people, let's face it, the world isn't the same as it used to be many years ago, now you have to always be on your guard, and what makes me even more nervous is the fact that an 11yr old was taken by a 16yr old from this very park, and that is extremely scary.  I mean the park and playground are very nice with lots to do, but it's always very busy. And now for me with this latest situation of the 11yr old being taken, my message to other parents, Please Please watch your children and if you aren't going to be with them make sure they have a way to check in with you!!! It's not a 100% safe world out there and you have to always be on your guard, you just never know.  Stay safe to you all."
        ]
    },
    {
        "id": "ChIJgZauRSAQ3okRagJKKbq4aMY",
        "name": "Powers Park",
        "address": "3rd Ave, Troy, NY 12182, United States",
        "latitude": 42.7690184,
        "longitude": -73.67918949999999,
        "rating": 4.4,
        "reviews": [
            "been going here for summer concerts for a good number of years...great clean park, gets great vendors, great stage and audio setup...first year I've been here to see the really great looking awning setup... attended today to check out modern country cover band Grit -N- Whiskey!🎼🥃",
            "It's a very peaceful place! I love the concerts they have every Saturday between the months of June- August! Could have public bathrooms at least 1 through out the year for the people who go there to sit and enjoy the weather and the park.also would be nice if they had a water fountain for people to get drinks on very hot days.maybe even a sprinkler for the kids to cool off.besides the concerts they don't really have much there but a few tables but it's a nice place to just go and sit.",
            "Nice venue for a concert.  No pets but everyone has beers.",
            "Had an amazing time good people clean good music danced eight good food my friends came it was a great place to hang out and just meet people stuff for the kids to do I was actually going to paint a painting of the park That's how much I liked it I think I still will I will post a photo on here afterwards so I will one can see how amazing the place is you should definitely check it out if you have spare time and there is a pool close by so the kids can go swimming good food across the street bar if you like to drink come check it out everyone",
            "Had a great time with Sound Doctrine and Victory chapel band . Preaching and singing for Jesus"
        ]
    },
    {
        "id": "ChIJi-D5OKEP3okR7Az0DtkW_jk",
        "name": "Clinton Park",
        "address": "1861 8th Ave, Watervliet, NY 12189, United States",
        "latitude": 42.7309709,
        "longitude": -73.70808629999999,
        "rating": 3.4,
        "reviews": [
            "Nice playground with sets play, one for children between 2-5 and the other for older children.\nThe park is equipped with table & bench sets, swings, basketball area...\nPark is open from 7 am to 10 pm.it is situated in residential clean and nice area.\nNo restroom.",
            "Good for small kids. Good basketball court swings open field and play equipment area. Alot of teens hang here. Saw a few fondling and kissing. No restrooms. Something to consider. We practice here for t ball.",
            "Kids love it here. Nice and relax 👍😊😊😊",
            "Very nice basketball area with a sprinkler system and a dog park..what more do you want. Will visit again one day maybee again today..",
            "I love this clean park. Not alot of kids are there so it's great that it's not crowed."
        ]
    },
    {
        "id": "ChIJ2xWhqCQP3okRG3txIMRthJ0",
        "name": "Burden Environmental Park",
        "address": "85 Thompson St, Troy, NY 12180, United States",
        "latitude": 42.7068903,
        "longitude": -73.68921069999999,
        "rating": 4.5,
        "reviews": [
            "With the recent trail work and clean up at the Burden Pond Environmental Park starting in May of 2019, a new life has begun at the park. New, maintained and well marked trails are found here now and accessible during all four seasons! Great Improvement to the once decrepit park",
            "The falls are beautiful but I had a lot of trouble finding it. Turns out you have to drive a little further down the road, past where maps tells you to stop. If you go through the woods a little you can walk in and around the falls.",
            "Good for a walk around the falls as well as the park itself",
            "Has a small creek, and nice waterfalls. Good for a quick walking trip.",
            "So fun. So many trails."
        ]
    },
    {
        "id": "ChIJZ7Fi58MP3okRiuJtKcUJBm8",
        "name": "Freedom Square",
        "address": "35 5th Ave, Troy, NY 12180, United States",
        "latitude": 42.7540073,
        "longitude": -73.6816496,
        "rating": 4.2,
        "reviews": [
            "Awesome young man. Keep doing wat u r doing in life one day u will be a great dad, and always remember that ure parents want nothing but the best for u. And remember to always show respect to get respect and stay loyal.",
            "No longer just an empty lot - but the great thing is the community and the activities that take place here, organized by Sanctuary for Independent Media, Troy Bike Rescue, Missing Link Ministry, Collard City Growers",
            "5th Avenue from the south (historic Troy) meets head-on 6th Avenue from the north (proud Lansingburgh) at the intersection of 101st Street.  When these two distinct cities merged in late 1800s, the northern one full of green spaces, carpenter-crafted homes, and sloop building industries agreed if it could keep its original street names, and 'better' school system.  City of Troy is the only USA municipality with two school systems:  Enlarged City School District of Troy and Lansingburgh School District.",
            "Candle Lighting Ceremony",
            "Good place for family barbecues they have a pavilion with tables public restrooms and a playground"
        ]
    },
    {
        "id": "ChIJlZG2CbcP3okRx2FiU8CB0aE",
        "name": "Paine Street Park",
        "address": "200 Paine St, Troy, NY 12183, United States",
        "latitude": 42.747598,
        "longitude": -73.690934,
        "rating": 4.2,
        "reviews": [
            "This splash pad, playground and park are absolutely fantastic! Mr. Mullens runs the park along with his staff. They take great care of the park and are very welcoming and helpful. The splash pad is amazing for the kids. I would highly recommend checking out this summer! The kids use old plastic coffee tubs as buckets (plastic ones break). Kids always have a blast!",
            "How cute is this place?! I LOVE water so when I saw this I wished my neices were young again! Very nicely done.",
            "Went there to get wet and it was so hot and the sprinklers weren't on besides that it was a nice park",
            "Like another reviewer stated they're not really careful about who comes it's a beautiful Park and the facilities are terrific.",
            "Says it is open 9am to 9pm on Saturday and when we got there it was closed and there was no one there"
=======
        "id": "ChIJc4GxmdsP3okRxpYlChE0F_0",
        "name": "BARE Blends",
        "address": "26 N Greenbush Rd, Troy, NY 12180, United States",
        "latitude": 42.6942242,
        "longitude": -73.6876853,
        "rating": 4.4,
        "reviews": [
            "The atmosphere in the North greenbush location is amazing. Very relaxing, welcoming, and the staff was friendly and polite. I felt right at home with all the cozy spots to seat. The only issue i had was i did not fully understand the menus. The smoothie bowel i got did not have much flavor or taste to it. So please know ahead of time what you are ordering. I can see why vegans and gluten-free individuals would love this place. I just personally didn't care for it. But again The atmosphere and the staff were on point. I just was not prepared for the food",
            "I'm a regular here and love their grain bowls and fruit bowls. There are plenty of varieties to choose from, and the portions are decent.\n\nThe staff is friendly, prepares your order in no time. The fiesta grain bowl, my new favorite, is a must-try!",
            "I’ve ordered here twice (Fiesta grain bowl and açaí crunch bowl) and both times\nI was met with tasteless, underwhelming food. The grain bowl was actually inedible and I struggled through the first few bites. The acai bowl, even with fresh fruit, tasted like cardboard. I don’t know how people eat here. Smoothie King is so much better",
            "Popped in for a salad with tempeh. As with all soy meat alternatives, one must assume all liability while carefully diving in, eyes wide open. I left with my fingers crossed and a Mediterranean bowl. The salad was chock full of fresh greens and vegetables. What made it special was the wonderfully seasoned and crunchy lemon chickpeas, the creamy cashew tzatziki dressing, and the texture of the garlic tempeh. While most meat replacements still have a way to go, in terms of hitting the spot, the way this tempeh was prepared made for a refreshingly layered and texture-rich bite.😉😊",
            "I waited twenty minutes for an over priced drink. There were several people that ordered after I did with way more complicated orders. I was told that someone else picked up the drink I ordered; after I told them I never recieved anything. They then told me that the ticket never printed. I spent $20 on a bag of dog treats and a small juice. I will let everyone I know not to come here."
        ]
    },
    {
        "id": "ChIJYwfu5F8P3okR_LA-5or_yT4",
        "name": "Cafe Euphoria",
        "address": "225 River St, Troy, NY 12180, United States",
        "latitude": 42.7313652,
        "longitude": -73.6931451,
        "rating": 4.6,
        "reviews": [
            "My wife and I went for brunch on a Wednesday morning.  I ordered a Euphoria omelette and my wife a breakfast burrito and two coffees.   I really enjoyed the omelette.  Very delicate and the green salsa sauce is delicious.   It’s nothing like your typical huge diner omelette.   My wife enjoyed her burrito and the sauce (pesto?) that came with it as well.  Overall a quite pleasant experience.",
            "Went for a Sunday Brunch with a very small group of friends. I got the Prix Fixe at full price given how much I make and, to my surprise, it was actually a steal for the quality of food and service I was getting. Bagel with lox, egg/tofu scramble, and the butternut squash soup were my favorite, but everything else was still 10/10. The menu can change by the season.  It takes time for entrees to come out especially if it's busy since it's a smaller place, so I'd recommend bringing a +1 for idle chat. The staff were so nice too! I'm definitely coming back.",
            "Stopped in while running errands, and grabbed a caramel latte, and some cute stickers! Truly one of the tastiest lattes I’ve ever had. Appreciate the space you’ve curated for the community, it’s lovely and welcoming and I’m happy to have stumbled upon it!",
            "What a pleasant surprise this place is!!! We went by the great reviews online and we weren't disappointed. When I tell you, everything was so so scrumptiously amazing, everything was so so scrumptiously amazing and delectable. We will be making this place a must go to on our time out. You can tell great thought was put into every morsel of food and drinks. Impeccable customer service, clean and cozy setting, upbeat vibe. Ten, ten all around, chefs kiss. Keep up the wonderful work Cafe Euphoria.",
            "Great place ! Very welcoming atmosphere. The food is always good. It is an important part of the Troy community. I look forward to going back to Cafe Euphoria. Thank you for being an excellent establishment!!"
        ]
    },
    {
        "id": "ChIJqbAhtlkP3okRZsIXgCH-EOQ",
        "name": "Stacks Espresso Bar",
        "address": "13 3rd St, Troy, NY 12180, United States",
        "latitude": 42.731995,
        "longitude": -73.6902293,
        "rating": 4.5,
        "reviews": [
            "Excellent coffee. A little bit on a bitter side, but still quite full of flavor.\n\nMost friendly and knowledgeable barrista Liam told us about the city of Troy is.\n\n(Most my reviews are positive— that’s because we try to find only good places to have our coffees.  But Stacks  is one of the top ones)",
            "The staff was pleasant, greeted us with smiles and hellos, knowledgeable about the products they make and sell. It's a very cute artsy style local coffee shop with hints of Italian and French culture mixed in.",
            "When I first walked in, I was blinded by the whiteness.  I knew that regardless of the food or service, this would not be a place I would make my \"go to\".  I simply prefer cozy coffee houses that have a feeling of warmth and the invitation to hang out and be comfortable.  The chairs here are uncomfortable if you have a full sized figure.\nIt took a rediculous amount of time to get my cappuccino.  I actually got my bagel sandwich before the coffee.\nThe bagel was nothing to write home about...but my friends sandwich looked great and she was wholly satisfied.\nMy cappuccino was almost spot on.  I ordered a 12 oz so thought it would have come with extra espresso.  It was pretty, but too milky.  She enjoyed her iced coffee...I think it was s strawberry cheesecake or something like that.\nStaff was,... ok friendly.  Nothing really stood out about them.\nMaybe a 2nd visit...maybe not.",
            "Does Stacks Espresso Bar stack up? That is the question on my mind this morning as I try a large cup of their Ethiopian blend. I have it black with no sugar. The roast promises juicy hints of plum and raspberry, and while it doesn't quite hit the juicy mark, it definitely gets points for being fruity-delicious... The reason why it doesn't hit the juicy sweet spot is that I'm not desiring more.... Thumbs up for the semisweet aftertaste!\n\nUPDATE: I've returned to Stacks Espresso Bar twice since my first visit on Sunday. I've since tried their cortado, espresso with an equal amount of milk to reduce acidity, and a large cup of their house blend drip coffee, black, no sugar. The cortado was on point, it was only my second time having one. It was very mellow and flavorful. The house blend is my new favorite, right here in downtown Troy, a 15 minute walk from my place. The blend is nutty and smooth, as advertised, and has a slow-sip-worthy bittersweet aftertaste, which I love...",
            "Very good coffee, delicious bagels and very friendly service!"
        ]
    },
    {
        "id": "ChIJK4vFJagP3okRgZ1-lctP85Y",
        "name": "little pecks",
        "address": "211 Broadway, Troy, NY 12180, United States",
        "latitude": 42.7313142,
        "longitude": -73.6911095,
        "rating": 4.6,
        "reviews": [
            "The ambiance at Little Pecks is stunning. I remember the first time I came here, expecting a small coffee shop, but as I walked in, I discovered a little oasis filled with greenery, cute lights, lovely tables, and lots of people working. It's such a cozy spot, and I absolutely adore the vibes.\n\nI typically come for the coffee—love their cappuccinos and iced lattes. Recently, I tried their breakfast burrito, which was pretty decent! I still need to explore more of their food options, but it’s definitely the coffee and atmosphere that keep me coming back.",
            "A lot bigger than it looked from the outside. Small menu for brunch, but it packs a punch! Very healthy foods; do not expect greasy spoon breakfast here! Staff super helpful and friendly. Will come again.",
            "The vibe, space, fireplace and waterfall sound added up to an amazing relaxing place to have your second cup of coffee. My future cafe would totally have their vibe.\n\nI bet the owner loves ferns as there are like 10 hanging on the wall and maybe a plant hugger. I love the handmade table and rustic ambiance.\n\nService is fast and not crowded on a cold winter morning. Cappuccino is well made with beautiful leave and down it like water. Perfect for my addict wife.\n\nI haven’t tried the food but from the way they made coffee, I bet they are out of this world too.",
            "Little pecks is my fav troy study spot and the nicest cafe in troy for the vibe.  Theres lots of space between the plant room, grungy industrial confectionary and the outdoor seating, and it feels like youve discovered something when you step into the back of the cafe.\n\nDrinks are pretty good, i like the lattes.  Chai here is standard, not my favorite.  I hear the matcha with lavender is good!\n\nThe food is a bit overpriced for what it is but thats typical for cafes.  The staff is always kind, talkative, and helpful with recommendations, and I like how they bring the food to your table. But ultimately, its the ambiance that makes this place stand out and worthy of 5 stars!",
            "I have never had a good tasting breakfast burrito anywhere around the states that I actually liked. My friend was pushing me to get it from little pecks and I was very reluctant to order it at first, but finally gave in. That breakfast burrito felt like a little piece of heaven. I was so zen after eating the first half lol. The jalapeño aioli in the burrito is something else. Love it. 10/10."
        ]
    },
    {
        "id": "ChIJ7d-xRZcP3okRbKys7623XKs",
        "name": "Recovery Sports Grill",
        "address": "235 Hoosick St, Troy, NY 12180, United States",
        "latitude": 42.738632,
        "longitude": -73.67107,
        "rating": 4.1,
        "reviews": [
            "The service was amazing for our large party's recent visit. The staff was incredibly accommodating and attentive, ensuring that everyone in our group was well taken care of. We arrived early and the manager was super helpful in getting us to a table and making us feel welcomed. The waitstaff was so organized with taking our order and getting our food out, they numbered each family in our party and it all worked on perfectly. Large parties can be challenging but they made it seem easy. The special pumpkin martini drink was delicious! Yum!",
            "My wife and I are staying at the Hilton Garden inn, located in Troy, NY and decided to have dinner here because it’s literally attached to the hotel. We ordered the Chicken basil pesto with mashes potatoes and broccoli it was absolutely amazing along with the Cajun Shrimp pasta which was perfection. Our server Natalya was great! We recommend giving this restaurant a try if you have not yet done so.",
            "One of the best spots of hoosick area to relax and dine in a very busy saturday night. Foods was delicious my salad so fresh.. chicken tinder the best! Higly recommend this place.",
            "Great place to hang out and watch the game. Great tacos and friendly staff.",
            "I have now ordered on doordash from them 4 times. I have given them 4 chances to get my order correct. Each time I have ordered the fish and chips...it comes with no tarter sauce or French fries. My question is how hard is it to double check and order before you send it out your door?"
        ]
    },
    {
        "id": "ChIJ_2AH3KcP3okRtsspGhEJNd0",
        "name": "Bowled",
        "address": "120 Hoosick St Suite 3B, Troy, NY 12180, United States",
        "latitude": 42.7387335,
        "longitude": -73.67631329999999,
        "rating": 4,
        "reviews": [
            "My first time here. In town visiting some family & I’ll say the food was excellent. The vibe of the place is very calming and inviting. The staff was nice and really helpful with making a good selection. The bowls were delicious along with the smoothie I had. My family was telling me that these stores have been popping up throughout the capital region which I think is great bc all I remember there being was fast food. It’s nice to have healthy options. 5 stars for me! Highly recommended.",
            "PEOPLE WITH ALLERGIES BE AWARE!!! The nighttime shift lead for this location intentionally put an allergen into my partner’s drink that wasn’t even included in the drink we ordered. We let her know we had an allergy so they could maybe switch the blenders or maybe wash one, instead she intentionally added pineapple to the drink, causing my partner to suffer. We have no idea why this happened, we weren’t rude, and are always well aware of how awful customer facing jobs can be. We have tried to solve this by contacting anybody in power and have heard nothing back, no matter how many emails we send or phone messages we leave. Buyer beware.",
            "So I place a pickup order to avoid the long wait inside. I show up (on time) and am forced to stand there waiting while 6 other people were helped in line. Finally I tell the girl who must have been new, our name and order. She proceeds to turn around and join her coworker in making someone else’s order. What was the point of me ordering ahead? On top of that, come to find out my order was in the cooler the entire time I was just waiting which obviously resulted in it being nothing but soupy. You can’t even see the toppings on it because they have sunken in not to mention the entire base is melted. Not impressed at all.",
            "My go to spot when in town. Comes here every other day for either healthy lunch/ dinner or a healthy açaí bowl to cool down in this summer heat. Dan the manager is legit and all the people are great. Come check them out!",
            "This is my favorite location. It could be a little cleaner as far as the seating goes but the customer service is always good and the fruit is always the best here. I swear the acai bowls are made better. Perfect amount of ingredients. The customer service is always top notch. Love it."
        ]
    },
    {
        "id": "ChIJqb6cI6gP3okRnrgyVX13JrA",
        "name": "The Whistling Kettle",
        "address": "254 Broadway, Troy, NY 12180, United States",
        "latitude": 42.7314618,
        "longitude": -73.6906679,
        "rating": 4.5,
        "reviews": [
            "Had a beautiful brunch here! The soup was so yummy. The crepes were excellently made. And the scones were delicious! You cannot go wrong with their tea selection either. We even bought some leaves to take home and it makes my work mornings so much better! Highly recommend!",
            "One of the best restaurant downtown troy area. Everything are perfect ambiance  my husband and i love outdoors. When we  are in this restaurant feels like we are in europe. This little old town bring so much beauty. Our waitress she is the best! Alexis.. u are amazing and friendly and most of all happy to served us❤️",
            "The Whistling Kettle is one of my favorite places! Love coming here for a decadent brunch - the tea is delicious, and the afternoon tea with a savory crepe, a premium salad, and a fresh baked scone is just an incredible meal. It's also got lovely atmosphere, for both the indoor and outdoor dining options (though hornets do tend to come try to steal your food when eating outside).",
            "Ordered from here about a half hour ago. Opened up my to go box to find this….. how do you think it’s okay to serve a “crepe” like this??? Didn’t know I ordered an open, half eaten looking crepe. So disappointed. Won’t eat here or ever recommend this place again.",
            "The teas here are exquisite and there are so many flavors available! I love that they have these perfect sample size bags so you can try a bunch without committing to a huge bag. You've got to do their afternoon or breakfast tea service; there are so many options for courses and they're all delicious. You'll leave full and happy. Come stay eat chat and catch up with a friend and then choose some yummy teas to take home."
        ]
    },
    {
        "id": "ChIJfV1OoWMO3okR1awl3l5_z5s",
        "name": "Scarlet Knife",
        "address": "195 Troy-Schenectady Rd, Latham, NY 12110, United States",
        "latitude": 42.7401777,
        "longitude": -73.7329689,
        "rating": 4.4,
        "reviews": [
            "Went here with my partner for our anniversary dinner. Had a reservation but it wasn't too busy on a late Wednesday night. Restaurant was clean and modern. Restrooms were super spacious, private, and clean. Lights slightly dimmed but not too much. Our waitress was sweet and attentive without being over bearing. She had great knowledge of the menu and answered all our questions. The truffle potato appetizer was amazing! We both ordered the prime filet steak and it was cooked perfectly and had a great sauce. Lots of wine to choose from. Our table was in the middle but we could still see the kitchen and the cooks. This restaurant made our night out a special time! Would definitely come back here again!",
            "5 stars all around. Our server Payson was an absolute gem. Chef Paul explained several details about the restaurant for us and even gave me a tour! We sat at the chefs table and we enjoyed watching everyone hard at work in the kitchen while we enjoyed our dinner. I can’t wait to experience the dessert room and have events in “The Gallery”. The food was top notch. Our ribeye/ filet was cooked perfectly and the sides complimented them beautifully. I wish I had words to explain how delicious and beautiful the dessert was, but there isn’t. It’s easily in my top 5 favorite desserts I’ve ever had in my lifetime. It was an experience in itself.\n\nScarlet Knife is an experience and I cannot wait to come back!",
            "My husband and I celebrated our anniversary at the beginning of the month. We had the option of sitting at the chef's table, which is an awesome experience to see how the chef and staff work behind the scenes.\n\nThe good was delicious and great portion sizes, we went home with leftovers! I love that the menu add wine pairings for food items, which is really fun to try.\nAppetizers: cheese board and oysters\nDinner: French onion short rib and grilled ribeye\n\nWe didn't check out the dessert room, but certainly had some dessert. The pistachio creme brulee and raspberry rose sorbet were a deliciously unique pairing.\n\nAt the end of our meal, we were approached by both the manager and chef (separately) about our experience which was really nice.\n\nWe will definitely come back!",
            "Husband and I had amazing lunch at this beautiful place.. our foods outstanding!! My husband told me they have the best chef ! The services was beautiful young lady with a beautiful smile and recommended as to go back some dinner time. Highly recommend this place to everyone.. restaurant with class❤️. We defenitely coming back.",
            "We came for brunch, and it was delicious.  The mushroom onion soup is amazing.  We also had the Creme Brule French toast, which was delicious, and the Eggs Benedict was pretty good. I only wish the potatoes were a little bit crispier. We'll definitely be back."
        ]
    },
    {
        "id": "ChIJezUNBYYF3okRiDL1SngLYcY",
        "name": "Aroma Joe's",
        "address": "666 Hoosick Rd, Troy, NY 12180, United States",
        "latitude": 42.7415581,
        "longitude": -73.6501634,
        "rating": 4.3,
        "reviews": [
            "Was excited to give this place a try. I usually prefer to support local but never hurts to try new things. The workers are extremely friendly but the process is definitely slow since there's no intercom used. They want to give you a more personal experience. Price is more than DD but less than Starbucks in comparison. I got the XL 32 oz iced Paris Toast. It was too light and more dairy than coffee. I'll probably wait a little bit and give them another try. Update: I gave them another try and did the XL iced PB Mocha and the coffee just tastes off. To many good places in the area to try again.",
            "As someone who frequents Maine often, having an Aroma Joes in Troy is great. I hope their next location is in Saratoga so I don’t have to dive 30 minutes for the best Iced chai around.",
            "Are you sick of Starbucks prices but want the same quality? Does Dunkin’ Donuts alway messup your order? If so, you’re not alone. On a whim, I decided to try a Rush Joe’s. On my way to work and oh my goodness I am blown away at how good the hashbrowns and bacon Gouda sandwich were! The staff was SO nice too! I will definitely be returning!!",
            "I haven’t tried the food YET! The iced matcha is great but really sweetened for my taste (be specific on what you want in case the menu doesn’t mention the details and be ready when you get to the window). It’s refreshing to see that they know the difference cold brew and iced coffee! They also open super early (530!) which is much needed on that busy route! Download the app to make it easier and mention you’d like to tip if you don’t have the app and don’t have cash! The owners have a great attitude and you can tell they love what they’re doing. I’ll definitely be back!",
            "Well... Aroma Joe's food pretty much stinks.   I asked about the breakfast sandwich and was told all the food comes frozen and they just heat it up.   A sad sausage and egg on some kind of dense biscut and some soggy hashbrowns.  They appear to specialize more in drinks.  My companion had a Iced Coffee with cream and caramel and described it as \"not aweful.\" and the Bacon Gouda Tuscan Roll.   All for the low price of $18.50 or so....  I usually dislike being this negative but it really was pretty bad.  Feb 2024.  Staff was nice."
        ]
    },
    {
        "id": "ChIJLYtO1wcP3okRyV8GEqxWAmY",
        "name": "Bespoki Bowl",
        "address": "122 4th St, Troy, NY 12180, United States",
        "latitude": 42.7289472,
        "longitude": -73.68924439999999,
        "rating": 4.6,
        "reviews": [
            "Arrived just around the lunch rush ordering the donkatsu and waited about 25 min. I don't know for sure but they were probably understaffed, however they offered me a free drink for the extra long wait which I appreciated! The food was really good, if you're in a rush probably safer to grab a poke bowl instead but if you can order/call ahead definitely worth it.",
            "We just landed and we're wanted to explore the city. Decided a bite to eat would be great. Found this place. Grabbed the bogogi lunch box and the sliders! Y'all!!! So good! Add some honey on the sliders and you got some gold!",
            "Top of the line quality food and service. The owner takes care of the customers like you’re going to their own house ❤️ great healthy choice in town, highly recommended!",
            "Visited cause it was reopened. Had a simple bowl and it was delicious.\n\nFish was included in picture, but can remove and exchange to substitute.",
            "Had the Korean Mandu and beef bone soup, it was pretty good and similar to how my Korean mother would make it. Their introduction of Korean-inspired dishes into their menu is good. Overall, relatively affordable and good food"
        ]
    },
    {
        "id": "ChIJa--jKKgP3okRNhWVBp65TSw",
        "name": "Liza's of Troy",
        "address": "53 3rd St, Troy, NY 12180, United States",
        "latitude": 42.7304786,
        "longitude": -73.6905582,
        "rating": 4.5,
        "reviews": [
            "Went to Farmers Market on Saturday had Big Betty sandwich on toast it was delicious. So went back on Sunday to restaurant and had it on a bagel along with waffle special and black cider and ice hibiscus tea. Everything was delicious. My daughter who’s Celiac was thrill with the choices.",
            "This was a cute place to have a light breakfast. We had gotten the raspberry waffle dish and it was delicious. The waffle was flavorful and we had a tea with it which tied everything together. The atmosphere was nice and I believe that this is a hidden jem in downtown Troy. I will definitely come here again! 😊",
            "One of the best cafe shop downtown!!! Beautiful inside friendly people inside!! When you are in this cafe you feel that your outside the country. ! Highly recommended this to everyone..",
            "I love plants! Loved sitting in a green atmosphere which was aesthetically pleasing and having some healthy brunch! Friendly staff! Food was tasty and smoothies were good. We ordered avocado & eggs and some bagels. Prices were a little higher but can understand that with the quality of the food we got to eat there! Overall a brunch place to definitely try if u haven’t!",
            "This place is so cute, employees are nice, and the acai bowl was one of the best I’ve ever had!"
        ]
    },
    {
        "id": "ChIJY_onBCEP3okRW6t2p_ws9xg",
        "name": "Naughter's",
        "address": "1809 5th Ave, Troy, NY 12180, United States",
        "latitude": 42.7312362,
        "longitude": -73.6879173,
        "rating": 4.9,
        "reviews": [
            "Small inside (Only 9-10 seats), with a couple of tables on the sidewalk, but the service and food was excellent. The lunch menu isn't large, and we wanted something different, so we ordered the chick pea salad and industrial eggplant sandwiches. The chick pea salad was surprisingly  delicious, and my eggplant was also impressively tasty. And then I realized our meals were vegan as well (we are not vegetarians). I cut the eggplant sandwich in half (which squished it a little) and took a picture so you can see the layers of flavor.\nThe fries were also very good. Very simple, like the frenchfries we would get decades ago. No coating. No processing, just fries good well.\nWe want to try their breakfast next time!\nAtmosphere was old fashioned and simple, but fun. Like a luncheonette from the 60's. Great music.",
            "I’ve been to Naughters twice, and honestly, I’m a little surprised by its high rating.\n\nIt’s an adorable diner with charming interiors that have a vintage vibe. When you enter, you’ll find a few tables and some bar seats. Due to the limited seating, depending on the day and time, you might encounter a wait.\n\nThe menu at Naughters is small. I’ve tried their vegetable hash and the eggplant sandwich. The food was just okay, but it was nice to see the chefs cooking right in front of you in the open kitchen. The staff were quick, patient, and attentive. The coffee was also just okay.\n\nOne advantage this spot has is that it’s open till 2:30 AM on Fridays and Saturdays, making it a potential go-to for a late-night bite after drinks.\n\nI felt like my experience was pretty average, and I probably wouldn’t go out of my way to visit again.",
            "Update: i finally tried the french toast here and it is amazing!  Crunchy and tossed with sugar.  Everyone should order this, perhaps as an extra dish to share.  The burger here is really good as are the fries.  The tuna melt is great, wish it came with some more fresh lettuce or tomatoes.\n\nOriginal review:\nAmazing little spot in downtown troy.  Super cool vibes and great staff, the food is simple.  Sometimes have to wait a bit as its very small inside but usually things move fairly quickly.  Love the coffee refills too.  Homefries, egg, toast, bacon egg and cheese are all good\n\nCant wait to try the chopped cheese",
            "We were visiting our son at RPI and was looking for a place that serves breakfast. We’re so glad to find this gem in downtown Troy. I had the Eggs Benedict, and it was perfect. My husband had the French omelette and it was also cooked perfectly and good.\nThe storefront is light blue. We missed it the first time because we didn’t see a sign.\nWe will definitely be back to try their lunch and dinner menus.",
            "Went out for a bite to eat in downtown Troy, one of the only place we found serving food late at night. We ordered eggs and home fries others at the bar had the chopped cheese sandwich and the fresh toast sticks were HUGE ended up sharing with 3 friends. Fair prices and good food. I liked the old school bar stools and the staff were friendly and accommodating. Check them out for a bite to eat early or late!"
        ]
    },
    {
        "id": "ChIJiVQ8nmIP3okRI0uZ86XcLGk",
        "name": "Panera Bread",
        "address": "110 8th St, Troy, NY 12180, United States",
        "latitude": 42.730022,
        "longitude": -73.67653109999999,
        "rating": 3.3,
        "reviews": [
            "This Panera Bread was inside RPI - which made it hard to find as it did not say that on any map. I was with a friend who had a walker, so that was tough for us, but we really wanted to try it out. Two young ladies helped us get into the building, as the doors we tried were locked. The room was cafeteria style and had flags hanging up around above us. The food, as usual at panera, was delicious and good portion. They had a pastry case filled with dessert. I tried the new lemonade and we both had sandwiches that had just been added to the menu. Nice space, we were able to sit and chat without being rushed. I thought the staff was friendly.",
            "I couldn't yell you how this Panera was because it was inside of a college building,  and I could not access it. It did not mention this in the search map, which would've been useful information.",
            "Great bread, as long as you get there early enough they normally have enough in stock, but later in the afternoon it is a toss up. Occasionally there are issues with the ordering pads being down. Sometimes the software will randomly remove things from the menu which you then need to go and ask for manually.",
            "Very good customer service here. I ordered the tuna Salad sandwich. Since it was not up on the menu I did not realize it came with a different type of bread than my wife was used to. I pulled back around to let them know I made a mistake by not telling them to use sourdough bread. They didn’t charge me for the fixed sandwich.",
            "The food isn't any worse than any other Panera, but they've got like a 50% accuracy rate for me at this point.  I almost always get the same 2 things, and the last 5 times I've been, I've only had them both be correct once..."
        ]
    },
    {
        "id": "ChIJTU0zsR8P3okRhYAIDAu5_Ow",
        "name": "Nighthawks",
        "address": "461 Broadway, Troy, NY 12180, United States",
        "latitude": 42.7308889,
        "longitude": -73.68794129999999,
        "rating": 4.6,
        "reviews": [
            "We tried here on Sunday 10-20 we were seated quickly by great host. Everyone was awesome this place is definitely our kinda place our kinda people. I ordered the cheeseburger and fries. It was cooked perfectly as I ordered. The fries were excellent also. My wife got the house made veggie burger. No pics sry. She said that it was the best she's ever had. For price you can not go wrong here. And we will absolutely be going back.",
            "I took my teenage son, and we both really liked our food. I'm glad there's a burger on the menu because it was the only thing he was interested in, so that's something to keep in mind if you have younger kids or picky eaters. The pickles on our burgers were the best part, as they were amazing. They said they had to seat us at the bar because we didn't have a reservation, which was kinda weird because the place was mostly empty the whole time we were there, but the bartender was incredibly sweet. I will say that it is very expensive. I got one mixed drink, my son had a root beer, and our two burgers and fries was $75 including the tip.",
            "I have had some great meals at Nighthawks. The vibe as you walk in is very inviting and welcoming. The fried chicken sandwich and cheeseburger are two of my favorite things to get. I can’t also say enough about the asparagus toast or cinnamon bun. There are so many different options and sometimes it can be difficult to choose. I see that as a good thing because sometimes you want to have that problem!\n\nThe outdoor seating is very nice as well during the hotter months and I would definitely recommend making reservations if you are going not matter the day or time just to make sure you can get a table. There is a bar to sit as well, but if you want a table I would suggest making a reservation.",
            "Nighthawks is one of my favorite places to eat in Troy! The menu is fascinating and filled with bangers, and the staff is super friendly. I’ve had some of my all-time favorite dishes eating here.\n\nAs a note—the attached photos (save for the one with the cod and greens, which I had last night and it was amazing) aren’t just from recent menus. I’ve been here a bunch of times and wanted to highlight some of my favorite meals there! By the way, get the opera cake for dessert.",
            "Best juicy and flavorful burger!!!\nEverything was perfect… soft bun, meat cook perfectly, cheesy, flavorful, home made French fries 🍟 mmmmmm!!!"
        ]
    },
    {
        "id": "ChIJo5eXVzEP3okReUgmO4fFocg",
        "name": "PRIME at HVCC Main Cafe",
        "address": "Siek Campus Center, Second floor, George E Halliday Dr, Troy, NY 12180, United States",
        "latitude": 42.6967408,
        "longitude": -73.6837041,
        "rating": 3.5,
        "reviews": [
            "This is some of the best cafeteria food I've ever had! I love how their menu is always changing and they put out cool signs with info about where their food is sourced and fun facts. Their staff are really nice and accommodating especially the managers Jon and Scott. They even make meals-to-go every Wednesday so you don't have to worry about dinner!",
            "Definitely better than your standard college fair. Food is palatable, you don't feel like you're going to die from a salt overdose, and the staff are nice.\n\nOnly things to note are that you should definitely wait until at least 10 or so to get pizza because after that the food has been fresh cooked within the last 20 minutes or so (and because the frozen stuff they put out before that is... Edible but tastes like it's been left in there a wee bit too long).",
            "Lazy staff, overpriced food, unreasonable waiting in line times, food shortages, the list goes on... If anything is a big seller and customers like it, you know that they are already trying to get rid of it.  This company really has gone from a pinnacle of success to an absolute disaster.  I should not have to walk across the street in the freezing cold to get food that is just average.  Although it takes less time to walk across the street and back with food than it does to just pay for it at PRIME.  Really wish people cared about their product that they serve instead of force it upon ourselves unless you want to go somewhere else.  My recommendation to anyone even thinking about going to this school should really plan on NOT buying from PRIME, and if you need something fast then go to a vending machine because even a vending machine is better than this place.",
            "This is my favorite place on campus to get food. They always have something for everyone. Including chef specials, sushi, the main grill, prime-ito and pizza. The head chef and the director of operations are some of the most accommodating people. The food is always fresh and prime always has something interesting and new that people haven't heard of on the menu, DAILY! They serve breakfast and lunch. Did I forget to mention the salad bar (pay by the pound). They also have ice cream, soda, coffee, tea, water and a variety of chips and other fresh prepared snack packs, yogurts and cold sandwhiches.",
            "Very expensive for the cafeteria-quality food and lack of diversity on the menu. Staff is reasonably nice, but students are better off crossing the street to inexpensive competitors for a wider array of food at a lower cost."
        ]
    },
    {
        "id": "ChIJoyrvzfoP3okRtxjNrSB6tc8",
        "name": "Bard and Baker Board Game Cafe",
        "address": "501 Broadway, Troy, NY 12180, United States",
        "latitude": 42.73089030000001,
        "longitude": -73.687679,
        "rating": 4.8,
        "reviews": [
            "One of the best boardgame cafes ever! They have an impressive assortment of games that they do routinely swap out to ensure good condition, plus you can rent them to bring home. They expanded and have an extra room on the side to play. Food is decently priced and has vegan options. I had the breakfast burrito and was very satisfied. The staff are super nice. There's an assortment of game themed merchandise and local drinks. Also cool to see how much community involvement is here based on their postings for regular DnD oneshots and activities like bonsai bars. I wish I lived near this place. It was such a good experience coming here.",
            "My friends and I (group of 7) really enjoyed our time here. We visited for the first time on a weekend and were surprised we could get a table without a reservation. The game selection was huge and there were multiple copies of popular games. They also had a food and drinks menu. We ordered a poutine and a Nutella hot chocolate, both were pretty good. Definitely a fun place to hang out when you need a break from walking or take shelter from the outside elements. We paid $10 per person, but students are half price. There’s no time limit unless you’re sitting at a table with a reservation later in the day. Would definitely recommend making a reservation to guarantee a table if you have a larger group.",
            "We got bubble tea, it was AMAZING! Super welcoming crowd and very aesthetic place. 10/10 highly reccomend.",
            "Came here on a Saturday afternoon for a friend's birthday they have a HUGE selection of games and i was glad to find that all the components were present and cards sleeved for the games we chose to play. We had drinks and food, several of our party enjoyed the pizza bagels and i had the buffalo cauliflower mac and cheese which was good! The portions are more snack sized so you can try more than one item from their menu. There were a number of vegetarian options including the boba tea. The servers bring your drinks and food to the table for you so you wont miss a turn when playing games!",
            "I only wish I lived closer to this wonderful café! The food was absolutely delicious and freshly made, and the staff couldn't have been more friendly. We enjoyed perfectly flaky croissants with amazing jams, a variety of tasty quiches, and their hummus along with ciabatta bread were fantastic! If you’re ever in Troy, be sure to add this wonderful café to your itinerary! Kudos to the chef!"
        ]
    },
    {
        "id": "ChIJp75f2AsP3okRwv2bfrqW8ZI",
        "name": "Mallo's",
        "address": "156 4th St, Troy, NY 12180, United States",
        "latitude": 42.727595,
        "longitude": -73.68959819999999,
        "rating": 5,
        "reviews": [
            "Heard this place was one of the best in Troy but was very much let down. I bought the Italian sandwich which is way overpriced ($13) & sounded great until I received it & there was some kind of salad dressing on it that tastes & looks like thousand island but the description only called it a Vinny which I assumed was vinaigrette. They also claim to make their own capicola which I was looking forward to for it to only be ham with no spice or heat to it at all. Ik everybody make cappi differently but that’s not even hot ham which would be closer to cappi. The sandwich (which I ended up throwing out with only one bite taken) looked decent but nothing I would consider better than a regular sub shop.",
            "the roast turkey sandwich is absolutely incredible, the flavors 🤯 such a cute little spot and the staff that checked us out was so kind and welcoming. definitely check them out!!!",
            "Hands down the best sandwiches in the whole capital region. Super high quality ingredients and everything is always really fresh with tons of veggies snuck in for such a unique and delicious combination of flavors. Mallo’s is my absolute favorite spot for a quick bite, the staff are so nice and they always have really good music and ambiance. A lot of restaurants put 0 effort or flavor into their vegan menu options.. not Mallo’s. You’d think vegan food is their specialty because they have 2 absolutely phenomenal vegan sandwiches. The Veggie can be ordered with homemade cashew cheese sauce that is to die for, and the Cauli-Reuben is what dreams are made of (caramelized onion heaven). If you have room for it, try their homemade potato chips! I can’t recommend Mallo’s enough, it’s 100% worth the trip to downtown troy!",
            "I’m going to say it… Mallo’s is my favorite restaurant in Troy, hands-down! I just went for the third time and I have been blown away with four different menu items. The quality is top-notch and the flavor combinations are delic! Tons of GF & veg options too.",
            "I am very picky about food, and the egg sandwich I had here was the best sandwich I ever had in my entire life. I chose sausage option. Forgive me for the bad photo, but trust me, you will not ever be disappointed here. The boss is pretty chill as well."
        ]
    },
    {
        "id": "ChIJ8U-0eF0F3okR_-FqDpk1a_c",
        "name": "MochaBlend Espresso Bar",
        "address": "720 Hoosick Rd, Troy, NY 12180, United States",
        "latitude": 42.7434427,
        "longitude": -73.6428277,
        "rating": 4.3,
        "reviews": [
            "our drinks tasted awesome! reasonably priced, too. staff was very nice. however, as other reviews said, the religious overtone was a slap in the face as soon as we walked in. obviously, everyone has the right to run their business how they want, and this cafe is no exception. however, I personally was uncomfortable and will not be returning. if that’s your jam though, go for it.",
            "This is my go to meeting place in Troy . Everything is delicious ! Cranberry Orange Muffin is sinful !\nAmazing Customer service above and beyond ! Sonya is lovely and really goes out of her way ! She is an asset to this lovely cozy Coffee  Cafe !",
            "Excellent coffee and breakfast sandwich. I read a few reviews based on political/religious ideology. Honestly really weird and petty. One reviewer gave it *1 star and said they “walked by the place while going to the market”. LOL Ok!\nI think every coffee shop I’ve been to in any major city is riddled with BLM,Revolution /LGBTQ+ flags and/or memorabilia. It doesn’t trigger me lol I could care less. Everyone’s entitled to their own beliefs\nAnd If the owner of this establishment believes that\n“Jesus is the way, the Truth and the Life”, I’m totally ok with that! God bless her.\n\nMocha Blend - thank you for an excellent breakfast sandwich and coffee. I will make it a point to come in more regularly.",
            "Live down the road perfect place to walk down grab a coffee and a breakfast sandwich. Great service and I'm gonna miss this place when we move. Oh and the chocolate chip cookies are the bomb!!!",
            "The heartland panini is delicious and the Oatmeal raisen cookies super good will come back again it's the most cozy looking place they have the comfy chairs too"
        ]
    },
    {
        "id": "ChIJba516HEF3okR3l8k66cKJy8",
        "name": "Herbalife Unbeatable Nutrition",
        "address": "720 Hoosick Rd, Troy, NY 12180, United States",
        "latitude": 42.7436515,
        "longitude": -73.64416709999999,
        "rating": 4.4,
        "reviews": [
            "We LOVE their lemon pound cake shake and white chocolate Reese's shakes. They are delicious and make a great lunch or snack.",
            "They have AMAZING gluten-free Apple Pie smoothies, very filling. It's a five minute drive from Planet fitness and I took my parents there after we worked out. My Mom is gluten-free and we were surprised they had a few options for her, also including their Birthday Cake smoothie. My Dad loved their banana smoothie too. Delicious and not expensive at all",
            "This is literally hands-down the best drink shop in the area if you are looking for nutrition and a good dose of caffeine stop in there and see the girls they are wonderful. All the ladies in there are absolutely beautiful. Family owned and operated. The protein shakes are out of this world. Definitely stop in and say hello.",
            "Amazing atmosphere, beautifully done inside, great priced teas and shakes. The staff is by far the most friendly and inviting out of any shop i have been too, family owned and oriented and big supporters of our first responders!",
            "This place is amazing whether you are looking for a fun caffeinated pick me up, a delicious meal replacement protein shake or a cup of protein coffee.. You cannot go wrong with the products, friendly staff and atmosphere this place has to offer!"
        ]
    },
    {
        "id": "ChIJ6QUMrScK3okRQ3y-519n2-c",
        "name": "The Fifth Tier Baking Studio and Coffeehouse",
        "address": "197 Main Ave, Wynantskill, NY 12198, United States",
        "latitude": 42.6940459,
        "longitude": -73.63492409999999,
        "rating": 4.8,
        "reviews": [
            "Very good bakery and a great place to hang out in a cool setting. The interior of this bakery has a wow factor. Lots of seating and places to have lunch/breakfast with friends. They have a wide variety of baked goods but their quiches and scones, both sweet and savory, are definitely the highlight. We had a mushroom leek gruyere scone which was hot and very mushroomy which was a plus. They have other baked goods like cinnamon buns and whoopie pies. They also have a wide variety of drinks. The service is friendly and they also have a wide variety of gluten free options, including the quiches.",
            "Loved the blueberry cobbler! Was warm like it just came out of the oven and Tastes just like homemade and bonus was.. they allow dogs! Highly recommend",
            "Update 08/24/24\nStill amazing.\n\nThis I'd my First time visiting Fifth Tier Baking Studio. I'm glad I finally took the time to stop in and enjoy what they have to offer. Walking in, the atmosphere is welcoming with calming vibes. I enjoyed all the plants around the seating areas. Seating consisted of a few larger tables (family/ friends style seating), and booths along the windows. Back right is a comfortable L-shaped bench including high tops and stools. From my understanding what is available for their baked goodies changes often, during my visit they had gluten-free cupcakes, wicked big cookies, quiches, scones, coffee, tea, homemade salads, and more. Everything I put my eyes on in my opinion looked delicious!\nI ordered a Chai Latte which I thought to be very good. If you want a chillax and a pretty quiet place to just enjoy a coffee, Chai,  breakfast goodies, or whatever else they have to offer for the day I highly advise checking out THE FIFTH TIER BAKING STUDIO. I will be returning in the near future.",
            "Delicious food in a relaxing environment, served by kind staff.\n\nI have Celiac and the owner has multiple gluten free options!  And they don't taste gluten free!  It's a new world 😊 now - there exists good gf foods!\n\nMy favorite thing about the shop is alllll the plants & flowers, and the decorating is the happy opposite of your average box store.\n\nWonderful to have this in Wynantskill!",
            "We've been here fairly consistently since they opened in Wynantskill (never visited Albany location prior).  I love their biscotti-not too dry that you have to dunk it and a nice variety of flavors.  If they have GF biscotti, I'm not aware as the ones I select are not.  I don't seem to have too many issues with them (gluten sensitive).  Scones are nice as well.  Again, not too dry nor too wet.  Soups-have had a few, 15 bean and Veg are my favorites!  Oh, and chili!  Coffee-I'm not a dark coffee fan so I tend to get lattes and theirs are good.  Harney and Sons teas.  GF brownie with ganache is very good, don't let the GF deter you!  I'm not a quiche fan but have had a few which I have liked.  Nice atmosphere with booths, tables and sofa seating.  Decor is comfortable with lots of plants.  Good sized single rest room (helpful with kids).  Parking out front limited but there's a lot in the back with outdoor seating.  Always friendly service!  Pics are of a quiche, scone and veg soup."
        ]
    },
    {
        "id": "ChIJUWYcjpMP3okR2MMrxyRZbiU",
        "name": "Park Pub Restaurant & Catering",
        "address": "2701 Lavin Ct Suite 1, Troy, NY 12180, United States",
        "latitude": 42.7447548,
        "longitude": -73.6708474,
        "rating": 4.5,
        "reviews": [
            "I was there with a group of friends from HS. Our 50th Reunion was the night prior, and there were 18-20 of us meeting up.\nOur waitstaff was so accommodating, and the food was amazing.\nWe weren't rushed out at all, and we were there for hours.",
            "The deck was a perfect spot to look out over the greens of the golf course..\nour dinner was delicious too..  special of the night was crab stuffed shrimp 😋.",
            "My wife and I were out walking the trails on the beautiful Frear Park Golf Course and we decided to stop by the Park Pub for some lunch. All I can say is we will definitely be back, everything we ordered was delicious and our server, Debbie was fantastic and spot on with any and all of our requests, so friendly. We hope to see you again soon!",
            "The food is good and the people are really nice.",
            "Park pub attached to a hockey rink wouldn't be a place you'd expect to get great food. But it's a place you need to visit! We took a group of over 30 and yet the staff kept up with no issues. A whole bunch of items on the menu that sounded great, the wings were fantastic.  Additionally \"to go cups\" are available if you want to take an adult beverage to the rink. This definitely needs to be on your to do list if you're in the area"
        ]
    },
    {
        "id": "ChIJD10WZdgP3okRjybFG_wRLnc",
        "name": "Mumu's Cafe",
        "address": "2207 15th St, Troy, NY 12180, United States",
        "latitude": 42.7346118,
        "longitude": -73.67637839999999,
        "rating": 4.7,
        "reviews": [
            "First time coming here and wanted to give an honest review. The store is small for its size but when you first walk in you get the heavenly scent of fresh baked food and the aroma is what really draws you in. If you like sweets and freshly made food this is the spot to try. Staff is very friendly. Food tastes amazing and my friend and I had a Bacon and Guacamole on a ciabatta and a croissant with turkey bacon and roasted peppers. I had a Cinnamon Crunch Waffle and it came with mini white chocolate chips and Cinnamon Toast Crunch cereal. We also ordered another waffle that was a PB&J Waffle that was to go but I’m 100% sure it tasted amazing either way. Definitely take your time to come out",
            "Stopped for breakfast on a work trip  - what a wonderful and delicious surprise! Great Turkish coffee and borek plate withe overeasy eggs! It looks small and I felt so full.  Highly recommend!",
            "This is a cute little cafe with amazing food and delicious Turkish coffee. Me and my mom were looking for a nice breakfast spot and could have not been more pleased. Perfect for savory or sweet breakfast options. We even left with an extra takeout of pastries. Highly recommend!",
            "Mmm mmmm first time here. Visiting from out of town. A smile welcomed me. Food was delicious.  Such a cute little space. Mmmm balaclava.\nWould've liked some chill background music.\nRecommend a stop by for sure.",
            "Adorable place with delicious breakfast and lunch options. I got the borek with spinach and feta and it was delicious. My dad really enjoyed his french toast with fresh fruit. I also highly recommend the Turkish coffee! Will definitely return to try the baklava and other pastries."
        ]
    },
    {
        "id": "ChIJHcq7RFkR3okRCRWtJLVIWho",
        "name": "Oh Corn! Arepas",
        "address": "429 River St, Troy, NY 12180, United States",
        "latitude": 42.7361124,
        "longitude": -73.68744339999999,
        "rating": 4.7,
        "reviews": [
            "I was in town for just a few days but when I was looking for places to grab some dinner this place caught my eye.\nI’m glad I made the decision to visit. All of the restaurants I visited while I was in town were great, but the food here was able to satisfy a craving that none of the other stops could satisfy.\nWith so many great restaurants in the area I would suggest adding this one to the list of you are in the area.\nThe staff was great at suggesting their menu options, the sauces were spot on, and the tres leches was so sweet and moist.",
            "Much bigger inside than it looks from the outside. Plenty of space but limited service (one wait staff) but service was still good. Took awhile for the food to arrive since we were a large party but It was delicious and filling and left us pretty happy.",
            "I first dined in with a friend who recommended this food. I like a good arepa but these arepas and cachapas are an A+. Every bite is delicious and the service is great. I’ve been back a few times and continue to recommend to all I know. I can’t wait to go again. Please don’t ever close!",
            "Never had chachapas before. Now I do and I want more. Brought my friend who has Celiac's here. He said it was really good.\n\nGot the Pernil Arepas and Queen Chachapas (Chicken avocado mayo). Chachapas were delish. Arepas, I am indifferent, perhaps I'm just not used to them. It was still tasty. The sauces provided were great. Next time I go, I'll probably try some empanadas and a different chachapa. I should not have ordered two things. Each thing is very filling. Lotta space in this restaurant. Street Parking was ok.",
            "Ordered takeout from here for my family. The food and sauces were very good! My favorites were the empanadas and the cilantro sauce. But it was very expensive for small portions. I ordered the 6 mini arepas for $18 (pictured). It felt like very little food for $18. This was my family’s first time eating here, and we had to go out and get Chipotle after because we didn’t realize how small the portions were. We were still so hungry!"
        ]
    },
    {
        "id": "ChIJ6_N9fi0P3okRBF86U0bbum8",
        "name": "Panera Bread",
        "address": "16 N Greenbush Rd, Troy, NY 12180, United States",
        "latitude": 42.6952709,
        "longitude": -73.6884382,
        "rating": 4,
        "reviews": [
            "INCREDIBLE customer service! Cashier let me sample a drink when I wasn't sure about what I wanted and was SUPER patient and helpful with my order. Food was tasty, I love stopping here after class.",
            "I ordered 2 lattes, a small Mac and cheese and a half sandwich at the drive thru.cost $30\nwhen I home I realized they gave me cold lattes when I expected hot ones.\nI would of returned them but I didn't have the time\nDon't you train your employees?\nI'm not happy, I will think twice before I spend that much for so little quality",
            "My wife ordered pick up here today. They loved the food and it was easy for her to order.\n\nBut I was impressed that the staff was warm, and helped me to the pick up counter for mobile ordering. It made the trip positive.",
            "I tried the new Chicken Bacon ranch sandwich and it was not good. I am not sure if it is this store or the sandwich just does not taste good. Rubbery chicken.  They didn't have the correct bread.  The cashier was fine.  Of course the prices have gone through the roof. 27 for a salad and a sandwich. It was not busy at around 5 pm on a Thursday.",
            "Food was great and customer service was above and beyond! The manager checked in a few times and brought us boxes without asking."
        ]
    },
    {
        "id": "ChIJY2xb8C0P3okRnnfQGireFBw",
        "name": "Alias Coffee",
        "address": "219 4th St, Troy, NY 12180, United States",
        "latitude": 42.7249622,
        "longitude": -73.6906851,
        "rating": 4.9,
        "reviews": [
            "Alias Coffee Cafe was the ideal venue for our Albany Travel Society. We gathered there to share a cup of coffee on a Sunday afternoon while enjoying the Art Show they had on displayed called  \"Spring Has Sprung.\" The cafe's ambiance, coupled with the stunning artwork on display, created a truly inspiring atmosphere.\n\nWe were delighted by the exceptional coffee and delectable pastries. It was the perfect complement to a morning of cultural exploration. The staff was friendly and accommodating, making our group feel welcomed.\n\nAlias Coffee Cafe is a must-visit for anyone seeking a delightful blend of art, coffee, and community.\n\nSincerely,\nLady Caitlin Magee\nFounder, Albany Travel Society",
            "We were on our way to the Albany Airport and ran in just before closing and the coffee was great - a cortado and an iced rose latte - and so were the day old pastries which the barista gifted us just as she was closing down for the day. A great way to end our time in New York.",
            "Drove out of our way for this 5 star coffee but was quite disappointed. The maple latte lacked flavor and the iced mocha was non palatable.\n\nGiving 3 stars because the barista was super kind and maybe we just have high coffee expectations coming from metro NYC area.",
            "I havent had coffee this good in ages! They roast locally and the love is reflected in their coffee. Thank you!",
            "I wish they have coffee mugs and more pastry variety, but otherwise very good coffee. Seems to be small, but have spacious back space with small stage and can host music events. Nice place and friendly staff."
        ]
    },
    {
        "id": "ChIJY4SCTrAN3okRPo9nOazbjI4",
        "name": "CoreLife Eatery",
        "address": "579 Troy-Schenectady Rd, Latham, NY 12110, United States",
        "latitude": 42.7534126,
        "longitude": -73.7652148,
        "rating": 4,
        "reviews": [
            "Found a couple pieces of hair in my food the last 2 times I went here. The food portions are never the same. You’ll get a bowl loaded the next time you’ll finish a bowl in 2 bites. They need better consistency. Also there very cheap on the tofu, you might get 4 pieces in your lucky.",
            "Pretty disappointing- ordered a large Greek chicken and quinoa salad, the lettuce is a bit wilted, they were out of a few of the toppings making them very minimal, asked for extra cucumbers and feta and did not receive even close. Barely any dressing, I never leave reviews but after really looking at what I paid for it’s certainly not what I received as there was a whole lot of room left in the bowl and the service was pretty slow and it didn’t appear to be very busy. If I wasn’t in a rush I would’ve given it back and asked for a refund. Not the best location today.",
            "New fresh and healthy place to eat.  Eat well minus the guilt.  The facility is clean, open, and welcome.  Appropriate for children.  The menu is tasty- a lot of good options.  The portions are health conscious but still filling.  I had a regular sized salad (pad thai)  and a soup.  The prices are reasonable- you can get a meal for between $9-15.  The kids meals are great and prices well, at around $6.  My daughter really enjoyed her meal- they let her change some of the options in the Power Bowl.  The staff was still getting the hang of things but pretty friendly.",
            "Great healthy option and the food always tastes good. They package everything well, use fresh ingredients and it’s priced very fairly. This location is always clean and consistent.",
            "Fantastic, if you think about what you're doing. I always get the build your own to get exactly what I want. You can't just randomly put stuff in, you have to think about how the flavors and textures interact. So here's my recommendations.  Base 1 is spicy Thai noodles. They aren't really spicy but the texture is great. I always get cheddar cheese and hard boiled egg. The rest varies depending if you want soup (broth) or salad (spinach). The salad youd want more crunchy things like broccoli, chips, nuts. The soup would be softer things like corn, beans. They have dozens of ingredients, most at no extra cost and you can choose 5. Then of course choice of protein, or none. It's a large amount of food for the price and Its great, fresh and healthy! Excuse the photo lighting, it was taken in my car in the dark. Which, by the way the building looks so cool in the dark! Also recommend the various lemonade, fruit, iced coffee and tea drinks."
        ]
    },
    {
        "id": "ChIJffydZ88P3okRTb-LgDh8g-g",
        "name": "The Breakfast Nook",
        "address": "433 River St, Troy, NY 12180, United States",
        "latitude": 42.7372579,
        "longitude": -73.6871934,
        "rating": 4.5,
        "reviews": [
            "Love love love this place! Coffee amazing, French toast to die for and i can’t get enough of that NYCC chicken sandwich! Staff super friendly and i love the dancing cook!",
            "I really wanted to like this place, their photos looked so good. Yet it was just average. The coffee was delicious and it was hot and fresh and the employee was lovely and friendly. However she was the only one there doing everything from taking orders to cooking. The French toast dish my husband got was cold and his over easy eggs were over hard. My avocado toast was grocery store sliced bread, very little avocado and cold, chopped hard boiled egg. (I expected a fresh egg). The toast was also ice cold.",
            "I hated when I got down to my last bite! This was the best omelet!!!!!!!!\n\nI washed it down with my Ice Coffee that had specialty ice cubes made with their very delicious coffee!!!!!!! This was one heck of an experience! I’ll be back later!\n\nIngrid Bennett\nCo-Host Sheba Talks Talk Show (shebatalks.nowcast.cc)\n\nOwner\nIKW Group Print & Marketing",
            "Great food, friendly service & coffee ice cubes in my iced coffee!! Love this place.",
            "I’ll give it to them, they were likely understaffed today. But honestly, the Thomas’s bagel from the grocery store was quite a disappointment in a city with pretty good bagels. Everything was burnt, tasted like smoke, and the coffee was honestly the worst part."
        ]
    },
    {
        "id": "ChIJm2BpFRkP3okRpRo8OjWzKdg",
        "name": "Inside the park CAFE",
        "address": "79 102nd St, Troy, NY 12180, United States",
        "latitude": 42.7559927,
        "longitude": -73.6759393,
        "rating": 5,
        "reviews": [
            "Very Good Food,And Super Staff.Just Call or Text For Your Orders.Quick Response."
        ]
    },
    {
        "id": "ChIJywLYOR0N3okRXLjk6SSil20",
        "name": "Sam's Club Cafe",
        "address": "579 Troy-Schenectady Rd, Latham, NY 12110, United States",
        "latitude": 42.7579391,
        "longitude": -73.7628615,
        "rating": 4.8,
        "reviews": [
            "Always my go to for lunch",
            "",
            "",
            "",
            ""
        ]
    },
    {
        "id": "ChIJu66HA6gP3okRqcph9QK8dt0",
        "name": "Koni's Broadway kafe",
        "address": "357 Broadway, Troy, NY 12180, United States",
        "latitude": 42.7311101,
        "longitude": -73.6894001,
        "rating": 4.7,
        "reviews": [
            "Convenient spot and pretty quick when theres not a big line.\n\nFood is good, i enjoyed my sandwich (the mitzi).  Veggie sandwich was not bad, had hummus flavor and tasted fresh.  I like that they use pesto on the pasta salad as opposed to just mayo, and having dill pickles on the side was nice.\n\nThe coffee was okay, not amazing and wish they had more options.  Decor inside is interesting, has more of a vintage troy brick vibe- its different, not as nice as the other trendy cafes but this place is more of a restaurant with reasonably priced food and much less of a cafe.\n\nService was good when we went",
            "First time going there and the food is delicious I definitely am going to go back again very nice family business people",
            "Just discovered this not so hidden gem in Troy. Clean, Fast and Friendly was my first impression. Then I took a bite of \"The G\"  (one of their roast beef sandwiches) and fell in love. Homemade chips, a great pickle and a fresh brewed ice tea with a shot of raspberry for $11 you'll never order anything else. Best part is the owner herself can be seen working in the back so you know there's love going into all she does. I'll be back.\n\nUpdate- I went back and had the same thing. Just as great. Third times the charm...",
            "Super cute place with high quality sandwiches. Did not feel like they were prepared to handle more than a line of two people though. Was one of five people inside/one of three people waiting for food when I arrived with a friend 15 minutes before it got crowded at 11:40am. My friend got her food at 11:50, but we had to check in twice before I got mine at 12:10. Just sandwiches. They also got the side wrong.\nGood food and vibe though! Will be back.",
            "Western wrap is the best breakfast item there. People are nice and I’m glad I found this place."
        ]
    },
    {
        "id": "ChIJiymNc3sN3okRMMzM2m5ldMk",
        "name": "Fruit Loop",
        "address": "800 Loudon Rd, Latham, NY 12110, United States",
        "latitude": 42.7478237,
        "longitude": -73.76364439999999,
        "rating": 4.8,
        "reviews": [
            "I love Fruit Loop! They have great options for smoothie bowls and regular smoothies, avocado toast menu is so good.. and they have a cooler with Recess drinks (mock craft cocktails).. plus the Latham location is like a jungle inside, it's such a nice atmosphere 💚",
            "Love this place to get my drinks after shopping. Beautiful interior indeed. A choices of healthy options menu. Highly recommened this place",
            "Smoothie place. Very nice atmosphere. Kind of expensive though. And the menu you have to scan to view online so I feel like it was hard to read and especially for older adults it would be a downside. Great flavors though and real ingredients used. I would do a regular smoothie over their smoothie bowls to save money.",
            "Such a lovely atmosphere! Staff is very friendly and the food is amazing! There are so many smoothies , drinks, bowls,  toasts, and sandwiches to choose from. Also, their protein bites are so good!! I got the Brown sugar shaken chai this time and it was amazing! So much better than Starbucks!!!",
            "The food was delicious. We had avocado toast and Kinda Big Dill. The issue was the young woman preparing the food after we got our food was continually tucking her hair behind her ears and not changing her gloves when she went back to preparing food. 😝\nThe bathroom had no paper towels, when I bought it to her attention she said, “I know.”\nNot, thank you for bringing this to my attention, or, “we have sent someone out to pick some up.”🫣\nOwners, a great way to have a beautiful business fail is not have proper training protocol. 😉"
        ]
    },
    {
        "id": "ChIJyTvZW4YP3okR_LZ5orhRW6Y",
        "name": "Organa Food & Juice Bar",
        "address": "433 River St, Troy, NY 12180, United States",
        "latitude": 42.73725779999999,
        "longitude": -73.6871924,
        "rating": 4.9,
        "reviews": [
            "I was surprised at how great the food in here is! Very very clean food and all plant-based! The aesthetic of the place is beautiful. The cook is very handsome which was great eye-candy for myself while I was eating! Highly recommend! Good portions and prices. I got the mango habenero chicken sandwich and the sweet potato fries. They were amazing! Perfect take out place for bodybuilders and fitness pros!",
            "First time trying vegan chicken and waffles. You can honestly say it’s better than the original. 10/10 highly recommend. Food, service and overall quality is all set to a high caliber and it shows. 🙌🏼 definitely gained a new loyal customer.",
            "Ya’ll do not walk, RUN to Organa when you see that little green “open” lol .. their food is always always always on point and made with love! the first few times there you’ll definitely question “is this really vegan” and the owner will have no problems showing you the ingredients and explaining the process etc , long story short great vegan food, great customer service and the prices are beautiful go try!",
            "A hidden gem, if you’re not eating here your missing out. I had the classic “chicken sandwich” & it was the best chicken Sandwich I ever had, I’m still shocked at how this taste better than chicken. Awesome customer service with amazing tasting food I can’t say enough. You have to see for yourself. Awesome awesome awesome! Organa is at the top of my list.",
            "Cruising Google for a new spot to try I came across this place and my oh my! Their food is amazing!!! The owner was so nice. He stayed open a bit later to finish my order and chatted with me the whole time. Between the food and service it's definitely an A+"
        ]
    },
    {
        "id": "ChIJ7QlKMBQP3okRXdQFIB_Odyk",
        "name": "The Beanery Café",
        "address": "110 8th St, Troy, NY 12180, United States",
        "latitude": 42.7308671,
        "longitude": -73.68206529999999,
        "rating": 5,
        "reviews": [
            ""
        ]
    },
    {
        "id": "ChIJkQsKgxgP3okRgqLq8HSDFtY",
        "name": "Brazilbrazil cafe",
        "address": "46 King St, Troy, NY 12180, United States",
        "latitude": 42.7353052,
        "longitude": -73.6867537,
        "rating": 2.6,
        "reviews": [
            "Great Brazilian snacks!",
            "The place is closed.",
            "Great food",
            "Infested",
            "Não é bom, por favor, fique longe!!!!"
        ]
    },
    {
        "id": "ChIJ4wUnXAAP3okRczK1k3s67wc",
        "name": "MoJo's Cafe and Gallery",
        "address": "147 4th St, Troy, NY 12180, United States",
        "latitude": 42.7280264,
        "longitude": -73.689993,
        "rating": 4.9,
        "reviews": [
            "As a retired person, Mojo's Cafe and Gallery is a dream come true!  First, the place is very cute and the gallery has some incredible artwork.  We like to stop there in the morning for a coffee and delicious treats.  But the best part has to be the early nightlife and music. We went there for a 7:00 pm show and had no problem finding a close parking spot.  They had light fare and sweet treats as well as high-quality beverages, wine, canned beer, and locally brewed beer on tap.  The musicians were fantastic and played for a full two hours.  Our group had an absolute ball and will be returning with friends.  This is a can't-miss new gem for the city of Troy!",
            "MoJo’s Cafe and Gallery is continuing to evolve from a cozy espresso cafe to an amazing espresso, wine, beer, and cider cafe with top shelf, (and I mean TOP shelf) live music most nights of the week!  Niek and Alana, skilled musicians in their own rights, are masters of this journey, connecting with the area's best musicians as well as tapping into the talents of their well curated, nation-wide music community. Beyond the doors of the modest exterior at 147 4th St, Troy, all who enter will encounter an environment filled with welcoming vibes and creative energy. Enjoy the vibrant artwork, the delicious beverages, and especially, the high-quality music, priced at a \"song!\" Collect your BFFs and head to MoJo’s!",
            "Tonight was my first visit to MoJo’s Cafe & Gallery. There was an acoustic show featuring 3 delightful singers who played beautifully. The music lasted approximately 3 hours, from 7-10 pm & the cover was a mere $10 per person. The room is cozy & warm feeling, featuring beautiful art on the walls which is for sale. There is also an outdoor patio complete with shade umbrellas, seating, and a welcoming ambiance. MoJo’s Cafe is a wonderful space to enjoy hot & cold drinks, yummy snacks, & live music with friends & friends you have yet to meet.",
            "A great place to spend the afternoon listening to music!  Salads were fresh and tasty!  Bubbly great and oat milk latte perfect!   With diet restrictions I am always bringing my own snacks but didn't have to worry here!",
            "Fantastic place!! Delicious drinks (I had the nitro cold white tea, amaaazing), great vibes, good hours (doesn't close too early), friendly service, nice music, strong WIFI signal, really overall perfect place. I'll definitely be back. Highly recommended!!!"
        ]
    },
    {
        "id": "ChIJGRWttrYP3okRgVz57wMwDjw",
        "name": "JACOB ALEJANDRO",
        "address": "274 River St, Troy, NY 12180, United States",
        "latitude": 42.731978,
        "longitude": -73.6909306,
        "rating": 4.8,
        "reviews": [
            "Lovely cafe in a great location downtown.  The horchata latte and pumpkin cold brew were both delicious.  Staff here were super nice, making orders cleaning up and handling customers close to closing time.\n\nThis definitely isnt a food place, but the pastries are pretty good.",
            "I absolutely adore Jacob Alejandro; it's one of my favorite coffee shops in Troy. I've enjoyed a variety of their delightful coffees, from my beloved Horchata Latte to their indulgent Chocolate Milk Cold Brew. Their inventive flavors, like the cheesecake cortado, and seasonal offerings keep me coming back for more. And their housemade pastries—each one is a treat, from scones to cheese bread.\n\nThe ambience at Jacob Alejandro perfectly complements the experience, exuding class and elegance. I love the green accents and the attention to detail throughout the space. It's simply a vibe, and I also enjoy working from here every once in a while!",
            "Place is great for coffee. I got regular filter coffee all black and it tastes just like how I wanted. A little bitter. Cappuccino is well made and beautiful. Too bad we don’t eat much pastry breakfast but they look great.\n\nWe come here because the ambiance is well designed and the leather couch. Luckily we got here super early and the window seats are open. The town is so cute and quiet for a weekend getaway.\n\nI can tell the owners put a lot of thought into this place with little touches. There are a lot of tasteful green color. My maybe future cafe would totally have their vibe.\n\nOverall a great place for your first cup to just chill and relax.",
            "It's definitely a vibe. Love coming here on a Saturday or Sunday and grabbing a toffee coffee cold brew and a passion fruit sweet bun. Tried the Andouille sausage bun and pleasantly surprised by the honey mustard taste and snappy sausage. Perfect place for a coffee date and just hanging out in general. Bonus caught the farmers market last week and this week River fest. This place can get busy but it's worth it.",
            "Jacob Alejandro is *the* perfect coffee spot. It’s a very well thought out establishment. I love the unique curated flavors and that they don’t use your typical flavor shots. I’ve branched out and tried so many flavors in my coffee and was pleasantly surprised with every single one of them. Sure you can save a few dollars and get cheaper coffee other places. But I wouldn’t recommend it. You get what you pay for and here you’re getting the BEST. I’d be totally fine if I never had coffee anywhere but here for the rest of my life. The pastries are delicious as well. And the staff is always friendly! It’s not just coffee, it’s an experience."
        ]
    },
    {
        "id": "ChIJBePccuQP3okRQNQ6rCLgoh4",
        "name": "Pizza 88 Crepes & Waffles",
        "address": "2301 15th St, Troy, NY 12180, United States",
        "latitude": 42.7365784,
        "longitude": -73.6758557,
        "rating": 4.9,
        "reviews": [
            "Got chicken over rice…not a big fan of the chicken weird cut/texture/taste appearance. The rice and sauce were good. Service and atmosphere were good besides the weird customer that kept coming up too close to me at the counter when I was trying to pay…that’s Troy for you. Also wish they out the sauce on the side instead of all over the meal",
            "A little cold inside of the restaurant but well worth it. The food was perfect. Everything tastes very fresh, amazing desserts, very clean, exceptional service. You have options, this place has whatever you're craving. I've been back three times in the past two weeks.",
            "First time my best friend and I came here, the service was amazing and loved the food. What I ordered for brunch was the baba ghanoush hummus and for dessert I got pistachios waffle stick. Loved everything, would come back again!!",
            "Outstanding everything!!  The selection of build it yourself meals was amazing. The service was super friendly and the dessert selection is the best I've seen anywhere. Banana crepe in the picture",
            "Great overall experience. First time dining in. (We had gotten a pizza to go once prior.) The place was very clean and well-organized. Nice atmosphere. I kept it simple this time and had a chicken gyro. We decided to get some crepes to go. Due to a miscommunication, we ended up with a free milkshake. (They refused to let me pay for it.) Additionally, they were kind enough to give my baby a strawberry while we waited. We will be returning to try different foods and desserts in the near future."
        ]
    },
    {
        "id": "ChIJrwbQHaAP3okRh7R-mdU7ej0",
        "name": "DCC Cafe",
        "address": "15th St, Troy, NY 12180, United States",
        "latitude": 42.7295552,
        "longitude": -73.6792614,
        "rating": 4.1,
        "reviews": [
            "I like stopping here between class breaks to get breakfast if I had a late morning. Food is prepared quickly (usually within 5 minutes of ordering), the wait time is usually short, the coffee is good, and service is friendly.\n\nAlso, the Cafe is located within a college building, so it's only accessible to RPI students.",
            "Very epic place to stop at in-between classes. The coffee is decent, and they serve Starbucks coffee so there's that for you Starbucks nerds. They also serve other general drinks like water and soda. Feel free to buy snacks and have some pasteries, they're usually okay. The waits never that long so that's pretty epic. Wish they had more seating, but not much they can do about that. Also, tell them Fabulous Walrus sent you to get a discount.",
            "It’s basically a Starbucks, so they sell most of the same things as a Starbucks. However, they’re not the exact same as a Starbucks, so you won’t get free water like you would at an actual Starbucks. But if you’re paying it’s basically the same as a real Starbucks.",
            "Staff are wonderful and they have good drinks :) convenient location for students to get food before class",
            "Only for RPI student. I walked 20 minutes to get a cup of joe, only to be returned. Should’ve mentioned it here."
        ]
    },
    {
        "id": "ChIJY_up0zEP3okRr8UCiXyn6-4",
        "name": "Deli & Brew",
        "address": "64 Vandenburgh Ave, Troy, NY 12180, United States",
        "latitude": 42.6995741,
        "longitude": -73.6883849,
        "rating": 4.5,
        "reviews": [
            "Does this sandwich look good to you?\nHate waisting money in the Biden/Harris Economy .\n\nGuess I'll stick to just lunch here.\n\nEdit: Sandwich was Disgusting!\nRubbery and over cooked. You can't see the bacon, and l can't taste it. And what is the black stuff on my roll?\nStop selling breakfast sandwiches!",
            "Hands down the best subs you can get in the area!!! I haven't had much of their other food but I love their subs. Great selection of snacks and sides as well.",
            "I want to give them a 5 because the food is always amazing. The workers in the evening are not the brightest. They cannot get an order right. The last 6 orders I have had only 1 has been correct. I ordered in person the last time and had to repeat my order 3 times and got home and it was still wrong. The subs are amazing and the store has a variety of items but the current staff in the evening is not with it mentally or is just disengaged.\n\nUpdate: was here last week for sub. The owner should do an undercover boss or send in a recon team so he can see the customer service from the night crew. I had to repeat my order 4 times for it to be correct. I would not be shocked if they were stoned because that is how confused they all were. It was not busy. They were all over the place.",
            "It’s not terrible. I liked the New York style pizza. Other folks liked their clam chowder and corn chowder. Lot of different beer types if that’s your thing. Subs.",
            "I asked for a sub w. Lettuce and onions.\nI received a sandwich and no Lettuce.\n\nReplying to owner:\nIt was not busy only my mother and I and we ordered together.\nIt was yesterday after surgery however we ate it today."
        ]
    },
    {
        "id": "ChIJL9JY56UP3okRAp5KkLo468E",
        "name": "Cafe Deli-icious",
        "address": "413 River St, Troy, NY 12180, United States",
        "latitude": 42.7356569,
        "longitude": -73.6877356,
        "rating": 4.6,
        "reviews": [
            "Nice spot to eat, if you’re in the area. The staff is friendly, very upbeat and positive vibes, you can dine in or take out, and, unlike other small spots I’ve frequented, I didn’t feel rushed to quickly eat and leave right after. Highly recommend, prices for the portions are fair in my opinion.",
            "Wonderful vibe, numerous choices for breakfast or lunch, all tasty and reasonably priced. I'd eat here every day if I lived nearby.",
            "I had lunch this Friday afternoon. I ordered the Uncle Sam- a huge multi-meat hoagie. I could only eat 1/2 the sandwich; the other 1/2 was thoughtfully wrapped in advance to take back with me. The sandwich was great. The ambiance was inviting- the walls cluttered with humorous sayings. Special kudos to the friendly and witty young lady that took my order. This will be my go-to place for lunch when in Troy, NY.",
            "Just had a delivery.  The delivery  lady was extremely  nice.   I Have had a delivery  from them in the past. Their products are Ver y Good.  Can't  wait  to  enjoy my gift of chocolate  covered Strawberries later.  Highly recommend  them. Sue Burch",
            "Wish I could give zero stars to this stupidly bigoted business owner. Before you give them your business, I'd recommend you check out their facebook posts to see what kind of person you're giving your money to. This cafe will never have my respect nor my business again."
        ]
    },
    {
        "id": "ChIJhTQPdgAN3okRj7Q--GovTtI",
        "name": "Bora Bora Smoothie Cafe - Latham Albany",
        "address": "640 Loudon Rd, Latham, NY 12110, United States",
        "latitude": 42.734013,
        "longitude": -73.7627882,
        "rating": 4.8,
        "reviews": [
            "This place serves halal food. They have something for everyone. Huge huge menu. If u go today on September 21 u get 50 percent off of ur total bill. We will definitely be back.",
            "Smoothies and crepe lovers stop on into Bora Bora. This brand new spot opened up not to long ago. Its on route 9 loudon rd latham next to yoshi sushi. The restaurant is clean which is a plus. I came in looking to try something new. So I asked what the best Smoothies are and the cashier lady said lean machine and pina-colada. So I ordered two lean machines and they were delicious. The banana,chocolate and peanut butter perfect combo. The service was fast and very welcoming. I highly recommend coming in. Keep up the good work. You now have a returning costumer.",
            "All fruit and food is fresh and tasty. Way beyond my expectations. Loved it. Other places that sell sweet usually are too sweet, but this place was customizable to your taste, so if you like sweeter they can do sweeter or if you like regular they can do regular. Definitely recommend to everyone I know!",
            "100% recommended making this a returning Must Visit cafe. the menu offers are AWESOME and prices are very reasonable. filled with so many options, of sweet treats, drinks, and savory foods i have never seen offered before in the capitol region. i came here with my partner and friend for the first time and every item we ordered was delicious! so grateful that a cafe like this exists.",
            "10/10 I ordered the #13 Dreamy Creamy. It was so absolutely delicious. This is definitely a place I am going to frequent often. By far the best in Latham. Hope they are able to keep it up."
        ]
    },
    {
        "id": "ChIJT7O5s2sJ3okRL_y43YoGduE",
        "name": "Klubhouse Kafe",
        "address": "391 N Greenbush Rd, Troy, NY 12180, United States",
        "latitude": 42.6693253,
        "longitude": -73.6890528,
        "rating": 4.6,
        "reviews": [
            "Spent an overnight in this area. Researched places and found this one that seemed popular with photos and looked similar to another favorite place we have back home. We did take out and had it delivered to our hotel via door dash so cannot comment on the atmosphere.\n\nI’m aware this part is not so much the Kafe, but the whole order arrived a total mess with the contents all mixed together.\n\nThe first container of a smash burger club tasted awful with soggy bread, and with the soggy fries, overly salted. The chicken wings although presented like a soup since the blue cheese container must have fallen apart, were the highlight. The cannolis were 4 small pieces, nothing special.\n\nLooking at the location now and the comments more deeply it seems maybe they are known best for pizza.",
            "Update: We ordered from them a second time and unfortunately we were not as happy this time around. The pizza and chicken tenders as last time were great in fact even tastier this time! We wanted to try their fries and were disappointed to receive burnt, bland fries that we immediately threw out. We're hoping that this was just a fluke and will continue to order from here because the pizza is so good!\n\nOur new favorite go to place! Everything we got tasted amazing, especially their chicken tenders! We got it delivered and it showed up hot and even 10 minutes early. Definitely worth the buy.",
            "We just ordered delivery for the first time and needless to say it won’t be the last. The food was amazing! We got a variety of things to try and it did not disappoint. It’s nice to finally have a restaurant around with a variety of choices with quality across the board. Highly recommend!",
            "Klubhouse Kafe is always a hit! The chicken Caesar wrap is amazing with homemade croutons! Hard to make a decision between that and the Big Mac Quesadilla… and don’t forget the best pizza around!\nAlways great service.",
            "Great restaurant glad we found them would recommend them to everyone won't be disappointed"
        ]
    },
    {
        "id": "ChIJbQyiW1wN3okRkQjRaK_XlW8",
        "name": "The Works Cafe",
        "address": "594 Loudon Rd, Latham, NY 12110, United States",
        "latitude": 42.7272116,
        "longitude": -73.7609678,
        "rating": 4.2,
        "reviews": [
            "The Works Cafe has a Panera Bread feel to it. The food is very good. You can taste the quality. We will return.",
            "We go here often. It’s perfect for a little quick stop to grab a bite to eat. The eggs are outstanding. They have lots to choose from bagels, sandwiches, salads, smoothies etc. UPDATE: I used to give it more stars, however it has seemed to be going downhill every visit. The comments and other reviews are sadly all similar on how the cashiers tend to not be overly friendly and can get your order wrong. It's also just too expensive. For 1 bagel with egg and cheese it’s almost $7. We rarely go here anymore, which is a shame. I haven't seen any change after all the complaints on similar issues.",
            "I have never given a five star review. At most, a 4. I was saving my 5 for something out of this world and let me tell you, this is it!!!!! The best breakfast sandwich I have EVER had in my 29 years on this earth. I mean they say a photo says 1,000 words… just look how beautiful she is??!!!!?? I have no further comments on the subject…Just trust me on this one, do yourself a favor and get there right now!!!!!! I mean seriously, why are you still reading this? If you’re reading this beyond business hours then get your sleeping bag ready to camp outside so you can be the first customer when they open their heavenly doors at 6am. Every second you waste could be another second closer to a delectable party for your taste buds. Get going!!!!",
            "I tried ordering online but saw there were no soups and no way to order a soup.  I called the store and tried to explain and ask how to order soup through the online system.  I was cut off mid sentence being told \"you have to order online for pick up\"  Once I was finished being cut off I explained what I was trying to order and how it was not showing and asked if they had soups for the day.  She did provide the soups of the day and then \"stated I have no clue why you cant order soup online, place the rest of your order online and then come in and buy your soup\".  I said well that defeats doing your drive-thru pick up. She replied \"yeah I don't know what to tell you Human Resources handles it\".\n\nI decided against my better judgement to stop in the Cafe and pick up lunch anyways. Soup was lukewarm, it was chicken vegetable with rice and the rice was hard and undercooked! This is my third time getting their soup and all three times it was lukewarm!\n\nThis visit my Turkey Bacon & Avocado Sandwich was different than every other time I have ordered it.  The Turkey was like a cheap sliced deli turkey and not the carved turkey it normally is.\n\nIts extremely disappointing considering the prices are not cheap.",
            "Oh my word! So amazing! My two kids and I went here today for a little family date and it was PERFECT! They did have outside seating but we opted for indoors. EVERY SINGLE staff member was attentive, kind and hard working. Not once did I see them just sitting around. They were super kind to my kids and even swept up the mess we made WITH JOY . Like come on!\n\nI got a bbq chicken panini, a 24oz iced coffee.\nMy son had a plain bagel toasted with plain cream cheese, a smoothie and my daughter had a egg (they even seasoned it up for her!)\n\nOur total was like $28 for all of it and it is so worth it! The food is delicious fresh and high quality! Also you know where it's from ! (See the little nap picture!)\nWill definitely be going again with more friends and family!\n\nGreat job guys !!!"
        ]
    },
    {
        "id": "ChIJsxEbVIoM3okRIc1HoDLWDRE",
        "name": "Professor Java's Coffee Sanctuary",
        "address": "In the Shopper's Plaza, 145 Wolf Rd, Albany, NY 12205, United States",
        "latitude": 42.7181506,
        "longitude": -73.8033887,
        "rating": 4.3,
        "reviews": [
            "My husband and I went on a Thursday morning and there were only a few other people there so it was very quick and friendly service. I had the chunky monkey latte (banana and mocha) and an everything bagel with plain cream cheese. My husband had an americano and the French piggie (croissant with bacon, ham, egg and cheese). Everything was delicious and both plates came with a couple slices of pineapple which was a nice surprise. There are a few different rooms to sit in and we chose the library room so I could read for an hour in the comfy chair. There was a “take one, leave one” book shelf which was cute.\n\nI gave one less star because it is kind of dim and chilly, concrete floors, only 1 comfy chair vibes. Not super hygge. Despite that very small critique I will absolutely return to try more of their offerings and likely an espresso brownie. Yum!",
            "Delicious coffee and I want to come back and try the baked goods they looked amazing. Also it's great because this coffee shop is open early. The staff was super nice too.",
            "If you’re old school Javas fans you know the house that Javas started in. Nothing will be better than that but this new location still makes me keep a Javas 😊 smile on my face.\n\nHigh ceilings and wide open with two rooms nestled in the back (similar to the old spot). They roast their own coffee still and keep creating delicious sandwiches, wraps and drinks. Prices are less than “the Bucks” place but more than Stewart’s. All food is made to order and most of the baked goods are made onsite (such good cookies!!!!)\n\nFree WiFi and lots of room to sit and get things done, plug in and accomplish what you need to.",
            "I loved this place! The food was very good which I wasn’t expecting! I love the art on the walls that you are able to purchase. They are done by a local artist I believe. Will definitely be going back here when I travel that way again! I took a picture of the hallway wish I would have taken a better angled one! I was trying to get a picture of some of the art",
            "This was amazing. I ordered a Cafe au lait and a slice of chocolate fudge cake. Coffee was really good for only $2.50 and that cake was something else. It made me buy another slice to-go. The ambience was great too, with paintings, warm wood-like furniture… it was awesome! I was very happy with the service. She was bubbling with happiness and was smiling the entire time while taking the order. Real positive vibes! 😁"
        ]
    },
    {
        "id": "ChIJ9TJqtVUK3okRm9dxmUD2utU",
        "name": "Cafe Madison",
        "address": "1100 Madison Ave, Albany, NY 12208, United States",
        "latitude": 42.6657283,
        "longitude": -73.7920482,
        "rating": 4.5,
        "reviews": [
            "We stopped in on a Friday mid morning in September for brunch with a group of 6.  We were seated in the dining area immediately. Our server was friendly and attentive. The food was good. I didn’t have any alcoholic beverages but a couple in the group had bloody Mary’s and said they were good. Overall very nice experience.",
            "This place has been around for so long and I believe I've only been once when it was very small. I went on 10/14 (holiday so a lot of people off work) and there was quite a bit of a wait (25-30 mins for 2) but it did not disappoint. I cannot remember waitresses name but she was great. The food was outstanding and the upgrade to the restaurant is beautiful. Definitely would go again.",
            "Take out. Omelet was literally filled with onions. I actually removed them and a picture next to a very large coffee cup just for scale. Why? No feta, scoop of pesto dumped on it, spongy home fries. $14.",
            "The meal was decent overall, but the pricing doesn't align with the quality of the food. Like other reviewers have mentioned, the food arrives lukewarm, and the home fries certainly don't taste or look homemade. It feels like the restaurant is cutting too many corners while still charging for an 'experience' that doesn't deliver.\n\nOn the bright side, the staff is warm and does their best to be attentive, though they seem stretched thin due to understaffing.\n\nOne major concern is the bee issue on the patio. It’s disappointing that patrons are left to decide if they’re willing to \"take the risk\" to dine outside. This situation reflects a lack of responsibility on the part of the restaurant, where simple accountability could vastly improve the customer experience.",
            "Café Madison is the spot for a solid Sunday morning brunch! Despite the 30-minute wait (which was well worth it), the vibe was cozy and inviting. I went all out with the Cheesesteak Omelette and Eggs Benedict — and trust me, both dishes hit it out the park. The omelette was packed with tender steak and gooey cheese, cooked perfectly with every bite. The Eggs Benedict had the silkiest hollandaise, and that poached egg was chef’s kiss!\n\nIf you’re looking for a brunch spot that’ll satisfy your soul and leave you thinking about breakfast all week, Café Madison’s where it’s at. Pro tip: Get there early if you don’t wanna wait, but if you do, just know it’ll be worth every second. 👌🥚💯"
        ]
    },
    {
        "id": "ChIJUX8xKYcJ3okRg49MDLG9wNA",
        "name": "Romans Cafe",
        "address": "800 N Pearl St, Menands, NY 12204, United States",
        "latitude": 42.6802775,
        "longitude": -73.7359903,
        "rating": 4.9,
        "reviews": [
            "The food is homemade and made with care. The food is seasoned and fresh. The chicken cutlet reminds me of both my mother's and grandmother's (a rare occurrence).\n\nThe owner is friendly and extremely enthusiastic about his food, and the specials are diverse and delicious. I anticipate Roman's will be a regular treat ☺️",
            "Since finding Roman's Cafe a few months ago, our office staff orders take out there a minimum of 4 days a week. Food is fresh and delicious. It will not disappoint.",
            "Can't say enough good about this place. Food is always amazing and Joe is such a friendly person and welcoming. You will not go wrong with Romans Cafe!",
            "I love this place. Great food, good prices, and friendly people. If you’re not an employee in the building, it’s a small commitment to trek to the basement location to find it, but it’s worth it!\nYou can even call ahead for takeout.\n\nMy favorite thing is the breakfast bowl. I have to say that when the only other local breakfast options are Duncan Donuts or Stewart’s , this fresh-cooked food is a VERY welcome alternative. They also make lunch items, but I haven’t had those yet.",
            "Ordered the Buffalo Chicken Panini for lunch on DoorDash. Food came nice and hot and it was delicious. Highly recommend for lunch time if your working in downtown Albany."
        ]
    },
    {
        "id": "ChIJTcpPhzAK3okRFTfmZM-BYRw",
        "name": "Iron Gate Cafe",
        "address": "182 Washington Ave, Albany, NY 12210, United States",
        "latitude": 42.6560789,
        "longitude": -73.7624927,
        "rating": 4.7,
        "reviews": [
            "Staff was friendly, helpful and professional!  The ambiance was relaxing and very interesting given the history of the building. The food arrived fresh and was served by someone who seemed proud and happy to present the fare. Drinks were delicious, food amount was ample and flavorful and we didn’t feel rushed or pressured to end our experience. Highly recommend.",
            "Iron Gate Cafe is one of my favorite brunch spots in the area! Their outdoor patio is perfect for enjoying the cozy atmosphere, especially when the weather is nice. The interiors are also gorgeous.\n\nOne of the highlights is their ever-changing specials menu, offering fun options like unique drinks, soups, and mains. Their regular menu is consistently delicious--I love their Benedicts, omelets, breakfast burritos, and various coffee options. Their side potatoes are a standout favorite too!\n\nThe service is always excellent--quick, attentive, and extremely kind.\n\nJust a heads-up: they're usually packed! If you're planning a weekend visit, be sure to join the waitlist online. Iron Gate Cafe is definitely one of our top picks for breakfast in the area.",
            "We had an enjoyable experience overall. Initially, we were seated in the middle section of the restaurant, which lacked the ambiance and openness of the front and back areas, as it had no windows or natural light. However, our server graciously accommodated our request to move. We ordered the French toast with berries and eggs along with buttermilk pancakes with vegetarian sausage, both of which arrived promptly. The only drawback was the limited parking, as street parking can be challenging to find, especially on a busy Friday.",
            "The food was absolutely awesome and them having a beer license was very nice as well for brunch. The servers were polite and I had no complaints. For those who care the atmosphere is on the fruity side. Other then that if I were in Albany again, definitely will be making a return.",
            "Delicious breakfast selections, everything next level, e.g., strawberry pancakes with real strawberry chunks, poached eggs perfectly cooked. Beautiful location with outdoor seating between classic brick buildings. Actual iron gate gives NOLA feel in summer. Warmly welcoming and fast service."
        ]
    },
    {
        "id": "ChIJCZeLdSYK3okRdeO2KZQRuT0",
        "name": "Courthouse Cafe",
        "address": "16 Eagle St, Albany, NY 12207, United States",
        "latitude": 42.6525308,
        "longitude": -73.7528556,
        "rating": 4.8,
        "reviews": [
            "Great service and good food for the price. Sure the menu size is small but to be fair I’ve only ever seen 2 people working there. Would recommend. I would say the only downside is that you will have to go through security to get to the cafe.",
            "Hands down the BEST bacon, egg and cheese in the capital region (and believe me, I’ve tried a lot). Perfect ratio of bacon to egg to cheese on a fresh hard roll. And if that wasn’t enough to get you to go there, the family who runs it is so kind and hard-working. Their other breakfast and lunch offerings, including the coffee, are equally as delicious and they have the best prices, especially for downtown Albany. It’s located in the Albany County Courthouse, but is open to the public and has a sweet dining area. You won’t be disappointed and will be supporting a lovely family.",
            "I really enjoyed my hot sandwich here, they do have a grill. Kind of hidden, on the Sub-Basement level of the court building and to the right as you enter. Open for breakfast and lunch.",
            "Classic. Home cooked style! What more you want at corporate level stakes?",
            "Great food! Fast friendly service"
        ]
    },
    {
        "id": "ChIJwyQkHzcK3okR2ntqg-rf7LM",
        "name": "Umana Yana",
        "address": "240 Washington Ave, Albany, NY 12210, United States",
        "latitude": 42.6573655,
        "longitude": -73.7648162,
        "rating": 4.6,
        "reviews": [
            "Extraordinary place. East & West African & Caribbean selections I crave and never would expect in U.S. I had a scrumptious plantain cocktail. Afro-Carib mixology? Brilliant!! I could go back and try something else every night of the week. And Chris & staff could not have been more warm and welcoming. Diversity of diners--black, brown, white--,a testament to multicultural success.",
            "I had the Curry Q dish with a side of plantains. The food here is so filling and reminds me of my Caribbean routes. Everything tastes so fresh. The ginger beer was great for my digestion. I recommend this place and will bring people here in the future.",
            "This restaurant is absolutely spectacular. When you walk in, it’s so cozy and both the decor and everyone working is incredibly welcoming.\n\nThere is a great drinks menu and on the reverse side, a really interesting wine list. Then comes the hard part, choosing what to eat! We wanted to try everything but I guess we’ll just have to return in the future. The pepper shrimp had great flavor (and a lot of heat) which the cassava puffs tempered. And they had a curried goat special which was unbelievable. The goat was so tender and the flavors were perfectly melded together. We ended with the rum cake to go and it made a perfect treat later on in the night.\n\nThis was a fantastic meal and we can’t wait to come back to try more!",
            "Umana Yana is a fantastic spot that truly captures the essence of international cuisine. Umana offers an authentic taste of the Caribbean with vegan, gluten free, & vegetarian options.\n\nThe cozy, family-style ambiance adds to the overall experience, making it a must-visit for anyone craving a culinary adventure in Upstate, NY.\n\nI have attended their last 3 Jazz brunches. Make sure you reserve your table to elevate your dining experience and secure your table! It’s a highly recommend spot and can get busy!",
            "This was truly an exceptional experience. All three dishes we tried were excellent. The red bean stew, Asa Wat, and the curry tofu. Plantains, Moroccan slaw and house ginger beer - fantastic. The food was so good we ordered dessert even though we were stuffed. Also, fantastic. The flavors were complex and not to be easily replicated. Highly recommend."
        ]
    },
    {
        "id": "ChIJ_0LvS-IN3okRcevJ9iD9VjQ",
        "name": "BARE Blends",
        "address": "664 Loudon Rd, Latham, NY 12110, United States",
        "latitude": 42.7357942,
        "longitude": -73.7643002,
        "rating": 4.4,
        "reviews": [
            "Bare Blend is my preferred choice for healthy options, but my experience at the Latham location was disappointing due to unprofessional service, specifically with regards to how my Bare was served.not so happy how it setrved!",
            "Kayden is the best! She is super friendly and makes my bowl perfectly every time. Great employee!",
            "Overcharged for order and also found a hair inside waffles. Shame how a place with so much potential can be ruined by the people who work there.",
            "Really Healthy Food 🍓🫐 I do like their Sandwiches also! 🥪",
            "i visited this location recently and i want to give a shout out to one of your employees cynthia , she made my visit very pleasant and she was also very helpful! i will definitely be back for another smoothie bowl, yummm!"
        ]
    },
    {
        "id": "ChIJDwCBJgAL3okRcV7Epr9Ihic",
        "name": "Bowled",
        "address": "560 Madison Ave, Albany, NY 12208, United States",
        "latitude": 42.6548249,
        "longitude": -73.7723523,
        "rating": 4,
        "reviews": [
            "I ordered a fruit bowl without two components. My bowl was half empty perhaps because I didn’t get the other two fruit items but I tipped pretty decently so 10$ for a half a bowl of fruit was unacceptable. I would appreciate it if my bowl had more of the other 3 fruits I did order or some money should’ve been taken off since I was still charged the same price for less fruit. I am a bare customer and this is why they will continue to be my preferred choice. Fruit was fresh tho.",
            "Food is good. I ordered a “protein toast” which the website/online menu that i scanned in store says comes with steak. They made it without steak and when I asked about the steak they said that the website should’ve had the steak in parenthesis as an optional add on. Although the toast was good, this mistake was pretty annoying bc I ordered the toast with the expectation that I’d get steak on it. A bit disappointed since this is my first time trying this place and the workers made no effort to rectify my disappointment besides a “sorry ma’am”. I will probably not be coming back.",
            "Absolutely delicious! I had a l spinach salad with grilled chicken, beets, goat cheeze and more with a white lemon dress thru the Build Your Own Bowl option. Had it delivered so I will have to check it out in person. Great healthy tasty addition to the area. Went back and it was great in person to sit down. Lovely ladies managing. Cannot beat this in Albany for healthy eating. So many options. Got Salmon and my cousin had spicy thai chicken, edamame, black beans, feta and parmesan. Out of sight. The options somehow seem deeper than Chopt while the ambience is more humble. Small footprint but we sat comfortably on cushion benches. No calorie bubbly water and chips to finish the meal. They just need to stay open later so we can hang out!",
            "I placed a pickup order and it took fifteen minutes to make a smoothie. I got the coco smoothie and added blueberries; but it tasted like watered down blended peanut butter; I really couldn’t taste much of anything else. Also a very small cup for something that is nearly ten dollars. 🍅🍅🍅🍅🍅🍅🍅🍅🍅🍅🍅",
            "I did a pickup order for BYO Bowl. I didn't initially look inside the bag , being on a time constraint. As soon as i got back to work…i could say my first experience was upsetting. If customers have to pay 15 dollars for a bowl it should be filled to the top with a good amount of toppings . My bowl was not worth the money i spent, it barely had anything in it and did not look appetizing."
        ]
    },
    {
        "id": "ChIJY7CejdgL3okRyvgvRuwTSkI",
        "name": "Cafe Madison",
        "address": "359 Northern Blvd, Albany, NY 12204, United States",
        "latitude": 42.6760041,
        "longitude": -73.7486187,
        "rating": 4.4,
        "reviews": [
            "10/10 stars from this gal! The service was great; every staff member we came in contact with was very friendly, helpful, and just overall great personalities! The food was amazing! Super tasty, food came out quickly even though they were pretty busy (Sunday morning breakfast)! We sat outside, so I didn't see much of the inside, but from what I could see, it looked very cool & was very clean! Outside seating was great; plenty of space, clean, and great little location.\n\nWould absolutely love to come back for any meal! The menu was super inclusive and had a lot of great breakfast items to choose from!",
            "Tuesday brunch @10am\nAmbiance (5/5): The decor is so cute! It was nicely lit and open with several booths on one side and table seating on the other.\nService (5/5): We had no problems getting seated and serviced throughout our meal. There were few in attendance on a random weekday.\nSeasonal Special: Croissant Beni  $17 (5/5) which had a poached egg on a croissant. Interestingly, the dish sat on top of the hollandaise sauce rather than it drizzled on top. I requested for the house fries to be cooked well-done and it was indeed delivered as such! The fries were seasoned well and had a superior crunch to them!\nBlueberry Buttermilk Pancakes $7 (4/5): I wish we had the ability to ask for a single stack because the 2 for $7 was way too much for us in a sitting. We left with 1 whole pancake untouched. Sadly one of the pancakes was meager in blueberry ratio.",
            "Pretty good breakfast place, the french toast is nice with the berries and toppings.  The coffee was standard.\n\nThe food and ambiance are good but lack the charm of the nicest breakfast spots in the area.  The parking and interior are spacious and the service is good.",
            "Loved everything about our breakfast. The place is really cute, well decorated and comfy. The food was quick and everything was delicious. The staff were all super friendly and welcoming. We will definitely be back!",
            "My wife used to work in Albany and we frequented the original cafe on Madison but on a recent drive up to the Adirondacks from points south we stopped here. We loved it. Had a great brunch. Pretty typical breakfast and brunch fair with a little twist here and there. Highly recommend!"
        ]
    },
    {
        "id": "ChIJuznbX2cL3okR8xnE-vD79LA",
        "name": "BARE Blends",
        "address": "1475 Western Ave, Albany, NY 12203, United States",
        "latitude": 42.684234,
        "longitude": -73.83942449999999,
        "rating": 4.2,
        "reviews": [
            "I totally enjoyed the smoothie bowl called Beach Bum that I tried for my first visit. It was a thoughtful and delicious blend with healthy ingredients and attractively arranged. I felt healthy eating it!",
            "I stayed away from this place for almost one year because of increasing prices with decrease in quality. On 4/7/24, I thought, let me give it another shot. The juices were reported made on 4/7/24. Watery!!! They tasted like pure ice was added.The smoothie bowls prices are up but less toppings; they tasted good because I added additional cashew cream which looked about a teaspoon. Presentation was good though. The worst part of the visit, my daughter and I were eating with about 2 spoons left to go and were rudely chased out by one of the young women (the team leader). The 3 young women were unpleasant as I could overhear them rudely discussing customers. People desperately want a good juice bar/vegan spot. Lawddd! No luck here. I have a Nama J2 and a Vitamix and can do better than this. Plan: No return.",
            "It’s not the fastest service, but I love it! The space is beautifully decorated in a clean and comfortable style, with attention to every detail.",
            "I have always loved this place. The drinks are delicious and nutritious.  Unfortunately, due to one of the ex employee, I was limited from going to the store  Now that the employees not there anymore, I couldn’t wait to go back to to get my shake I did just that on Sunday  Christine, the manager was so courteous and so welcoming even though the store was closing in 15 minutes.  Cashier and Christine were so busy but still was able to provide friendly service. I really appreciate their working ethic  Thank you for the great service and the delicious drink",
            "Delicious offerings and appears everything on the menu is very vegan friendly. Tried the Chai smoothie which was very yummy; mini garlic waffles with guacamole and balsamic side salad; Mini sweet cinnamon waffles with blueberries, almond butter, and side of chopped strawberries. Everything was delicious and well made. Also enjoyed all the compostable utensils and to go containers. The staff was pleasant, informative, and welcoming. Lots of space to sit down. Will check out their other locations to compare."
        ]
    },
    {
        "id": "ChIJeQRLCzkK3okRon4kCS6Lc38",
        "name": "Cafe Hollywood",
        "address": "275 Lark St, Albany, NY 12210, United States",
        "latitude": 42.6535851,
        "longitude": -73.76678079999999,
        "rating": 4,
        "reviews": [
            "We’re out of towners staying close, and were looking for a quick meal and a couple drinks. Vibe was good, wings were awesome (at least from a West Coast perspective). Bartender was friendly and pleasant.",
            "Been here a couple times. It's ghetto an they charge a cover fee ( For a bar type ) atmosphere after a certain time even when the bar is dead. Over priced drinks an food is straight garbage an will give you heartburn. Only two good things is the pool table and the back patio for when you wish to take a smoke break. Place is honestly a joke of a bar. They have four bouncer at all times for a 90% dead bar.",
            "I visited Cafe Hollywood on a Friday night and was surprised to find a $20 cover charge. So of course I left!\n\nThe next day, I returned for St. Patty's and the vibes were completely different—I actually preferred being there during the day. They had some dope St. Patrick's Day deals, which was a plus.\n\nHowever, my experience was dampened by the fact that the bartender seemed to be stealing tips. I had intended to tip her anyway, but I noticed that she took the tip directly from my money on the very first round, which didn't sit right with me. As a result, I didn't tip for the rest of the time I was there.\n\nOverall, Cafe Hollywood offers classic pub fare in casual digs with a full bar and a patio. The drinks was decent, but the tipping situation left a sour taste in my mouth.",
            "The food was okay. We had lemon pepper honey which I  do not recommend. It smells like burnt beef gravy. The habanero pepper was better. The drinks were good. Cannot complain about the service. Many of the other customers were young af and rude. The restroom was clean but didn't have soap. I've come in one other time just to use the restroom, and then too they didn't have soap.",
            "Update: went back like I said I would. A waitress was rude to my spouse. I got really upset and went to confront her. The bouncer was polite and helped diffuse the situation.Despite this, I still like this place and have a good time when I go.  Most of the staff is cool.\n\nOriginal review below:\n\nThis place is fire! The wings and fries I got were so good. I celebrated my bday here with my spouse and baby. So much fun. Music Poppin!  I ate and drank inside. Had my temp taken at the door. My waitress was bad azz and wearing masks. Beer kicking. I have decided I am gonna be a regular. I do have one question for the owner though...what happened to the Black Ghostbuster!?😭 The art on the table is of old movies I love, but there is a Ghostbuster missing! Please add him!"
        ]
    },
    {
        "id": "ChIJAQDwD5sM3okRKnUZcTfpxLs",
        "name": "CoreLife Eatery",
        "address": "109 Wolf Rd Suite 4, Colonie, NY 12205, United States",
        "latitude": 42.7165729,
        "longitude": -73.80902669999999,
        "rating": 3.7,
        "reviews": [
            "We live in VT and often drive through Albany when we travel. My daughter is on a grain/sugar/processed foods free healing protocol, so we thought we hit the jackpot when we found this place.  The first two times we went it was the middle of the day and kind of busy, so we dismissed the dirty tables, figuring the staff hadn’t had time to get to them.  This time, we were driving through right at opening so we arrived just as they unlocked the doors.  Every single table was dirty. The trash area was disgusting.  The bathrooms hadn’t been cleaned. We were the first customers!  I couldn’t count the number of health code violations, and was too scared to peek inside the kitchen.  The food looked fresh and tasted good, so there’s that, and the staff was friendly, attentive and efficient.  This had nothing to do with them, and everything to do with management and ownership.  The owners are clearly not paying attention and shouldn’t own a restaurant- hopefully they either sell it or wise up before someone gets sick.  We won’t be back unfortunately.",
            "Ordered online for pickup.  Decided to try the new steak bowl.  Steak was cooked so rare it was still cool and rubbery.  My bowl was missing the potatoes that should have been in it as well.  Some of the lettuce was black and disintegrating it had gone so bad.",
            "DO NOT GO TO THIS CORE LIFE. Worst experience ever. I have never been treated so bad at a restaurant in my entire life. I walked in at 7:30 with the intent to get a Steak Bacon & Blue salad (add corn) for my mom and a broth bowl for myself. I specifically decided to go to core life because I have a viral infection and always go to get a broth bowl when I’m sick. My plan was to get a bowl with rice noodles, corn, carrots, scallions, shredded cheese ginger, a little bit of cucumber basil dressing, beef broth, steak and cilantro. I also have celiac disease, so am a frequent CoreLife customer, however I don’t think I will be returning after this incident. When I walked in, everything was basically packed up. The two employees were extremely reluctant to help me, but I had checked online, on their door, and to make sure that nothing had been posted about them closing early because of the weather (it snowed today). Nowhere did it say they were closing early. The female employee just threw everything in my mom’s salad; it looked terrible. She also scooped her dressing from the top of the dressing container, so it was all oil. (See attached images). When I told her what I wanted in my broth bowl, she refused to put ginger in my salad because she said she had nothing to cut it with (i know that’s a lie, I get ginger at core life almost every time I go). I know they have the grater, but it was very clear she had already put it away. She also told me she didn’t have beef broth and only had chicken broth. When she went to do the dressing, I got extremely annoyed; knowing that they only put oil in my moms dressing, and she used the to go container cups to put my dressing in, and put WAY more dressing than I asked for in my broth bowl. She didn’t put the bacon in my mom’s salad, so I reminded her, and she very rudely grabbed it and put the bacon on. At this point I was completely appalled. I said, “there’s really no way you can put ginger on?” (Since I’m sick, that’s really the only thing I wanted to make me feel better). She snapped back, “i already told you no. I have nothing to cut it with. I just want to go home”. I said, “well it’s a shame you guys close in a half hour”. She said “No- we’re closed now”. I said, “well, online and on the door it says you close at 8”. She said “well we’re closing early because of all this (pointing at the snow) you’re too late”  and threw my food in a bag. At this point I was too disgusted to even ask for the cilantro. I have never been so degraded by and treated terribly by staff in my entire life. I have worked in customer service since I was 16 years old, and NEVER would talk to a customer like that. Ever. No matter if they made me stay at work 20 minutes after closing (which has happened to me). When I got in the car I cried. All I wanted was a healthy broth bowl to make me feel better since I’m sick, and from somewhere I felt safe eating at with my celiac disease. After I left I went to the store to purchase some ginger to put in my bowl, and when I got home to eat it, it wasn’t even edible because of how much dressing she put in it. I had to take some dressing out and dilute it with my own chicken broth just to be able to eat my meal. I am so hurt I will never return.",
            "I got a large bowl of the teriyaki rice bowl with a side of potatos and Mac and cheese. The mac and cheese had no flavor of anything not even cheese, it was basically mush and undercooked because there were hard to chew pieces. I somehow got sweet potatoes and regular potatos on my side all I tasted was the flavor of the sweet potato. My bowl was okay but there was barley any rice and and huge amount of some type of seed. I also had paid extra for kimichi and avocado which there was barley any of the kimichi. I had also tipped so I am very disappointed",
            "I love CoreLife Eatery, especially the franchise in Albany on Wolf Rd. The Dinner staff I'd great and the food is always fresh. I highly recommend the Smoothies!"
        ]
    },
    {
        "id": "ChIJmzu86iIK3okRi_ul5idKXl4",
        "name": "Hill Street Cafe",
        "address": "180 Madison Ave, Albany, NY 12202, United States",
        "latitude": 42.6466695,
        "longitude": -73.7580959,
        "rating": 4.5,
        "reviews": [
            "My family walked in around 3:00PM on a Sunday. There was only 1 girl serving the entire restaurant from the bar to all tables! Although she was terribly busy, she maintained her professionalism. Especially she has kept being polite, nice, with a big smile all the time.\n\nFood was delicious. Especially its puffy pizza.",
            "Morgan was outstanding. She handled all the orders without fail appeared to carry out all the order seemlessly and even change the TV station to our liking. Kudos to her and her service.\nFood was outstanding. We ordered pizza,  nachos and salad. Very good place to eat",
            "I go to this place once in awhile and the food is always good and drinks are too.I got the lemon pepper wings and my friend got the hot wings 🤤 I went back another night and had the buffalo chicken salad. ( big chunks of buffalo chicken) I had it with the Parmesan dressing so good 😋.",
            "6 of us enjoyed dinner here on Sunday evening before a nearby show. If you have an event in the area, this is a great option for a centrally located restaurant. And they are open Sundays, which was hard to find.\nEven without a reservation, we managed to get in. However, we were there early; I suspect a table might have been harder to get later on. Service was amazing! Drink refills without asking, servers checking in just the right amount, and overall great customer service.\nIt is a small pub, which means it gets loud. This was fine for us, but if you are looking for a quiet spot to have long conversations, this will not be the place you want.\nPub food and pizza seems to be their specialty. Boneless wings were very good; a medium sauce had just enough spice. Mozzarella sticks also good (great marinara!) and a decent amount of them too. The pizza was delicious! I snuck a piece of my hubby's pepperoni pizza and loved it! Homemade sauce, great crust, and a nice balance of sauce to cheese. Sandwiches we ordered were good, just not outstanding. If I go back before another show, I would honestly order some more apps and pizza (I was thinking about getting chicken tenders, but didn't. Bet they are great!).\nOverall, a solid choice if you are in the area for a show and looking for some great pub apps and pizza.",
            "Been here maybe a dozen times in 20yrs. Always has me coming back! Nothing disappointing about this establishment. My 3 older brothers frequently here a bit more than me, just because I spent a lot of time away Actuve Duty Navy. Thank you, everyone, that has worked here over the years .. quality hasn't diminished."
        ]
    },
    {
        "id": "ChIJEVvh1QcP3okR4_g15LGi0Ms",
        "name": "Famous Lunch",
        "address": "111 Congress St, Troy, NY 12180, United States",
        "latitude": 42.7286799,
        "longitude": -73.68901009999999,
        "rating": 4.7,
        "reviews": [
            "The food is average but the price is fantastic. I tried the mini hotdogs with the works. They were more like a chili dog than upstate NY meat sauce hot dog. The burger and fries were good. The rice pudding was homemade so, better than the store bought but not quite as good as Grandma's recipe. It's nice to see a little mom and pop place like this is still open. You can fill up without shelling out a lot of money.",
            "Yummy little hot dogs! We loved the crispy fries. Old school atmosphere 🥰",
            "My all time favorite lunch spot. Literally my first choice, always. From a kid, to bringing my kids. Their mini hot dogs and sauce are truly the best around. Staff is always kind and polite. Hard workers! If you havent been, you're missing out!",
            "Not just a greasy spoon. It’s not just an aesthetic. This place is the real deal. Why have one got dog when you can have two, why have two hot dogs when you can have four covered in meat sauce and mustard.  The little dogs are so cute and satisfying to eat. But don’t miss the burger. It doesn’t look like much but it’s truly special. The fries are also perfect. Wish I could be a regular here",
            "As usual, it is standing room only here. Scott and his crew serve up mini hotdogs with meat sauce and other delicacies that will make your mouth water !\nIn my younger days, my brother and I could eat twenty hotdogs each at a sitting. Nowadays, five is my limit. I always grab five extra \"for later\" since five just isn't enough. One other strong point that keeps me coming back is that they serve RC cola and 7 up - two of my favorite soft drinks. Thanks again, Scott !"
        ]
    },
    {
        "id": "ChIJkR4YIEEN3okRBeRhnX2MfR8",
        "name": "Innovo Kitchen",
        "address": "1214 Troy-Schenectady Rd, Latham, NY 12110, United States",
        "latitude": 42.7713388,
        "longitude": -73.8242673,
        "rating": 4.4,
        "reviews": [
            "Went with group of people and had a great experience. Everything we ordered was very delicious. We all shared a bit of everything we ordered. The portions were really great. The tots are addictive. And I was surprised at how delicious my bratwurst was. Excellent flavors. Service was great and pretty fast even with how many people were there.",
            "When they first opened I met a friend here for drinks and an appetizer... Left such a remarkable impression that I couldn't wait to go back. Well... It took me awhile to get back here but the right time and day presented itself for the wife and I. From when we walked in the door till we left first class all the way. If you haven't been before sure I can give you a recommendation - ANYTHING on the menu. If I had more then one stomach I would have gotten/tried multiple items. I've included pics but I promise you - you won't be disappointed - you'll be glad you went!",
            "We went for lunch and it was delicious! The fries were so crisp, the sandwhich cooked just the way I liked and the onion soup was so creamy. Can't wait to go back! Restaurant was cool and waitstaff was very friendly.",
            "We had a late lunch here on New Year’s Eve day and the seafood risotto was delicious.  Fun cocktails served in a comfortable atmosphere with gf options.  The tuna salad was yummy too.  The hostess and waiters were incredibly kind and helpful making our holiday meal out feel special.  It was a great way to spend the last day of the year.",
            "I got the chicken burger, which was good but it took a really long time to actually get it. We arrived at ~11:40 but didnt actually get our plates until ~12:30. 2 of the forks that came in the cutlery napkins had dried food on them.\n\nSome of the other people in my group chose fries as a side, and they said that they came out a little soggy. It might have just been the time of day that we came which backed up our orders/causes these issues. However, i did feel felt the waitress we got was very good, as she always made sure to come by and refill our water cups."
        ]
    },
    {
        "id": "ChIJ6_nS9iYL3okRRry4M15Uewo",
        "name": "Uncommon Grounds Coffee & Bagels - Western Avenue",
        "address": "1225 Western Ave #5, Albany, NY 12203, United States",
        "latitude": 42.6772669,
        "longitude": -73.8235339,
        "rating": 4.4,
        "reviews": [
            "Great spot for coffee and breakfast bagels! Relaxing cafe for work or chill. Compared to other places it’s on the cheaper side, and the quality is outstanding! I got the Mediterranean with cream cheese on everything bagel, and my friend got the lumberjack on everything bagel, plus 2 orange juices, our total was $22 the sandwiches were huge and delicious.",
            "I've been here a few different  times and it's always the same. The kindness, attentiveness, speed, accuracy  and taste.\nRegardless how busy they are you will be seen.\nYou can tell they put intention into every detail including the atmosphere, cleanliness  and especially  the coffee.\nGreat job guys",
            "I had a doctor's appointment Thursday morning little early. Decided to go and get something to eat so I found this little place in Stuyvesant plaza. Oh my goodness! Nice clean, friendly people. Excellent bagels. Nice sandwich. I was really impressed with the service how fast it came out and The taste. The bagel was awesome! So if you're in the area of Cyrus and plaza, you need to stop at uncommon grounds",
            "I can never say enough good things about uncommon grounds, everyone who works there is great and the food is always fantastic.\n\nWriting this review I'm tempted to go eat there now. Were they open at least.\n\nEdit, ate there again today. A perfect healthy harvest bagel always hits the spot!!",
            "If I had to define the place in two words: Amazingly Fresh! Amazing coffee ☕️, the best bagels 🥯, the best giant size cookies, and the healthiest available options!\n\nTry their Healthy Harvest Specialty Sandwich for $5.85:\nLettuce, Tomato, Onion, Cucumbers,\nGreen Peppers, Sprouts, and Cream\nCheese or Dressing. However, I recommend Hummus instead of Cream Cheese for a little extra cost.\n\nOr “Create Your Own Masterpiece” Bagel Sandwich starting at $8.25\n\nStep 1: Choose Your Protein:\nRoast Turkey, House Made Chicken Salad,\nHouse Made Tuna Salad\n\nStep 2: Choose Your Cheese:\nCheddar, Swiss, American, Provolone,\nMonterey Jack\n\nStep 3: Choose Your Condiments:\nMayo, Horseradish Mayo, Dijon Mustard,\nHoney Mustard, Pesto, Oil & Vinegar\n\nStep 4: Choose Your Finishing Touches:\nLettuce, Tomato, Onion, Cucumbers,\nPeppers, Sprouts, Jalapenos, Roasted Red\nPeppers, Capers, Avocado"
        ]
    },
    {
        "id": "ChIJP_fVP_0L3okR8hdymAbkRUU",
        "name": "Peppy D's Cafe",
        "address": "20 Corporate Woods Blvd, Albany, NY 12211, United States",
        "latitude": 42.67993449999999,
        "longitude": -73.7648576,
        "rating": 4.6,
        "reviews": [
            "Yummy office small cafe with fantastic fresh Nicks Muffin breakfast sandwich w fresh egg cheese ham on pillow soft englishbmuffins with amazing affordable prices!",
            "Owner seems very friendly first thing in the morning and is always ready to help me with my breakfast needs now that my office building shut down its cafeteria.  Plus, the food is great!",
            "I enjoyed everything about having breakfast at Peppy D's I am so happy I found this gem. Will return!",
            "Good food in a pinch for anyone working in Corporate Woods or surrounding area. I've always have had good experiences here. 5/5 stars",
            "They gave me a microwaved hash brown pattie that was disgusting! My omelet was dry and over cooked, and the tables were filthy!"
>>>>>>> 449b1315efb8165762a9702899e519b93eccdcb6
        ]
    }
]