[
    {
        "id": "ChIJ0fKv7g4P3okRMDPsMT3EtxY",
        "name": "Prospect Park",
        "address": "Prospect Park, 65 Prospect Park Rd, Troy, NY 12180, United States",
        "latitude": 42.7241378,
        "longitude": -73.68452359999999,
        "rating": 4.3,
        "reviews": [
            "It's sad that such a nice park is being misused by some of the residents of the city that it is in. Not to mention they cannot spend any money A major overhaul of the pool that i'm sure was beautiful in his day. I think the overlooks\nshould be cleared a little bit more but it is a nice place to sit and just relax.",
            "I grew up coming here to Prospect Park for playing football, basketball, Frisbee and to cookout. The park was shuttered for a while after a certain political party basically ruined the place of public enjoyment. The roads are and we're in bad shape. I was happy to see on a chance drive by a cpl years ago, the gates were open. I come here to photograph the city in various stages of weather, time as in day or night. The deer are a plenty at 2, 3, 4 a.m. I find it cathartic and peaceful. It was the land where Samuel and Ebenezer Wilson built there home and afforded their livestock to roam and graze. Yes that Samuel 'Uncle Sam' Wilson, whose meatpacking business shipped to United States Army during War of 1812. The troops started to say The US stamped for  United States property as \"Uncle Sam\".\nI do believe that The new Mayor will do the best to get the place in shape at some point. After years of indescribable idiocy from the political party that has   mismanaged everything they touch. So the new Mayor is one of unity and common sense. In that, I have confidence to see there will be improvement here. It will give the Residents of Troy, the park that The Wilson's intended for the public.",
            "Jr. Prom that night on the JP Morgan.  Park was in the vicinity and everyone wanted photos of the lovely couple.  The park made a great back ground for photos.  Plenty of parking, which was good since a lot of people had the same idea.  Well maintained and clean.  Great start to a memorable night.",
            "Prospect Park in Troy, New York, is a historic and well-loved green space that offers a variety of amenities and a peaceful environment. Here’s a review of the park:\n\nPros:\n\n1. Panoramic Views: One of the standout features of Prospect Park is its elevation, providing stunning panoramic views of the city of Troy and the Hudson River. It's a fantastic spot for sightseeing, especially at sunset, when the landscape is bathed in golden light.\n\n2. Variety of Recreational Facilities: The park offers a wide range of recreational amenities, including tennis courts, basketball courts, and playgrounds. There’s also plenty of open space for picnicking, playing catch, or simply relaxing on the grass.\n\n3. Historical Significance: Prospect Park has a rich history, being one of the oldest parks in Troy. It was designed in part by Frederick Law Olmsted, the famous landscape architect behind Central Park. The park’s historical elements, like the beautiful stone pavilion and walking paths, add to its charm.\n\n4. Well-Maintained Gardens: The park features well-tended gardens, including a rose garden that blooms beautifully in the warmer months. These areas are perfect for a leisurely stroll or for simply enjoying the floral beauty.\n\n5. Community Events: Prospect Park often hosts community events, such as outdoor concerts and festivals, which draw locals and visitors alike. These events add a vibrant and communal feel to the park, making it a focal point for the community.\n\nCons:\n\n1. Limited Parking: Parking can be challenging, particularly during peak hours or events. The park’s popularity means that finding a spot might require some patience, especially on weekends.\n\n2. Aging Infrastructure: While the park is generally well-kept, some areas, such as the playground equipment and certain paths, could use updates or repairs. The age of the park is evident in some of its infrastructure.\n\n3. Seasonal Maintenance Issues: During certain times of the year, particularly in the winter, some parts of the park may not be as well-maintained, with snow or ice making paths difficult to navigate. In the summer, the park’s popularity can lead to occasional littering, though it’s usually addressed promptly.\n\n4. Crowds During Events: While community events are a positive aspect of the park, they can also make it very crowded, which might detract from the peaceful experience some visitors seek.",
            "Park would be a lot nicer if the city took better care of it. A lot of the roads in the park are closed, because they're falling apart. The roads that are open are in bad shape. The bathrooms have been closed for years, because they are in bad shape. They did put a few port a potties next to the closed bathrooms. There is a new disc golf course, if you're into that, and over near the tennis courts, there's some newer workout equipment. There is a nice playground for the kids, and a small splash pad. Several grills and picnic tables throughout the park as well. The park is in a beautiful spot, and has a nice view of the city, but overall, needs a lot of work to make it nice again."
        ]
    },
    {
        "id": "ChIJVy6X4gYP3okRmoZhNRmED6U",
        "name": "Sage Park",
        "address": "51 Congress St, Troy, NY 12180, United States",
        "latitude": 42.7288281,
        "longitude": -73.69270829999999,
        "rating": 4.7,
        "reviews": [
            "I used to come here as a young boy to ride my bike, it's hardly changed and I love it!",
            "Small park but very clean, great to relax and soak in the rays. There are a couple benches and also some grassy areas for a blanket!",
            "very nice small park, close to restaurants in downtown Troy",
            "Me and the pup used to walk here almost every day but even now that we've moved up the hill every time we're in Troy we stop by.",
            "It's a pretty park in the middle of Troy. Generally clean, and the dogs are nice."
        ]
    },
    {
        "id": "ChIJOcWELuwP3okRXwBEpImCyMI",
        "name": "Frear Park",
        "address": "Frear Park Rd, Troy, NY 12180, United States",
        "latitude": 42.7511714,
        "longitude": -73.66873629999999,
        "rating": 4.7,
        "reviews": [
            "The city of Troy, NY, made a significant investment in the golf course a couple of years ago, which resulted in huge improvements. Golfers come from miles around to play. Every time my husband & I  walk to the park on nice days, it is always busy. There are picnic areas, tennis courts & an ice rink for the local hockey players. We also enjoy getting take out from the Park Pub which is renowned for its chicken wings as well as a ham & cheese on marble rye with wholegrain mustard sandwich called  The Half & Half which is a local favorite.",
            "Frear Park's lake view is a hidden gem in the heart of the city, offering a picturesque escape from the hustle and bustle of urban life. This serene spot, nestled behind the somewhat dilapidated tennis court, is a haven for nature lovers and those seeking a moment of tranquility.\n\nThe centerpiece of this scenic haven is the glistening lake, which is home to a charming community of ducks that gracefully glide across its surface. Watching these ducks is a delight, and it adds a touch of enchantment to the whole experience. As the day winds down, the lake provides a front-row seat to a breathtaking sunset, casting a warm, golden hue over the water that's simply mesmerizing.\n\nFor those who prefer not to sit idly by, there are well-placed seats along the lake's edge, inviting visitors to relax and take in the view. You can also explore the tranquil surroundings with the walking trail that meanders around the lake. This trail offers a perfect opportunity to get some exercise and immerse yourself in the natural beauty of the park.\n\nWhile the adjacent tennis court may show signs of age, it doesn't detract from the beauty of the lake view. In fact, it adds a touch of nostalgia to the experience, reminding us of the park's history.\n\nIn conclusion, Frear Park's lake view is a sanctuary of calm and beauty, where you can escape the daily grind and reconnect with nature. Watching the ducks and witnessing the sunset here is a truly magical experience. Whether you're seeking solitude or a leisurely stroll, this place has something for everyone, making it a must-visit destination for anyone in search of natural beauty in the heart of the city.",
            "I try to visit Frear Park as often as I possibly can, the park is always clean and well maintained with beautiful views and freindly people throughout. I especially like the golf course were I visit with most all of the golfers and the people who walk the trails, such a wonderful gift to the people of Troy.",
            "This was a fun little course with plenty of nice views. The greens are very very tough. They are very hilly and unpredictable. You will enjoy this place",
            "Frear Park Golf Course is in beautiful shape and condition! Greens are running fast (holes 7&8), fairways are green and fluffy and tee boxes are well cut and defined! Good job Superintendent!"
        ]
    },
    {
        "id": "ChIJ_3Wr6gcP3okR1z27fPtHCXU",
        "name": "Barker Park",
        "address": "64 3rd St, Troy, NY 12180, United States",
        "latitude": 42.7297879,
        "longitude": -73.6903633,
        "rating": 3.8,
        "reviews": [
            "Small, cramped, and not that clean. Doesn't appear kid friendly or even me friendly. OK to eat something quick from a local eatery and get bothered for change, but it isn't as bad as the bus stops",
            "A very nice small private park in the downtown Troy area next to a religious Church where the beauty of this small Park offers an inner city getaway",
            "Over all nice,  but alcohol abusers around the park makes it little intimidating when bringing kids.",
            "The plantings have been very nice this year. Looks like the swings are back.",
            "Very nice little park located at64 3rd St, Troy, NY 12180\n\nKiddos friendly"
        ]
    },
    {
        "id": "ChIJv9fWVwQP3okRpbKl_konu4E",
        "name": "Washington Park",
        "address": "195 2nd St, Troy, NY 12180, United States",
        "latitude": 42.7240858,
        "longitude": -73.6925151,
        "rating": 4.2,
        "reviews": [
            "Nice quite little park, convenient for taking a little break. The trees in the park are beautiful and the brownstone apartments that surround it are beautiful as well.\nTogether they're like a lil oasis to grab a few minutes of peace and quiet.",
            "Change review: spectacular greenery! And love the statue water fall but I don’t believe I’ve ever seen the water actually flowing through it or falling… needs more seating around or forms of seating maybe more statues or pieces of art would be ideal.",
            "This park looks nice and unfortunately its sole purpose is to raise property values in the surrounding area. It is privately owned and you can only get in if you have a key but even if you do you're not allowed to do anything except sit there. Pets and having fun are strictly prohibited.",
            "This is a relatively clean appearing park. We went to see the filming of the show The Gilded Age. It was so cool seeing all the horses and carriages and people dressed up!",
            "Best and biggest city park in Albany. Lots of events, festivals, performances, and activities throughout the year. Or just go for a leisurely stroll or a small picnic with friends. The tulips and Tulip Fest are a highlight!"
        ]
    },
    {
        "id": "ChIJD-5TzZgP3okRC7tTXa5eEvo",
        "name": "Beman Park",
        "address": "4 15th St, Troy, NY 12180, United States",
        "latitude": 42.7336976,
        "longitude": -73.6745911,
        "rating": 4,
        "reviews": [
            "Decent spot with all of the essentials. Parks swings, and a basketball court. However, the two playgrounds themselves are not all that great quality. Relatively small playground areas.\nA defining aspect of this playground is it's calisthenics gym. There are 7 different stations each meant to be done for a minute each. Great way to be active and it got the extra star for it's addition.",
            "Great Troy, NY Park! Community staple for years, kept well, great location & usually clean! Full size Basketball Court (Blacktop, 2 10' Hoops) & Childrens Play Areas. Too bad Hospital Staff Lunch Breaks are so short or I'd bet you'd see more weekday action, Beman!",
            "Not very exciting as far as parks go.  There is some grass, a hill, some dilapidated tennis courts.  Closer to the hospital there is a functional basketball court and some playground equipment but it's rarely used to my knowledge.  I think the main purpose of this \"park\" (more like a large patch of unused land Troy happen to mow every few weeks) is to provide shortcuts from Jacob Street to Peoples Ave without walking all the way down to 15th.\n\nThat said, this park is fairly well trafficked during daylight hours, I've never felt unsafe walking.\n\nBeman Park, and the surrounding neighborhood, is often the target of Troy Police initiatives dealing with RPI students, don't let this make you feel the park is anyway unsafe.",
            "Very annoyed because I typed dog park into Google and it brought me here. THERE IS NO DOG PARK! why is it so hard to find a spot to bring your dog to play in this city!?",
            "Great place to take your kids. Me and my children had so much fun here"
        ]
    },
    {
        "id": "ChIJTZQN1moP3okRRq4HEjmlSVw",
        "name": "William D. Chamberlain Riverfront Park",
        "address": "255 Front St, Troy, NY 12180, United States",
        "latitude": 42.7331606,
        "longitude": -73.6909623,
        "rating": 4.6,
        "reviews": [
            "Mildly trash filled park but no homeless staying. Pretty good third space. See image and video below for further information",
            "Always fun stopping over here during the week or saturdays for the farmers market. During the summer they open the spray park and it’s great for families with little kids to get cooled down. They have seating for adults. I like to sit and read while my kids have a blast in the water. It would be nice to have a little playground or something too.",
            "Nice views of the Hudson River, clean , seating available, sprinklers in the warmer months",
            "A great place to take a stroll during the day or even during the evening. The renovated path definitely helps make the place feel a little less sketchy. In the summers they have free yoga on Sundays and other events throughout the year. A great part of the Troy community.",
            "Great for parties, strolling by the river alone or with that special friend 👀, or hosting a rally. There's fun for everyone!"
        ]
    },
    {
        "id": "ChIJUQBPAksJ3okRAOwHa7qMMiQ",
        "name": "Ganser-Smith Memorial Park",
        "address": "53 Menand Rd, Menands, NY 12204, United States",
        "latitude": 42.6960309,
        "longitude": -73.7265128,
        "rating": 4.7,
        "reviews": [
            "It’s a beautiful park. Very well maintained. I like that there are benches right up next to the playground and the play equipment is looks like new. There’s also a lot of swings for babies and kids alike.\n\nIf this park had shade and the slides/tubes didn’t collect so much water it would be an easy 5 star.",
            "This is a wonderful looking Park. The grounds are well groomed and kept. The atmosphere presents like a gated community and seems less friendly to visitors, probably due to the very close neighboring homes. It can use some symbols of inclusivity but still a good first impression.",
            "Excellent Park in Menands, NY, with a covered Pavillion and grill for Village events and available for inexpensive rental. Tuesday has Village Concerts in the Park and Wednesday sees Food Trucks with Village sponsored music. On-site clean bathrooms as well as year-round activities make this a terrific spot for family, friends, and residents!",
            "This is a nice, quiet neighborhood park featuring a jungle gym for toddlers & one  for slightly older kids. There are plenty of picnic tables to enjoy a small lunch at. There is a nice basketball court too. This park also has a canopy with beautiful backdrop features. And along side that is a tennis court! It's definitely a must visit park! #illseeyouguysthere #followme #ritarants 😊 IG: @geeitsrita",
            "We love this Park. It's well maintained. Has bathrooms (though I believe they are only open May-September). Big enough to keep the younger kiddos entertained but not so big that it gets over crowded. Two play structures (one on the smaller side), a rock climbing wall and plenty of swings. There is a basketball court and a baseball field.  There is also a large Pavillion area with picnic tables that I believe can be rented. All of the families I've met there have been very sweet and even the older pre-teens that come to play basketball have been very respectful. A hidden gem 💎."
        ]
    },
    {
        "id": "ChIJs9RqVrMP3okRtpmIU_n6Rzk",
        "name": "Brotherhood Park",
        "address": "Watervliet, NY 12189, United States",
        "latitude": 42.7350294,
        "longitude": -73.7043205,
        "rating": 4.1,
        "reviews": [
            "Some of the people aren't social at all; it's like (for some reason unbeknownst to me,) I ALMOST ALWAYS positively initiate point of contact, sometimes a handshake, after talking, perhaps a hug, (I'll ask first) conversation, eye contact, (ppl SEE 👀 ME, some known, DEFINITELY HEARD 👂, body language, etc.\nI'm not gonna get too psychological on some ppl, unless asked- 🌻\n\nBut I almost Almost always change some one's mind about \"stereotypes\" and make a friend!🌹 YES!, all this happens and I'm aware. Whether me and my other half,  are exercising, or I'm playing with together, AND WATCHING  2 of my GrandBabies, keeping keen eyes 👀 on them; as I relish in delight of them being GODS' children, and my children's children🌹",
            "I go to read and relax and watch the boats go by great pavilion close by for having that barbecue that you want",
            "A nice park for the kids. I take my great grandson after school. Get all that bottled up energy out!",
            "The pictures are not of Brotherhood park, the pictures are of Waterliet Hudson Shores park(Picklepark). 😉 Brotherhood park is located on 25th street and 6th avenue in Watervliet.",
            "It's a nice place to go and relax take a walk I wouldn't hang out in there for too long though"
        ]
    },
    {
        "id": "ChIJYxisQooP3okRA7syKg87eJM",
        "name": "Hudson Shores Park",
        "address": "2 Selke Dr, Watervliet, NY 12189, United States",
        "latitude": 42.7307898,
        "longitude": -73.697889,
        "rating": 4.5,
        "reviews": [
            "This has become my place to relax at.  I have not tried using the BBQ pits here yet.  It's just a.nice quiet place to visit and sit or go for a walk at",
            "Good place for picnic, but no BBQ.",
            "Very relaxing and claming environment ⚘️🪷🪷",
            "When I need a quick getaway to calm my nerves… this is my go to!",
            "This is such a great place to go to for fishing walking your dog, cook out and to just relax and watch the boats going past on the river.. you can also rent out one of the picnic areas to have family reunions birthday parties or anything else it's a nice size space that will hold a large amount of people."
        ]
    },
    {
        "id": "ChIJU3hioNoO3okR6641NIfRGX8",
        "name": "Town of Colonie Schuyler Flatts Cultural Park",
        "address": "595 Broadway, Watervliet, NY 12189, United States",
        "latitude": 42.705452,
        "longitude": -73.711191,
        "rating": 4.6,
        "reviews": [
            "Basically a big open field with a few trees in the middle. Concrete path that goes around perimeter.\nConnects to Hudson bike trail in the back.\nA few benches.\nSome history reading areas along the way.",
            "Non-Smoking sign is back up again after some public park vandal took it down, and this is thanks to the Colonie Parks and Rec Supervisor and those who put the sign back up. Changed from 1 to 4 stars due to this. This is a great park to walk, exercise, get fresh air and bring your children so they can enjoy the fresh clean air. This is a great park with the exception of some who ruin it for others and believe they’re above following the rules of public parks. And when not remove signs that are there to protect the most vulnerable (children). Hopefully I and the other folk who bring their children to this park to get fresh air won’t have to have their children’s lungs contaminated with different types of smoke.",
            "Open park, nice and warm. Safe place to walk children and your your pets. Had a great time. The straight smaller path around the park is . 7 miles and twice around is ~1.5 miles.",
            "Great place to walk  or let the kids ride bike.  There are no bathrooms or actual amenities here.  It is just well manicured expanse of flat land that connects to the bike trail.",
            "Great place to get your walk in. Or just to sit and watch nature."
        ]
    },
    {
        "id": "ChIJdaZKH-cP3okRMapx_8ZuQTM",
        "name": "Knickerbacker Park",
        "address": "103rd St & 8th Ave, 320 7th Ave, Troy, NY 12182, United States",
        "latitude": 42.7614133,
        "longitude": -73.674959,
        "rating": 4.1,
        "reviews": [
            "I was invited to play softball as my work place has a team that participates in a league. I was reluctant at first, but decided I have been getting lazy and just get out with the weather being perfect.\n\nI dragged my son in with me and he wants to make a trip back to this park already. There are multiple softball grounds and has some historic significance which I have no clue.\n\nI got my exercise, my son had fun and that is  all that matters. There were other kids there playing football, on scooter, bike, mini motorcycles, softball and some play equipment which looks fairly new.",
            "Visited here for Lansingburgh soccer games. Nice and clean facilities. Nice park with up close parking.",
            "It's a small track here we like to walk on is also an ice skater ring inside the building it's going to reopen soon",
            "I saw Knickerbocker Park on my map and since I needed somewhere to relax I walked 12 blocks to visit what I HOPED was a nice park. When I arrived all there was is a baseball diamond attached to a school, and a playground designed for the UNDER 5 group. The few toys on the playground were extremely run down.\nThere was what at one time might have been a pretty fountain, but it was full of weeds and no water. There were 2 pretty run down picnic tables.\nThe grass was in dire need of a lawnmower and the entire park needed love.",
            "The fields are kept in decent shape. They are adjacent to the school and have parking most of the time. There is a single porta potty there so keep that in mind."
        ]
    },
    {
        "id": "ChIJ_ZHobFYN3okR725mtd_o6lY",
        "name": "Latham Kiwanis Park",
        "address": "3 1st Ave, Latham, NY 12110, United States",
        "latitude": 42.7458772,
        "longitude": -73.7534884,
        "rating": 3.5,
        "reviews": [
            "The tennis courts and basketball courts are very nice. The playground seems to be lacking, but it was quiet and clean. No dog area and no restrooms.",
            "Updated with photos. This park is UNSAFE and DANGEROUS. The playground equipment is broken in multiple areas and the swings & metal areas are rusted. Very disappointing that these complaints have been going on for more than 3 years and nothing has changed.",
            "Nice park.  Lots of grass to walk the dog on.  Basketball and pickleball courts and some kind of performing arts center building. The kids playground looked a little rough with a cracked slide (6/24) so I took off a star for that. I did not see any restrooms.  I think there was one picnick table.  I didn't see any signs about not allowing dogs so I think they are allowed.  One trashcan available.",
            "This is the park that time forgot. It was once quite nice, but it's now dilapidated, with paint peeling, tennis courts cracking, and grass overgrowing.  There are some nice soccer fields still, and basketball courts that are still in use, but on the whole the playground has seen much better days. It's so forlorn that even the sign is misspelled. No bathrooms or concessions.",
            "Smells like garbage. Broken equipment. Not a good place for kids."
        ]
    },
    {
        "id": "ChIJQVG6Bb8P3okRiH3j7Hg3W9M",
        "name": "7th Avenue Park",
        "address": "2910 7th Ave, Troy, NY 12180, United States",
        "latitude": 42.7458718,
        "longitude": -73.68114039999999,
        "rating": 3.9,
        "reviews": [
            "Bathroom is dirty and looks like someone was living in it. My daughter stepped on glass in the sprinklers. There are several teenage brawls daily. This park was beautifully redone just for the teenagers to destroy it. Sad",
            "This is a nice little park. I went in late November so we didn't stick around too long. But the equipment looks new and the swings squeak as all swings do.",
            "Someone’s always getting shot down at the park every time you turn around. I hope the changes in the park start bringing good things for the neighborhood but I don’t cross my fingers. It starts with the people there.",
            "One of Troy's best! The community does a great job of keeping it clean and clear.",
            "Nice park but no where to park .\nPlayground in rear where you can't see your kids from the sitting area.\nCity keeps it clean daily."
        ]
    },
    {
        "id": "ChIJ2Tdu4igO3okRaKALrnqQpYw",
        "name": "Lansing Park",
        "address": "34 James St, Cohoes, NY 12047, United States",
        "latitude": 42.76859109999999,
        "longitude": -73.7099044,
        "rating": 4.2,
        "reviews": [
            "Kids go to school here. Enjoy the park and pool during the summer. 8 generations have enjoyed this pool. I personally have for over 47 years.",
            "Pool was almost empty and water green.  Gives the impression that no one takes care of it.  We were there way before labor day and it was closed.  No restrooms either",
            "Top-notch Cohoes Youth Soccer\nAwesome season,  very productive!!!",
            "Traveling from out of town and this park is great! Great place for the kiddos to get out and stretch their legs, burn some energy!",
            "This is not far from our house but I am always nervous when my kids walk anywhere by themselves and it's not because I don't trust them, I don't trust other people, let's face it, the world isn't the same as it used to be many years ago, now you have to always be on your guard, and what makes me even more nervous is the fact that an 11yr old was taken by a 16yr old from this very park, and that is extremely scary.  I mean the park and playground are very nice with lots to do, but it's always very busy. And now for me with this latest situation of the 11yr old being taken, my message to other parents, Please Please watch your children and if you aren't going to be with them make sure they have a way to check in with you!!! It's not a 100% safe world out there and you have to always be on your guard, you just never know.  Stay safe to you all."
        ]
    },
    {
        "id": "ChIJgZauRSAQ3okRagJKKbq4aMY",
        "name": "Powers Park",
        "address": "3rd Ave, Troy, NY 12182, United States",
        "latitude": 42.7690184,
        "longitude": -73.67918949999999,
        "rating": 4.4,
        "reviews": [
            "been going here for summer concerts for a good number of years...great clean park, gets great vendors, great stage and audio setup...first year I've been here to see the really great looking awning setup... attended today to check out modern country cover band Grit -N- Whiskey!🎼🥃",
            "It's a very peaceful place! I love the concerts they have every Saturday between the months of June- August! Could have public bathrooms at least 1 through out the year for the people who go there to sit and enjoy the weather and the park.also would be nice if they had a water fountain for people to get drinks on very hot days.maybe even a sprinkler for the kids to cool off.besides the concerts they don't really have much there but a few tables but it's a nice place to just go and sit.",
            "Nice venue for a concert.  No pets but everyone has beers.",
            "Had an amazing time good people clean good music danced eight good food my friends came it was a great place to hang out and just meet people stuff for the kids to do I was actually going to paint a painting of the park That's how much I liked it I think I still will I will post a photo on here afterwards so I will one can see how amazing the place is you should definitely check it out if you have spare time and there is a pool close by so the kids can go swimming good food across the street bar if you like to drink come check it out everyone",
            "Had a great time with Sound Doctrine and Victory chapel band . Preaching and singing for Jesus"
        ]
    },
    {
        "id": "ChIJi-D5OKEP3okR7Az0DtkW_jk",
        "name": "Clinton Park",
        "address": "1861 8th Ave, Watervliet, NY 12189, United States",
        "latitude": 42.7309709,
        "longitude": -73.70808629999999,
        "rating": 3.4,
        "reviews": [
            "Nice playground with sets play, one for children between 2-5 and the other for older children.\nThe park is equipped with table & bench sets, swings, basketball area...\nPark is open from 7 am to 10 pm.it is situated in residential clean and nice area.\nNo restroom.",
            "Good for small kids. Good basketball court swings open field and play equipment area. Alot of teens hang here. Saw a few fondling and kissing. No restrooms. Something to consider. We practice here for t ball.",
            "Kids love it here. Nice and relax 👍😊😊😊",
            "Very nice basketball area with a sprinkler system and a dog park..what more do you want. Will visit again one day maybee again today..",
            "I love this clean park. Not alot of kids are there so it's great that it's not crowed."
        ]
    },
    {
        "id": "ChIJ2xWhqCQP3okRG3txIMRthJ0",
        "name": "Burden Environmental Park",
        "address": "85 Thompson St, Troy, NY 12180, United States",
        "latitude": 42.7068903,
        "longitude": -73.68921069999999,
        "rating": 4.5,
        "reviews": [
            "With the recent trail work and clean up at the Burden Pond Environmental Park starting in May of 2019, a new life has begun at the park. New, maintained and well marked trails are found here now and accessible during all four seasons! Great Improvement to the once decrepit park",
            "The falls are beautiful but I had a lot of trouble finding it. Turns out you have to drive a little further down the road, past where maps tells you to stop. If you go through the woods a little you can walk in and around the falls.",
            "Good for a walk around the falls as well as the park itself",
            "Has a small creek, and nice waterfalls. Good for a quick walking trip.",
            "So fun. So many trails."
        ]
    },
    {
        "id": "ChIJZ7Fi58MP3okRiuJtKcUJBm8",
        "name": "Freedom Square",
        "address": "35 5th Ave, Troy, NY 12180, United States",
        "latitude": 42.7540073,
        "longitude": -73.6816496,
        "rating": 4.2,
        "reviews": [
            "Awesome young man. Keep doing wat u r doing in life one day u will be a great dad, and always remember that ure parents want nothing but the best for u. And remember to always show respect to get respect and stay loyal.",
            "No longer just an empty lot - but the great thing is the community and the activities that take place here, organized by Sanctuary for Independent Media, Troy Bike Rescue, Missing Link Ministry, Collard City Growers",
            "5th Avenue from the south (historic Troy) meets head-on 6th Avenue from the north (proud Lansingburgh) at the intersection of 101st Street.  When these two distinct cities merged in late 1800s, the northern one full of green spaces, carpenter-crafted homes, and sloop building industries agreed if it could keep its original street names, and 'better' school system.  City of Troy is the only USA municipality with two school systems:  Enlarged City School District of Troy and Lansingburgh School District.",
            "Candle Lighting Ceremony",
            "Good place for family barbecues they have a pavilion with tables public restrooms and a playground"
        ]
    },
    {
        "id": "ChIJlZG2CbcP3okRx2FiU8CB0aE",
        "name": "Paine Street Park",
        "address": "200 Paine St, Troy, NY 12183, United States",
        "latitude": 42.747598,
        "longitude": -73.690934,
        "rating": 4.2,
        "reviews": [
            "This splash pad, playground and park are absolutely fantastic! Mr. Mullens runs the park along with his staff. They take great care of the park and are very welcoming and helpful. The splash pad is amazing for the kids. I would highly recommend checking out this summer! The kids use old plastic coffee tubs as buckets (plastic ones break). Kids always have a blast!",
            "How cute is this place?! I LOVE water so when I saw this I wished my neices were young again! Very nicely done.",
            "Went there to get wet and it was so hot and the sprinklers weren't on besides that it was a nice park",
            "Like another reviewer stated they're not really careful about who comes it's a beautiful Park and the facilities are terrific.",
            "Says it is open 9am to 9pm on Saturday and when we got there it was closed and there was no one there"
        ]
    }
]